[
  {
    "title": "\"Hell-Bent On Carnage\": 10 Killed As Pickup Truck Rams Crowd In New Orleans",
    "author": "",
    "description": "Several people are feared dead after a car ploughed into a crowd in New Orleans on New Year's Day, local outlets reported.",
    "text": "\"Hell-Bent On Carnage\": 10 Killed As Pickup Truck Rams Crowd In New Orleans The incident took place in the early hours of New Year's Day. Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email Police said the driver tried to hit \"as many people as possible\". At least 10 people were killed and over 35 suffered injuries after a pickup truck ploughed into a crowd in the southern US city of New Orleans on New Year's Day. The driver of the truck also fired at the crowd and exchanged gunfire with the police. Officials said a crowd was celebrating when the pickup truck drove into it at high speed at the intersection of Canal and Bourbon Street in a part of the city known as the French Quarter. While the police said the driver of the pickup truck was \"hell-bent on creating carnage\", the FBI - which has taken operational command of the investigation - said a suspected explosive device has been found on the scene. The FBI also said the driver is now dead and the attack is being investigated as an \"act of terrorism\". NOLAREADY: There has been a mass casualty incident on Canal and Bourbon Street. Get yourself away from the area. Visit https://t.co/AyuRn38guC for details. — NOLA Ready (@nolaready) January 1, 2025 \"The 8th District is currently working a mass casualty incident involving a vehicle that drove into a large crowd on Canal and Bourbon Street. There are 30 injured patients that have been transported by NOEMS and 10 fatalities.  Public safety partners are responding on scene,\" New Orleans' emergency preparedness campaign NOLA Ready said on its website. Police said the driver tried to hit \"as many people\" as possible and two police personnel were also shot and wounded. \"This man, this perpetrator, he fired on our officers from his vehicle when he crashed his vehicle. Two of our officers have been shot. They are stable... He was hell-bent on creating the carnage and the damage that he did,\" Police Superintendent Anne Kirkpatrick was quoted as saying by news agency AFP. Ms Kirkpatrick said the truck had been driven at \"very high speed\" and in a \"very intentional\" manner. In a statement, the FBI said, \"This morning, an individual drove a car into a crowd of people on Bourbon Street in New Orleans, killing a number of people and injuring dozens of others. \"The subject then engaged with local law enforcement and is now deceased. The FBI is the lead investigative agency, and we are working with our partners to investigate this as an act of terrorism.\" Louisiana Governor Jeff Landry described the incident as a \"horrific act of violence.\" Packed With Revellers Emergency authorities said the incident took place at approximately 3:15 am local time. At that hour, the French Quarter, renowned for its bars, restaurants and jazz history,  would have been packed with revellers. CBS News reported witnesses saying the truck rammed into the crowd before its driver jumped out and started exchanging gunfire with police. A white truck crashed through a barricade \"at a high rate of speed,\" witnesses Jim and Nicole Mowrer said. \"Once it was past us, we did hear gunfire, saw police running that direction... Once the gunfire stopped, we stayed in the alcove until the gunfire stopped, came out into the street, and came across a lot of -- several people who had been hit, (we) wanted to see what we could do to help,\" Nicole Mowrer was quoted as saying in the AFP report. New Orleans is one of the most visited destinations in the United States and the attack came shortly before the city hosts a major football game, known as the Sugar Bowl, featuring teams from the University of Georgia and Notre Dame. The city police department had announced staffing at \"100 percent, with an additional 300 officers assisting from partner law enforcement agencies,\" including on horseback and using unmarked units. The iconic French Quarter listed special deals for New Year's, including LGBTQ parties and a drag cabaret close to where the incident took place. German Attack The incident comes days after five people were killed in a similar car-ramming attack in Germany. More than 200 people were also injured in the December 20 attack in the eastern city of Magdeburg, which was allegedly carried out by a man of Saudi origin. The attacker has been arrested and police are investigating whether he is mentally ill. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: New Orleans , New Orleans Car Attack , Car Rams People",
    "link": "https://www.ndtv.com/world-news/multiple-casualties-feared-as-car-rams-crowd-in-new-orleans-reports-7377297",
    "published_date": "2025-01-01T20:34:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/ir4jm28g_new-orleans-car-attack_625x300_01_January_25.jpg"
  },
  {
    "title": "\"Toxicity, Abuse\": Post By Delhi Cafe Owner's Wife Days Before His Suicide",
    "author": "",
    "description": "Less than a week before Delhi cafe owner Puneet Khurana died by suicide, his estranged wife and business partner Manika Pahwa had put up a cryptic post on social media stating that she had been subjected to \"toxicity and narcissistic abuse\".",
    "text": "\"Toxicity, Abuse\": Post By Delhi Cafe Owner's Wife Days Before His Suicide Puneet Khurana and Manika Pahwa, co-owners of the popular Woodbox Cafe in Delhi, were going through a divorce. Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email Khurana's family has blamed Ms Pahwa for his death. Less than a week before Delhi cafe owner Puneet Khurana died by suicide, his estranged wife and business partner Manika Pahwa had put up a cryptic post on social media stating that she had been subjected to \"toxicity and narcissistic abuse\" and was now free. The couple, co-owners of the popular Woodbox Cafe in Delhi, were going through a divorce. Khurana (40) was found hanging in his room in Model Town's Kalyan Vihar area on New Year's Eve. He had spoken to Manika on Monday night and recorded the conversation, in which the couple can be heard fighting over issues related to the business. Khurana's family has blamed Ms Pahwa for his death and said she \"instigated him\" to die by suicide. In her post on Instagram from six days ago, Ms Pahwa said she is healing well \"after all the toxicity and narcissistic abuse\" and was trying to \"be better and to be indifferent\" every day. Without naming anyone, she said higher powers would decide what was best for her \"abusers\". \"Well feminism suits me, as idealistic values are my core & feminism means giving & getting mere respect. To one another. No slave treatment, and no stopping some girl to speak her mind (sic). Even a house help, guard, rikshawala, a tiny kid deserves respectful treatment. Once a coward fought with me that 'respect has to be earned'. Ufff! What disgrace na? I disagree, respect has to be given to each and everyone. If not then you lost the respect baby. Phew! Maybe that's why in India, we address people with ' aap' , 'bhaiya' , 'didi' to even strangers, isn't it?\" she wrote. Referring to her abusers as insecure cowards, Ms Pahwa said virtues like kindness and love are more important than money. \"I just wish these abusers get to see the mirror someday and understand..that kindness, love, understanding, trust,wisdom, affection & care all are true virtues & hold much more importance than money,property & gold. God bless the unkind ones. :) I know nobody can change, but let's just pray, nobody else should suffer because of some bunch of insecure cowards. My tribe, pray with me..okay? :) love you all... I am free, and the beautiful ruins are part of me,\" she wrote. 'Stressed Him Out' On Wednesday, Khurana's sister told news agency ANI that Ms Pahwa had instigated him . \"Manika Pahwa, her parents and her sister forced my brother, stressed him out, instigated him by saying, 'you can't do anything, die by suicide if you dare'. Puneet shot a video before his death, it is on his phone, he has said everything, about how Manika and his parents pressured him mentally. They threatened to throw our parents out and dared him to open his shop's shutter. They kept abusing him,\" she said. She claimed the division of the business had been laid out clearly, but Ms Pahwa kept asking for her share from the other part too. \"They earlier ran the bakery business in partnership. But when the first motion for divorce was signed, it was decided and put in writing that Puneet would manage For God's bakery and Manika would get Woodbox Cafe. It was signed. Even after that, she kept saying that she won't leave her share. When the matter has been decided in court, go and raise the issue there. She kept calling him and demanding her share,\" the sister said. Khurana's mother also claimed Ms Pahwa kept torturing her son and he suffered in silence. \"The two shared the business, they would have disputes over it. He would not say anything openly to us, thinking we would be upset. He kept swallowing his grief. My son was doing well, but she tortured him so much yesterday that he took this step,\" she said. The couple got married in 2016 and had been separated for two years. Khurana's family has filed a police complaint and sought action against Ms Pahwa and her family. Helplines Vandrevala Foundation for Mental Health 9999666555 or help@vandrevalafoundation.com TISS iCall 022-25521111 (Monday-Saturday: 8 am to 10 pm) (If you need support or know someone who does, please reach out to your nearest mental health specialist.) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Delhi Cafe Owner Suicide , Puneet Khurana , Woodbox Cafe",
    "link": "https://www.ndtv.com/india-news/puneet-khurana-manika-pahwa-woodbox-cafe-toxicity-abuse-post-by-delhi-cafe-owners-wife-days-before-his-suicide-7378866",
    "published_date": "2025-01-01T22:25:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/f2ctdq2o_puneet-khurana_625x300_01_January_25.jpg"
  },
  {
    "title": "School Bus Flips Over In Kerala, Class 5 Student Crushed Under Wheels",
    "author": "",
    "description": "A Class 5 student was killed after a school bus she was travelling in flipped over in Kerala's Kannur on Wednesday.",
    "text": "School Bus Flips Over In Kerala, Class 5 Student Falls, Crushed Under Wheels Sources alleged a brake failure caused the accident but the police said a detailed probe is underway. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email The incident took place at around 4pm in Valakkai in Sreekantapuram. A Class 5 student was killed after a school bus she was travelling in flipped over in Kerala's Kannur on Wednesday. The incident took place at around 4pm in Valakkai in Sreekantapuram, when the bus belonging to Chinmaya Vidyalaya in Kurumathur panchayat, with 15 students onboard, was travelling down a slope while entering a highway. The students were getting dropped home after school. According to the police, 11-year-old Nedya S Rajesh was thrown out of the bus and crushed under the wheels after the driver lost control. Sources said an alleged brake failure caused the accident but the police said a detailed probe is underway. Thirteen students, who sustained injuries, were rushed to Taliparamba Taluk Hospital by local residents for treatment. The girl's body was shifted to Government Medical College at Pariyaram. There was no immediate comment from the school authorities. Police said a case under sections 281 (rash driving or riding on a public way), 125 (A) (endanger human life or personal safety due to negligence or recklessness), and 106 (1) (causing death by negligence) of the Bharatiya Nyaya Sanhita has been registered against the driver. Meanwhile, the residents blamed the \"unscientific design\" of the road for the accident and alleged such incidents occur frequently in the area. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Kerala , Kannur , Chinmaya Vidyalaya",
    "link": "https://www.ndtv.com/india-news/school-bus-flips-over-in-kerala-kannur-class-5-student-falls-crushed-under-wheels-7379067",
    "published_date": "2025-01-01T21:51:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/5f2od12_kerala-kannur-school-bus-accident_625x300_01_January_25.jpg"
  },
  {
    "title": "\"Criminals Coming In...\": Trump After 10 Killed In New Orleans Attack",
    "author": "",
    "description": "US President-elect Donald Trump linked Wednesday's deadly truck attack on a crowd of revelers in New Orleans to illegal immigration -- the issue at the heart of his election victory.",
    "text": "\"Criminals Coming In...\": Donald Trump After 10 Killed In New Orleans Attack US President-elect Donald Trump linked Wednesday's deadly truck attack on a crowd of revelers in New Orleans to illegal immigration -- the issue at the heart of his election victory. Read Time: 1 min Share Twitter WhatsApp Facebook Reddit Email At least 10 people were killed in the attack. Washington: US President-elect Donald Trump linked Wednesday's deadly truck attack on a crowd of revelers in New Orleans to illegal immigration -- the issue at the heart of his election victory. \"When I said that the criminals coming in are far worse than the criminals we have in the country... it turned out to be true,\" Trump posted on social media. Police have not indicated the nationality or identity of the attacker. Trump also claimed that the nation's crime rate \"is at a level that nobody has ever seen.\" In fact, violent crime is sharply down across the country, according to the FBI. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: New Orleans , Donald Trump , New Orleans Attack",
    "link": "https://www.ndtv.com/world-news/criminals-coming-in-donald-trump-after-10-killed-in-new-orleans-attack-7379114",
    "published_date": "2025-01-01T21:58:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/u4ar7qqo_new-orleans-attack_625x300_01_January_25.jpeg"
  },
  {
    "title": "Stuck In Rajasthan Borewell For 10 Days, 3-Year-Old Dies Hours After Rescue",
    "author": "",
    "description": "A three-year-old child who fell into a borewell in Rajasthan's Kotputli 10 days ago, has finally been rescued after more than five failed attempts.",
    "text": "Stuck In Rajasthan Borewell For 10 Days, 3-Year-Old Dies Hours After Rescue Chetna was immediately shifted to a nearby hospital for medical attention. Hospital authorities said while she is currently stable, her condition will continue to be monitored. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email New Delhi: A three-year-old child who fell into a borewell in Rajasthan's Kotputli 10 days ago, died shortly after she was rescued. Chetna, who was rescued after five failed attempts, was immediately shifted to a nearby hospital for medical attention. Hospital authorities said during examination, they found her dead. . The hospital's medical officer Dr Chetanya Rawat said: \"She was brought in and immediately moved to the emergency room, where a special bed was set up for examination. After the doctors performed a procedure, they confirmed the child was no longer alive. The body was then transferred to the morgue. The postmortem  examination has been completed as per the collector's orders.\" Chetna was stuck in a 700-feet borewell in Badiyali ki Dhani of Kiratpura village of Kotputli. She had fallen in on the afternoon of December 23, while playing. About 10 minutes later, the family heard the girl crying and found her stuck in the borewell. The national and state Disaster Relief Forces reached immediately with a medical team and efforts have been on since to rescue her. Oxygen was supplied to the girl through a pipe  and after initial efforts to pull her up failed, the rescue teams started digging. But the tunnel they dug turned out to be in the wrong direction. Over the last few hours, neither food not oxygen could be provided to her and her condition became critical. The rescue came in the nick of time. Collector Kalpana Agarwal explained that the borewell was tilted after a certain depth, which led to mistakes. Finally, experts from Delhi and Jaipur Metro were called in to assist the rescue teams. Initially, the tunnel was estimated to require an 8-foot width but was later expanded to 12 feet to facilitate the operation. Dayaram, Chetna's grandfather, praised the relentless efforts of the administration and rescue teams, who worked tirelessly in the harsh winter. He urged authorities to cover open borewells to prevent similar tragedies in the future. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Rajasthan",
    "link": "https://www.ndtv.com/india-news/girl-3-rescued-10-days-after-falling-into-700-foot-borewell-in-rajasthan-7378062",
    "published_date": "2025-01-01T20:55:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/fj8gu0q8_borewell-rescue-_625x300_01_January_25.jpg"
  },
  {
    "title": "ISRO's US Satellite Launch May Make Phone Calls Directly Via Space A Reality",
    "author": "",
    "description": "India is all set to launch a massive American communications satellite that would allow making phone calls using direct connectivity from space. This is a highly innovative and a more modern approach to satellite telephony than the existing services.",
    "text": "US Satellite Launch By ISRO May Make Phone Calls Directly Via Space A Reality This is also the first time an American company is launching a massive communications satellite from India in a dedicated launch on an Indian rocket. Till date, India has only launched small satellites made by American entities. Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email Massive AST SpaceMobile satellites deployed in low Earth orbit an artist's impression. New Delhi: India is all set to launch a massive American communications satellite that would allow making phone calls using direct connectivity from space. This is a highly innovative and a more modern approach to satellite telephony than the existing services. This is also the first time an American company is launching a massive communications satellite from India in a dedicated launch on an Indian rocket. Till date, India has only launched small satellites made by American entities. India's Science Minister Dr Jitendra Singh disclosed that \"In February or March we will be launching a US satellite for mobile communication, this satellite will enable voice communication on mobile phones. It will be an interesting mission\". While neither the minister nor Indian space agency ISRO confirmed who the American satellite operator is, experts confirm that it is AST SpaceMobile, a Texas-based company is hoping to launch its big communication satellite from Sriharikota. The US company has asserted that one can use any smartphone to make voice calls using their services. Most other current satellite-based Internet and voice providers ask subscribers to buy special handsets or have special terminals like Starlink does. American media had reported that Abel Avellan, the CEO of AST SpaceMobile, had confirmed in an investor call last year by announcing that they will use the Geo-synchronous Satellite Launch Vehicle (GSLV) to launch a single Block 2 of the Bluebird satellite. NDTV has reached out to AST SpaceMobile for a statement. No response came in till the time the story was filed. Each Bluebird satellite will have an antenna of the size of 64 square meters or about half the size of a football field. The satellite will weigh nearly 6000 kilograms and India's rocket will put it in a low Earth orbit. In an earlier statement, Abel Avellan said they \"invented a technology that connects satellites directly to ordinary cell phones and provides broadband internet through the largest ever commercial phase array in low Earth orbit\". AST SpaceMobile's mission, he added, is to close the global connectivity gap and digitally transform nations by bringing \"affordable 5G broadband service from space to billions of people worldwide, direct to everyday smartphones\". An ISRO expert said this satellite will enable \"direct to mobile communication\" and the company is hoping to place some massive satellites in the Earth's orbit to power this path-breaking technology. ISRO experts confirmed that AST SpaceMobile has hired the services of India's Bahuballi rocket or the Launch Vehicle Mark-3 for launching the Bluebird satellite. It is a huge boost for ISRO since now even American companies are having faith in India's LVM-3 which has a one hundred percent success record. Before this there have been two dedicated commercial launches of LVM-3 to hoist satellites for the OneWeb constellation, where Bharti Enterprises have a big stake, the same group also owns Indian telecom service Airtel. This new satellite-based direct to mobile connectivity will be in direct competition to the existing providers like Starlink and Oneweb, both of which use massive constellations (satellite network) to provide broadband Internet connectivity. In contrast, an ISRO expert said since AST SpaceMobile wants to deploy massive satellites they could make do with a slightly smaller constellation. AST SpaceMobile asserts its technology is \"designed to connect directly to mobile phones by becoming a pioneer as we create the first and only space-based cellular broadband network\". The American company further added: \"Our goal is to make cellular broadband available almost anywhere so you can connect with the rest of the world - regardless of where you live or work. We want to help people stay connected where traditional networks can't, including when existing telecom infrastructure fails. We hope to welcome new populations into the global digital economy, opening up opportunities for work, education, social networking, healthcare, and more. AST SpaceMobile's planned solution may not require switching cellular service providers. We're working with mobile network operators around the world to provide optional connectivity to our satellites when needed.\" ISRO experts confirm that it is a purely commercial launch being spearheaded by New Space India Limited (NSIL), the commercial arm of the Department of Space. India is just providing a ride to the American satellite and nothing more. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: ISro",
    "link": "https://www.ndtv.com/india-news/us-satellite-launch-by-isro-may-make-phone-calls-directly-via-space-a-reality-7378668",
    "published_date": "2025-01-01T21:11:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/5qdhts88_isros-us-satellite-launch_625x300_01_January_25.jpg"
  },
  {
    "title": "\"Saved Their Honour\": UP Man Kills Mother, 4 Sisters. Records Video",
    "author": "",
    "description": "The 24-year-old man accused of murdering his mother and four sisters at a hotel in Lucknow has said in a chilling video that he committed the killings because he did not want his \"sisters to be sold\".",
    "text": "\"Saved Their Honour\": UP Man Kills Mother, 4 Sisters. Records Video The victims have been identified as Arshad's mother Asma and sisters Alia (9), Alshia (19), Aksa (16) and Rahmeen (18) Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email Arshad recorded a video right after killing his mother and sisters Lucknow: The 24-year-old man accused of murdering his mother and four sisters at a hotel in Lucknow has said in a chilling video that he committed the killings because he did not want his \"sisters to be sold\". In the video, which emerged hours after the shocking crime, Arshad alleges that neighbours and land mafia in their hometown Budaun captured their house and planned to traffick his sisters. In the video, Arshad said he killed his mother and three sisters and the fourth was about to die. He also showed the bodies and said he choked them and slit their wrists and that his father helped him. The victims have been identified as his mother Asma and sisters Alia (9), Alshia (19), Aksa (16) and Rahmeen (18). \"Our family has taken this step due to harassment by people in the neighbourhood. I have killed my mother and sisters. When police get this video, they must know that the locals are responsible. They harassed us to capture our house. We raised our voice, but no one heard. It has been 15 days that we have been sleeping on the footpath, wandering in the cold. We don't want the children to wander in the cold. They have captured our house. The documents are with us,\" says Arshad, who was arrested at the crime scene. In the video, the young man said the family wanted to convert and appealed to Uttar Pradesh Chief Minister Yogi Adityanath for justice. He also named several people allegedly responsible for the deaths: Ranu, Aftab, Aleem Khan, Salim, Arif, Ahmad and Azhar. \"They are land mafia, they also sell girls. They planned to frame the two of us (him and his father) in a false case and sell our sisters. We did not want that. So I was forced to kill my sisters by choking them and slitting their wrists.\" Arshad then showed the bodies of his mother and sisters. \"I may not be alive till the morning,\" he said, suggesting that he had planned to die by suicide too. \"We are from Budaun, my aunt has proof (of residence) going back to 1947. They spread lies about us that we are Bangladeshis.\" Arshad said in the video that the family wanted to convert to live in peace. \"We approached many people for help, but they did not help us. Now my sisters are dying and I will die in a short while. But no family in India should be forced to do this,\" he said, requesting Prime Minister Narendra Modi and Yogi Adityanath for justice. \"I request with folded hands, we did not get justice in life, at least give us justice in death. They should get the strictest punishment. They are connected with leaders and police. They captured half of our plot and wanted to capture the other half.\" Arshad also said that a temple should come up on their land and their belongings must be donated to an orphanage so that our souls find joy. \"I killed them with my father. What choice did I have? See them being sold in Hyderabad?\" \"Ensure they get justice. They struggled a lot today. We have saved their honour,\" he said, addressing the Chief Minister. NDTV cannot verify the authenticity of the video. Earlier, Deputy Commissioner of Police, Central Lucknow, Raveena Tyagi said the murders were committed at Hotel Sharanjit. \"The accused, identified as Arshad (24), allegedly killed five members of his own family. Following the gruesome act, the local police promptly caught the accused from the crime scene,\" she said. Forensic teams have collected samples from the crime scene. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Lucknow Five Murders , Lucknow Hotel Murder Case , Lucknow Murder Case",
    "link": "https://www.ndtv.com/india-news/lucknow-five-murders-didnt-want-them-to-be-sold-up-mans-video-after-killing-mother-sisters-7376110",
    "published_date": "2025-01-01T14:18:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/lq69s9j_lucknow-murder-_625x300_01_January_25.jpg"
  },
  {
    "title": "PM Modi's New Global Initiative Gets Big Praise From SRK, Akshay Kumar",
    "author": "",
    "description": "Prime Minister Narendra Modi's latest global initiative has earned big praise from Bollywood superstars Shah Rukh Khan and Akshay Kumar.",
    "text": "PM Modi's New Global Initiative Gets Big Praise From Shah Rukh Khan, Akshay Kumar Create in India Summit: The 5-day World Audio Visual Entertainment Summit will be held at the Bharat Mandapam in New Delhi from February 5-9, 2025. Read Time: 3 mins Share Twitter WhatsApp Facebook Reddit Email Shah Rukh Khan and Akshay Kumar praised PM Modi's latest initiative for a global entertainment summit New Delhi: Prime Minister Narendra Modi's latest initiative - under 'Create in India' - to take Indian cinema and content global at a faster pace and greater scale - has earned praise from industry stalwarts Shah Rukh Khan and Akshay Kumar. In 2024's last 'Mann Ki Baat' radio address to the nation on December 29, PM Modi announced that India will host the World Audio Visual Entertainment Summit or WAVES for the first time in February. Speaking about it in detail, the prime minister said the initiative will be a global platform for Indian creative talents, fostering collaborations and showcasing the country's potential as a hub for world-class content creation. Talking about the vision for the global entertainment summit, PM Modi explained that it will comparable to global events like the World Economic Forum in Davos, Switzerland. \"Leaders from the media and entertainment industry worldwide will gather for the summit,\" he said, adding that content creators, social media influencers, and creative minds from across the globe will be part of the global event too. \"This Summit is an important step towards making India a hub of global content creation,\" the prime minister said in his radio address. The summit will also showcase India's advancements in the fields of animation, gaming, entertainment technology, and regional as well as mainstream cinema. \"Whether you are a young creator or an established artist, associated with Bollywood or regional cinema, a professional from the TV industry, an expert in animation, gaming, or an innovator in entertainment technology, I encourage you to be a part of the WAVES Summit,\" PM Modi said, opening up the registration for the summit. This initiative by the prime minister has earned big praise from several industry leaders, including global superstars like Shah Rukh Khan and Akshay Kumar. Sharing a video of the event posted on X by PM Modi, Shah Rukh Khan called it \"an occasion that champions and fosters creativity.\" The actor-producer also said that he looks forward to being a part of it. \"It is with great anticipation that I look forward to WAVES - a film and entertainment world summit - to be held in our country itself.\" Mr Khan also wrote that it will be \"an occasion that celebrates our industry and acknowledges the role it plays in the Indian economy as well as its strength as a soft power.\" It is with great anticipation that I look forward to WAVES - a film and entertainment world summit - to be held in our country itself. An occasion that celebrates our industry and acknowledges the role it plays in the Indian economy as well as its strength as a soft power… and… https://t.co/QE52Rs11NZ — Shah Rukh Khan (@iamsrk) December 30, 2024 Akshay Kumar also lauded the prime minister for his vision for such a global summit, saying \"Now this is Narendra Modi-ji's vision towards promoting the media and entertainment sector. Quite a wonderful idea. Waves 2025 summit will hopefully be a fabulous global forum to have the entire entertainment industry come and grow together.\" Now this is PM @narendramodi ji's vision towards promoting the Media & Entertainment sector. Quite a wonderful idea. Waves 2025 summit will hopefully be a fabulous global forum to have the entire entertainment industry come and grow together. https://t.co/IBtadmxjpZ — Akshay Kumar (@akshaykumar) December 29, 2024 Several other celebrities including Anil Kapoor, Sanjay Dutt, Ritesh Sidhwani, and Ektaa Kapoor also welcomed the initiative. The 5-day World Audio Visual Entertainment Summit will be held at the Bharat Mandapam in New Delhi from February 5-9, 2025. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Narendra Modi , Shah Rukh Khan , Akshay Kumar",
    "link": "https://www.ndtv.com/world-news/pm-narendra-modis-new-global-initiative-gets-big-praise-from-shah-rukh-khan-akshay-kumar-7378021",
    "published_date": "2025-01-01T19:47:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/272urum4_pm-modi-shah-rukh-khan-pm-modi-srk_625x300_01_January_25.jpg"
  },
  {
    "title": "Girls Throw Punches And Kicks, Drag Each Other By The Hair \"Over Boy\" In UP",
    "author": "",
    "description": "Two teenage girls punched and kicked each other on a busy road reportedly after finding out that they both liked the same boy who studies in their school in Uttar Pradesh's Baghpat.",
    "text": "Girls Throw Punches And Kicks, Drag Each Other By The Hair \"Over Boy\" In UP The videos showed the teens - dressed in school uniform - punching, kicking and dragging each other by their hair even as other students and passersby attempt to pull them apart. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email Screengrab of the viral video. Two teenage girls punched and kicked each other on a busy road reportedly after finding out that they both liked the same boy who studies in their school in Uttar Pradesh's Baghpat. Videos of the incident, which took place in Aminagar Sarai Town under the Singhwali Police Station area on Tuesday, have now gone viral. Police said a detailed probe is underway. The videos showed the teens - dressed in school uniform - punching, kicking and dragging each other by their hair even as other students and passersby attempt to pull them apart. Sources said the girls - both Class 10 students of a local school - reportedly liked a boy, who studied in the same school. Both girls would talk to the boy often and got into a fight outside the school when they learnt that they both like him \"The video is being probed and the matter will be investigated accordingly,\" said an official. (With inputs from Vipin Solanki) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Uttar Pradesh , Baghpat",
    "link": "https://www.ndtv.com/india-news/girls-throw-punches-and-kicks-drag-each-other-by-the-hair-over-boy-in-uttar-pradesh-7378389",
    "published_date": "2025-01-01T19:51:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/n3p2gab8_up-brawl_625x300_01_January_25.jpg"
  },
  {
    "title": "Ayodhya, Varanasi Temples See Unprecedented Rush On New Year's Day",
    "author": "",
    "description": "The temple towns of Ayodhya and Varanasi in Uttar Pradesh on Wednesday witnessed an unprecedented rush of devotees on the first day of the New Year.",
    "text": "Ayodhya, Varanasi Temples See Unprecedented Rush On New Year's Day According to local administration estimates, over two lakh devotees had already set up camps in Ayodhya on New Year Eve. On Wednesday morning, approximately three lakh more people arrived to pay homage to the deity of Ram Lalla. Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email The Ram temple at Ayodhya was consecrated on January 22 last year. Ayodhya: The temple towns of Ayodhya and Varanasi in Uttar Pradesh on Wednesday witnessed an unprecedented rush of devotees on the first day of the New Year. The Ram temple at Ayodhya was consecrated on January 22 last year. According to local administration estimates, over two lakh devotees had already set up camps in Ayodhya on New Year Eve. On Wednesday morning, approximately three lakh more people arrived to pay homage to the deity of Ram Lalla. The eagerness of devotees was palpable as they lined up for 'darshan' of the idol which was unveiled at sunrise on the first day of the year. In Varanasi, a massive crowd of devotees thronged the sacred premises of Baba Shri Kashi Vishwanath temple from 3 am on Wednesday. The rush continued till late evening as part of New Year celebrations. The temple administration reported that by 4 pm, a whopping 3.5 lakh devotees had visited the temple to offer prayers and seek the blessings of Baba Shri Kashi Vishwanath. In a statement, Ram Temple Trust general secretary Champat Rai said the entire world is celebrating the New Year according to the Gregorian calendar. The winter season coupled with a holiday break contributed to the high number of visitors, he explained. With schools, courts and agricultural work closed for the season, he said \"people often take vacations during this time\". \"Increasingly, Ayodhya has become a prime destination for pilgrims instead of more traditional tourist spots like Goa, Nainital, Shimla or Mussoorie,\" Rai said. The Ayodhya administration divided the city into multiple sectors and zones to regulate the large crowds. Heavy police presence was deployed to manage the surging crowds. Traffic restrictions were imposed and round-the-clock vehicle inspections were conducted, local officials said. The increase in the number of devotees had begun a day earlier. By Tuesday evening, more than two lakh pilgrims had already completed 'darshan'. Hotels, dharamshalas and homestays were fully booked as both local and outstation visitors poured into the town. Similar scenes unfolded at the Hanumangarhi temple, where the crowds remained steady from the early morning 'aarti' until the 'shayan aarti' in the evening. To accommodate the massive influx, the administration had prepared 10 additional visitor galleries along the Ram Janmabhoomi path, expanding the number of darshan lines from 10 to 20. Special security measures were also enforced to ensure the safety of the devotees. Ayodhya Deputy Superintendent of Police Ashutosh Tiwari added that the city has been divided into seven security sectors and 24 zones, with senior officers deployed in each area. Drone cameras are used to monitor crowded locations and traffic movement was strictly controlled to avoid congestion and ensure public safety. In Varanasi, the Chief Executive Officer of Kashi Vishwanath Temple, Vishwa Bhushan Mishra, said the number of visitors has been rising steadily since December 28. On the occasion of New Year, temple authorities had anticipated the high influx and took steps to manage the situation efficiently. \"The crowd started gathering early in the morning and by 4 pm, we had already witnessed 3.5 lakh devotees. The numbers continue to rise and devotees are still queuing to seek darshan,\" said Mishra. In response to the overwhelming crowd, temple officials had imposed certain restrictions. To manage the large number of visitors, Baba's \"touch darshan\" was prohibited on both December 31 and January 1. Additionally, entry into the sanctum sanctorum was restricted and vehicles were banned from entering Maidagin to Godaulia road to ensure smooth movement of pilgrims. To ensure public safety and prevent any untoward incidents, the district police have been on high alert. DCP Kashi Zone, Gaurav Bansal, stated that extensive security measures were in place with five sectors created and 45 duty points established within the Kashi Vishwanath temple complex. Security personnel have also been deployed at key temples and ghats across the city, including the Baba Kaal Bhairav temple and Sankat Mochan temple, where 11 and 8 duty points respectively were set up. Special forces, including the National Disaster Response Force (NDRF), Water Police and Provincial Armed Constabulary (PAC) have been stationed at various ghats, anticipating a large crowd for the New Year celebrations. In case of emergencies, 12 quick reaction teams (QRTs) are on standby. The security arrangements and crowd control measures reflect the temple's efforts to ensure a safe and peaceful experience for the devotees visiting the Kashi Vishwanath temple on this special occasion, Bansal said. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Ram Temple , Ram Temple Aarti , Ram Temple Rush",
    "link": "https://www.ndtv.com/india-news/unprecedented-rush-of-devotees-at-ayodhya-varanasi-on-new-year-day-7378440",
    "published_date": "2025-01-01T20:00:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/tk6i3n7g_ram-mandir_625x300_01_January_25.jpeg"
  },
  {
    "title": "'Rohit, You Shattered India's Confidence': Star Comes Under Brutal Attack",
    "author": "",
    "description": "From Rohit Sharma to Gautam Gambhir, former Pakistan cricketer Basit Ali spared no one in his scathing attack on Team India following their loss against Australia.",
    "text": "Story Progress Back to home 'Rohit Sharma, You Shattered India's Confidence': Captain Comes Under Scathing Attack After MCG Humiliation From Rohit Sharma to Gautam Gambhir, former Pakistan cricketer Basit Ali spared no one in his scathing attack on Team India following their loss against Australia. facebook twitter WhatsApp reddit E-mail File image of Rohit Sharma. © AFP Former Pakistan cricketer Basit Ali has ripped into India captain Rohit Sharma for their defeat to Australia in the fourth Test of the Border-Gavaskar Trophy 2024/25 in Melbourne. Rohit Sharma was slammed by Ali for not only ruining the confidence of KL Rahul by demoting him and promoting himself, but also criticised for his mentality. Basit Ali also reserved criticism for Gautam Gambhir , criticising some of the decisions taken during the game, and also suggested a captaincy change for Team India. \"One decision: 'I will open', that affected India. Rohit Sharma not only came back to open despite being out of form, he also put the in-form KL Rahul under pressure. You (Rohit) completely shattered the confidence of the team,\" said Ali in a scathing attack on his YouTube channel . \"Rohit Sharma and Virat Kohli got out playing extremely poor shots,\" Ali added. Rohit 9 and Kohli just 5 during the run chase. India slumped to defeat on Day 5 of the fourth Test. Needing 340 to win on the final day, Rohit Sharma started off on an extremely defensive note, setting the tone for a draw. \"On top of everything, right from the start, you (Rohit) came in defensive, thinking 'Draw, Draw, Draw'. Did you play like you deserve a draw? No,\" said Basit Ali. Ali also did not spare Gautam Gambhir and the team management. In particular, he questioned the decision to not keep a left-hand-right-hand combination in the middle after Rishabh Pant got out. \"I must congratulate Gautam Gambhir too. You (Gambhir) used left-hand-right-hand combinations to your heart's content during the ODI series (against Sri Lanka), the series against New Zealand. Here is when you should've sent Nitish Reddy at No. 6. At least we would've known you've done something to save the game,\" said Basit. Listen to the latest songs , only on JioSaavn.com Finally, Ali also suggested a change of captain. \"I think the time has come for Rohit to step down; (Jasprit) Bumrah should be made captain for the last Test. You (Rohit) have served India a lot, but your body is not supporting you now,\" Ali concluded. Comments Topics mentioned in this article India Cricket Team Australia vs India 2024/25 Cricket Virat Kohli Basit Ali Rohit Sharma Jasprit Bumrah Rishabh Pant Gautam Gambhir Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/australia-vs-india-2024-25/rohit-sharma-you-shattered-indias-confidence-captain-comes-under-scathing-attack-after-mcg-humiliation-7370892",
    "published_date": "2025-01-01T21:49:00+05:30",
    "image_link": "https://c.ndtvimg.com/2024-12/9qrb60k8_rohit-sharma_625x300_31_December_24.jpg"
  },
  {
    "title": "Scientists Demonstrate 'Negative Time' In Groundbreaking Quantum Experiment",
    "author": "",
    "description": "Researchers recently posted findings on the preprint server arXiv, drawing global interest and some reservations about what it all means.",
    "text": "Scientists Demonstrate 'Negative Time' In Groundbreaking Quantum Experiment Researchers recently posted findings on the preprint server arXiv, drawing global interest and some reservations about what it all means. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email The results are expected to prompt further investigation into the mysteries of time. Researchers at the University of Toronto have made a groundbreaking discovery, showing that \"negative time\" is not just a theoretical concept but a tangible phenomenon. Scientists at the institution showed through an innovative quantum experiment that light appears to emerge from a material before entering, overturning several decades of prevailing ideas about the nature of time. While much of the attention surrounding the results is international in scope, scientific communities have largely raised an eyebrow over the matter. The results, yet to be published in a peer-reviewed journal, are expected to spur further investigation into the mysteries of time and quantum mechanics. \"It took a positive amount of time, but our experiment observing that photons can make atoms seem to spend a negative amount of time in the excited state is up!\" wrote Aephraim Steinberg, a physicist at the University of Toronto, in a post on X (formerly Twitter) about the new study. Woo-hoo! It took a positive amount of time, but our experiment observing that photons can make atoms seem to spend a *negative* amount of time in the excited state is up! It sounds crazy, I know, but check it out! Kudos to Daniela +the rest of the team! https://t.co/rHrAUJq5rX pic.twitter.com/Lz7Lazb1Gs — Aephraim Steinberg (@QuantumAephraim) September 6, 2024 While the term \"negative time\" might sound like a concept lifted from science fiction, Steinberg defends its use, hoping it will spark deeper discussions about the mysteries of quantum physics. According to a report by Scientific American, the idea for this work emerged in 2017. At the time, Steinberg and a lab colleague, then doctoral student Josiah Sinclair, were interested in the interaction of light and matter, specifically a phenomenon called atomic excitation: when photons pass through a medium and get absorbed, electrons swirling around atoms in that medium jump to higher energy levels. When these excited electrons lapse to their original state, they release that absorbed energy as reemitted photons, introducing a time delay in the light's observed transit time through the medium. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Negative Time , Quantum Experiments , University Of Toronto , Light , Wave Distortion , Scientific Discovery , Peer-reviewed",
    "link": "https://www.ndtv.com/science/scientists-demonstrate-negative-time-in-groundbreaking-quantum-experiment-7378909",
    "published_date": "2025-01-01T21:18:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/aoq8mpf_negative-time_625x300_01_January_25.jpeg"
  },
  {
    "title": "\"I've Had Enough\": Gambhir Lashes Out At India Stars, Issues Stern Warning",
    "author": "",
    "description": "India head coach Gautam Gambhir is said to have lost his cool in the dressing room after the team's defeat defeat against Australia in Melbourne.",
    "text": "Story Progress Back to home \"I've Had Enough\": Furious Gautam Gambhir Lashes Out At India Stars, Issues Stern Warning India head coach Gautam Gambhir is said to have lost his cool in the dressing room after the team's defeat defeat against Australia in Melbourne. facebook twitter WhatsApp reddit E-mail Gautam Gambhir and Virat Kohli in a conversation © AFP Not all is well in the Indian team's dressing room at the moment. With Australia leading 2-1 in the Border-Gavaskar Trophy, with just one Test in Sydney to go, there's an understandable discontent in the Indian team. Pressure has been increasing on India head coach Gautam Gambhir , under whom, the team produced some astonishing results against Sri Lanka (in ODIs), and New Zealand (in Tests at home) and is now on the brink of losing the Test assignment in Australia and with it, a chance to qualify for the World Test Championship final. Gambhir is said to have lost his cool at a few top Indian stars who 'went their own way' in the 4th Test against Australia in Melbourne and ended up throwing their wicket away. As a result, India lost the match and the team now stands on the brink of elimination from the WTC final race. \"Bahut ho gaya (I've had enough),\" Gambhir told the Indian team soon after the players' return to the dressing room after a loss in Melbourne, as per Indian Express . The India head coach is reportedly annoyed with the way certain players conducted themselves on the ground. Gambhir is said to have told the players that he gave them 6 months to play 'their way' but it all stops now. From now onwards those who don't play according to the plans set by him for the team, will be shown the exit door. There's a big conflict in the team at the moment, between what Gambhir decides as the 'strategy' for a given situation or match, and what the players go on to do on the pitch. Listen to the latest songs , only on JioSaavn.com In the Melbourne Test, Rishabh Pant 's reckless shot, leading to his dismissal, was cited as the turning point in the game. Even Virat Kohli edged the ball into the hands of a fielder in slips while chasing an 8th stump delivery, yet again in this series. Skipper Rohit Sharma , after a cautious start to the second innings, gave in to his instincts again and failed to convert his start into a big score. Such acts by Indian players have reportedly gotten on Gambhir's nerves and the head coach is now ready to take serious actions. Advertisement Comments Topics mentioned in this article India Cricket Team Australia Cricket Team Gautam Gambhir Virat Kohli Rishabh Pant Australia vs India 2024/25 Cricket Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/australia-vs-india-2024-25/ive-had-enough-furious-gautam-gambhir-lashes-out-at-india-stars-issues-stern-warning-7374922",
    "published_date": "2025-01-01T09:46:00+05:30",
    "image_link": "https://c.ndtvimg.com/2025-01/ugg4tfko_virat-kohli-and-gautam-gambhir-afp_625x300_01_January_25.jpg"
  },
  {
    "title": "India Star Keen To be 'Interim Captain' In Tests, Calls Himself 'Mr. Fix-It'",
    "author": "",
    "description": "A 'Mr. Fix-It' has reportedly expressed interest to become Team India's 'interim captain' in Test format.",
    "text": "Story Progress Back to home Team India Star Keen To Be 'Interim Captain' In Tests, Calls Himself 'Mr. Fix-It': Report A 'Mr. Fix-It' has reportedly expressed interest to become Team India's 'interim captain' in Test format. facebook twitter WhatsApp reddit E-mail Team India eyeing full-time Test captain amid questions on Rohit Sharma's future © AFP The hunt for Rohit Sharma 's successor as Test captain seems to be in full swing despite the fact that he hasn't yet cleared the intent around the future. Though it was pace bowling icon Jasprit Bumrah who led the team in Rohit's absence in Perth, it has been reported that multiple players in the Indian dressing room were keen on the leadership role. It looks highly likely that Rohit's Test career will come to its inevitable end after the conclusion of the Australia tour if India don't qualify for the World Test Championship final. But, it seems like Bumrah isn't the only one in the race to fill the captain's spot in the longest format. As per a report in Indian Express , a certain player in the team proposed his name for 'interim captaincy'. The same player also branded himself as 'Mr. Fix-It' while putting forward a case to resolve the current mess that the team seems to be in. The player showing captaincy ambitions, however, isn't too impressed with certain young leadership candidates in the team. As per the report, he feels that certain youngsters, showing interest in leadership roles, still have some way to go. It isn't yet known who the said interim captaincy candidate is but it is known that the player is one of the seniors in the team. There, however, are only a handful of senior members in the team. With Rohit already the skipper, he only has the company of Virat Kohli , KL Rahul , Jasprit Bumrah, and Ravindra Jadeja among seniors. Listen to the latest songs , only on JioSaavn.com As far as long-term Test captaincy goes, Bumrah seems to be the obvious choice at present. The pace sensation led the team beautifully in Perth, earning the tourists their first and only win of the Border-Gavaskar Trophy so far. With Rohit expected to hang his boots in the longest format after the conclusion of the series, Bumrah is undoubtedly the No. 1 candidate to replace him. The vice-captaincy, however, might have two candidates in the form of KL Rahul and Rishabh Pant . Comments Topics mentioned in this article India Cricket Team Australia Cricket Team Virat Kohli Rohit Sharma Jasprit Bumrah KL Rahul Ravindra Jadeja Australia vs India 2024/25 Cricket Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/australia-vs-india-2024-25/team-india-star-keen-to-be-interim-captain-in-tests-calls-himself-mr-fix-it-report-7375521",
    "published_date": "2025-01-01T15:01:00+05:30",
    "image_link": "https://c.ndtvimg.com/2024-12/h9ioji5g_rohit-kohli-pant-afp_625x300_31_December_24.jpg"
  },
  {
    "title": "Forever In Our Memories",
    "author": "",
    "description": "Forever In Our Memories",
    "text": "Offbeat Share Facebook Twitter Whatsapp Reddit Jan 01, 2025 17:56 pm IST OnlyFans Model Lily Phillips Faces Airbnb Ban After Hosting 100 Men In London Apartment Jan 01, 2025 10:59 am IST Why A Japanese Maker Is Advising People Not To Wipe Toilet Seat With Toilet Paper Jan 01, 2025 10:26 am IST Grapes, Condoms, Coke And Chips: Here's What India Ordered On New Year's Eve Dec 31, 2024 20:32 pm IST New Year 2025: Are Banks Closed On January 1, 2025? Here's Where And Which Regional Offices Are Affected Dec 31, 2024 17:21 pm IST Man Cycles From Mongolia To Britain To Watch Manchester United Match: \"Fulfilled A Childhood Promise\" Dec 31, 2024 11:20 am IST Google Celebrates New Year's Eve With A Special Doodle Dec 31, 2024 10:26 am IST Happy New Year 2025: Wishes, Messages And Quotes To Share With Your Loved Ones Dec 31, 2024 09:04 am IST Baba Vanga And Nostradamus Both Made The Same Terrifying Prediction For 2025 Dec 31, 2024 06:49 am IST Happy New Year 2025: History, Significance And Why We Celebrate New Year's Day Dec 30, 2024 17:36 pm IST 2025 Chinese Zodiac: Signs Which May Be Lucky, And The Ones Not So Much Dec 30, 2024 16:56 pm IST Will Banks Remain Closed On January 1, 2025? What You Need To Know Dec 29, 2024 23:22 pm IST US Woman Spotted Carrying Basmati Rice Bag In A Salon, Internet Amused Dec 29, 2024 17:11 pm IST Welcome Generation Beta: Successor To Gen Alpha And Gen Z, Set To Arrive In 2025 Dec 29, 2024 10:29 am IST Missing Dog In US Returns Home On Christmas Eve, Shocks Family By Ringing Doorbell Dec 29, 2024 08:34 am IST Mumbai Entrepreneur's Heartwarming Encounter With Ola Driver Who Turned Out To Be An Olympian Dec 28, 2024 14:28 pm IST Bank Holidays In January 2025: Plan Your Financial Activities Around These Dates Dec 28, 2024 13:25 pm IST Video: Deadly Tiger Snake Discovered Under Child's Toy In Melbourne Home Dec 28, 2024 08:26 am IST UK Woman Fired For Wearing Sports Shoes At Work Wins Rs 30 Lakh In Compensation Dec 27, 2024 20:30 pm IST Watch: Championship Footballer Given Red Card For Performing Fortnite 'Take The L' Dance Dec 26, 2024 18:37 pm IST 'Love Spell' Ritual In Singapore Offers To Help People Win Back Their Exes, Sparks Debate More Offbeat",
    "link": "https://www.ndtv.com/offbeat",
    "published_date": "2025-01-01T22:32:00+05:30",
    "image_link": "https://c.ndtvimg.com/2024-12/aiqaik6_memory_240x180_24_December_24.jpg"
  },
  {
    "title": "Psychic Who Predicted Covid Warns Of WW3 And Global Catastrophes In 2025",
    "author": "",
    "description": "Nicolas Aujula, known for predicting Covid-19, foresees WW3 may occur in 2025 alongside significant challenges and royal developments.",
    "text": "Psychic Who Predicted Covid Warns Of WW3 And Global Catastrophes In 2025 - Here's What's Coming Nicolas Aujula, known for predicting Covid-19, foresees WW3 may occur in 2025 alongside significant challenges and royal developments. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email As the world steps into 2025, Aujula's claims add a layer of curiosity. Renowned psychic Nicolas Aujula, known for his highly publicized and often controversial predictions, has unveiled his vision for the upcoming year. Aujula, who claims to have accurately predicted major global events, such as the COVID-19 pandemic and the rise of the Black Lives Matter movement, paints a diverse picture of 2025. According to The Mirror, the 38-year-old hypnotherapist who specializes in past life regression, and who resides in south London, anticipates the resignation of the UK prime minister and significant advancements in medical technology, particularly in the field of lab-grown organs. He claims to have discovered his psychic abilities at age 17, experiencing visions of past lives as a seamstress in China and a nun in the Himalayas. The news outlet further reports that since then, he says he has accurately predicted events such as Covid-19 and the Black Lives Matter movement. For 2024 he foresaw Donald Trump winning the US election and a rise in artificial intelligence, both of which have come true-and he said when he is correct, he finds it very validating. While predicting remarkable advancements in artificial intelligence and significant social justice reforms, Aujula also issued grave warnings, including the potential outbreak of World War 3, a global challenge that could fundamentally alter the international landscape. However, not all is grim. Aujula predicts a long-awaited reconciliation between estranged royal siblings, Princes William and Harry. This reconciliation, if realized, could significantly improve the image of the British Royal Family, which has been plagued by rumors of discord. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Nicolas Aujula , Psychic Predictions , 2025 Forecast , World War 3 , Princes William And Harry , Royal Reconciliation",
    "link": "https://www.ndtv.com/feature/psychic-who-predicted-covid-warns-of-ww3-and-global-catastrophes-in-2025-heres-whats-coming-7379160",
    "published_date": "2025-01-01T22:06:32+05:30",
    "image_link": null
  },
  {
    "title": "\"Criminals Coming In...\": Trump After 10 Killed In New Orleans Attack",
    "author": "",
    "description": "US President-elect Donald Trump linked Wednesday's deadly truck attack on a crowd of revelers in New Orleans to illegal immigration -- the issue at the heart of his election victory.",
    "text": "\"Criminals Coming In...\": Donald Trump After 10 Killed In New Orleans Attack US President-elect Donald Trump linked Wednesday's deadly truck attack on a crowd of revelers in New Orleans to illegal immigration -- the issue at the heart of his election victory. Read Time: 1 min Share Twitter WhatsApp Facebook Reddit Email At least 10 people were killed in the attack. Washington: US President-elect Donald Trump linked Wednesday's deadly truck attack on a crowd of revelers in New Orleans to illegal immigration -- the issue at the heart of his election victory. \"When I said that the criminals coming in are far worse than the criminals we have in the country... it turned out to be true,\" Trump posted on social media. Police have not indicated the nationality or identity of the attacker. Trump also claimed that the nation's crime rate \"is at a level that nobody has ever seen.\" In fact, violent crime is sharply down across the country, according to the FBI. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: New Orleans , Donald Trump , New Orleans Attack",
    "link": "https://www.ndtv.com/world-news/criminals-coming-in-donald-trump-after-10-killed-in-new-orleans-attack-7379114",
    "published_date": "2025-01-01T21:58:36+05:30",
    "image_link": null
  },
  {
    "title": "'Rohit, You Shattered India's Confidence': Star Comes Under Brutal Attack",
    "author": "",
    "description": "From Rohit Sharma to Gautam Gambhir, former Pakistan cricketer Basit Ali spared no one in his scathing attack on Team India following their loss against Australia.",
    "text": "Story Progress Back to home 'Rohit Sharma, You Shattered India's Confidence': Captain Comes Under Scathing Attack After MCG Humiliation From Rohit Sharma to Gautam Gambhir, former Pakistan cricketer Basit Ali spared no one in his scathing attack on Team India following their loss against Australia. facebook twitter WhatsApp reddit E-mail File image of Rohit Sharma. © AFP Former Pakistan cricketer Basit Ali has ripped into India captain Rohit Sharma for their defeat to Australia in the fourth Test of the Border-Gavaskar Trophy 2024/25 in Melbourne. Rohit Sharma was slammed by Ali for not only ruining the confidence of KL Rahul by demoting him and promoting himself, but also criticised for his mentality. Basit Ali also reserved criticism for Gautam Gambhir , criticising some of the decisions taken during the game, and also suggested a captaincy change for Team India. \"One decision: 'I will open', that affected India. Rohit Sharma not only came back to open despite being out of form, he also put the in-form KL Rahul under pressure. You (Rohit) completely shattered the confidence of the team,\" said Ali in a scathing attack on his YouTube channel . \"Rohit Sharma and Virat Kohli got out playing extremely poor shots,\" Ali added. Rohit 9 and Kohli just 5 during the run chase. India slumped to defeat on Day 5 of the fourth Test. Needing 340 to win on the final day, Rohit Sharma started off on an extremely defensive note, setting the tone for a draw. \"On top of everything, right from the start, you (Rohit) came in defensive, thinking 'Draw, Draw, Draw'. Did you play like you deserve a draw? No,\" said Basit Ali. Ali also did not spare Gautam Gambhir and the team management. In particular, he questioned the decision to not keep a left-hand-right-hand combination in the middle after Rishabh Pant got out. \"I must congratulate Gautam Gambhir too. You (Gambhir) used left-hand-right-hand combinations to your heart's content during the ODI series (against Sri Lanka), the series against New Zealand. Here is when you should've sent Nitish Reddy at No. 6. At least we would've known you've done something to save the game,\" said Basit. Listen to the latest songs , only on JioSaavn.com Finally, Ali also suggested a change of captain. \"I think the time has come for Rohit to step down; (Jasprit) Bumrah should be made captain for the last Test. You (Rohit) have served India a lot, but your body is not supporting you now,\" Ali concluded. Comments Topics mentioned in this article India Cricket Team Australia vs India 2024/25 Cricket Virat Kohli Basit Ali Rohit Sharma Jasprit Bumrah Rishabh Pant Gautam Gambhir Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/cricket/rohit-sharma-you-shattered-indias-confidence-captain-comes-under-scathing-attack-after-mcg-humiliation-7370892",
    "published_date": "2025-01-01T21:49:34+05:30",
    "image_link": null
  },
  {
    "title": "2 Children Drown While Attempting To Catch Duck In UP's Sitapur: Police",
    "author": "",
    "description": "Two children drowned in a pond while attempting to catch a duck in a village here on Wednesday, police said.",
    "text": "2 Children Drown While Attempting To Catch Duck In UP's Sitapur: Police According to police, the incident occurred on Wednesday afternoon in Devkalia village. A duck wandered to the bank. Upon seeing it, the children attempted to catch it and slipped into the pond with no one around to help them. Read Time: 1 min Share Twitter WhatsApp Facebook Reddit Email Further investigation is underway, police said. Sitapur: Two children drowned in a pond while attempting to catch a duck in a village here on Wednesday, police said. The victims were identified as Taimur (5) and his cousin, Arsh (5), police said. According to police, the incident occurred on Wednesday afternoon in Devkalia village. A duck wandered to the bank. Upon seeing it, the children attempted to catch it and slipped into the pond with no one around to help them. Later, some villagers, returning from the fields, saw the children in the pond and alerted the police. The police, with the help of locals, retrieved their bodies and rushed them to Biswa Community Health Center. Doctors declared them dead on arrival. The bodies were sent for post-mortem. Further investigation is underway, police added. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: UP News , Up News Crime News , UP News Latest",
    "link": "https://www.ndtv.com/india-news/2-children-drown-while-attempting-to-catch-duck-in-ups-sitapur-police-7379069",
    "published_date": "2025-01-01T21:48:45+05:30",
    "image_link": null
  },
  {
    "title": "School Bus Flips Over In Kerala, Class 5 Student Crushed Under Wheels",
    "author": "",
    "description": "A Class 5 student was killed after a school bus she was travelling in flipped over in Kerala's Kannur on Wednesday.",
    "text": "School Bus Flips Over In Kerala, Class 5 Student Falls, Crushed Under Wheels Sources alleged a brake failure caused the accident but the police said a detailed probe is underway. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email The incident took place at around 4pm in Valakkai in Sreekantapuram. A Class 5 student was killed after a school bus she was travelling in flipped over in Kerala's Kannur on Wednesday. The incident took place at around 4pm in Valakkai in Sreekantapuram, when the bus belonging to Chinmaya Vidyalaya in Kurumathur panchayat, with 15 students onboard, was travelling down a slope while entering a highway. The students were getting dropped home after school. According to the police, 11-year-old Nedya S Rajesh was thrown out of the bus and crushed under the wheels after the driver lost control. Sources said an alleged brake failure caused the accident but the police said a detailed probe is underway. Thirteen students, who sustained injuries, were rushed to Taliparamba Taluk Hospital by local residents for treatment. The girl's body was shifted to Government Medical College at Pariyaram. There was no immediate comment from the school authorities. Police said a case under sections 281 (rash driving or riding on a public way), 125 (A) (endanger human life or personal safety due to negligence or recklessness), and 106 (1) (causing death by negligence) of the Bharatiya Nyaya Sanhita has been registered against the driver. Meanwhile, the residents blamed the \"unscientific design\" of the road for the accident and alleged such incidents occur frequently in the area. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Kerala , Kannur , Chinmaya Vidyalaya",
    "link": "https://www.ndtv.com/india-news/school-bus-flips-over-in-kerala-kannur-class-5-student-falls-crushed-under-wheels-7379067",
    "published_date": "2025-01-01T21:47:59+05:30",
    "image_link": null
  },
  {
    "title": "Scientists Demonstrate 'Negative Time' In Groundbreaking Quantum Experiment",
    "author": "",
    "description": "Researchers recently posted findings on the preprint server arXiv, drawing global interest and some reservations about what it all means.",
    "text": "Scientists Demonstrate 'Negative Time' In Groundbreaking Quantum Experiment Researchers recently posted findings on the preprint server arXiv, drawing global interest and some reservations about what it all means. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email The results are expected to prompt further investigation into the mysteries of time. Researchers at the University of Toronto have made a groundbreaking discovery, showing that \"negative time\" is not just a theoretical concept but a tangible phenomenon. Scientists at the institution showed through an innovative quantum experiment that light appears to emerge from a material before entering, overturning several decades of prevailing ideas about the nature of time. While much of the attention surrounding the results is international in scope, scientific communities have largely raised an eyebrow over the matter. The results, yet to be published in a peer-reviewed journal, are expected to spur further investigation into the mysteries of time and quantum mechanics. \"It took a positive amount of time, but our experiment observing that photons can make atoms seem to spend a negative amount of time in the excited state is up!\" wrote Aephraim Steinberg, a physicist at the University of Toronto, in a post on X (formerly Twitter) about the new study. Woo-hoo! It took a positive amount of time, but our experiment observing that photons can make atoms seem to spend a *negative* amount of time in the excited state is up! It sounds crazy, I know, but check it out! Kudos to Daniela +the rest of the team! https://t.co/rHrAUJq5rX pic.twitter.com/Lz7Lazb1Gs — Aephraim Steinberg (@QuantumAephraim) September 6, 2024 While the term \"negative time\" might sound like a concept lifted from science fiction, Steinberg defends its use, hoping it will spark deeper discussions about the mysteries of quantum physics. According to a report by Scientific American, the idea for this work emerged in 2017. At the time, Steinberg and a lab colleague, then doctoral student Josiah Sinclair, were interested in the interaction of light and matter, specifically a phenomenon called atomic excitation: when photons pass through a medium and get absorbed, electrons swirling around atoms in that medium jump to higher energy levels. When these excited electrons lapse to their original state, they release that absorbed energy as reemitted photons, introducing a time delay in the light's observed transit time through the medium. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Negative Time , Quantum Experiments , University Of Toronto , Light , Wave Distortion , Scientific Discovery , Peer-reviewed",
    "link": "https://www.ndtv.com/science/scientists-demonstrate-negative-time-in-groundbreaking-quantum-experiment-7378909",
    "published_date": "2025-01-01T21:18:20+05:30",
    "image_link": null
  },
  {
    "title": "\"Toxicity, Abuse\": Post By Delhi Cafe Owner's Wife Days Before His Suicide",
    "author": "",
    "description": "Less than a week before Delhi cafe owner Puneet Khurana died by suicide, his estranged wife and business partner Manika Pahwa had put up a cryptic post on social media stating that she had been...",
    "text": "\"Toxicity, Abuse\": Post By Delhi Cafe Owner's Wife Days Before His Suicide Puneet Khurana and Manika Pahwa, co-owners of the popular Woodbox Cafe in Delhi, were going through a divorce. Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email Khurana's family has blamed Ms Pahwa for his death. Less than a week before Delhi cafe owner Puneet Khurana died by suicide, his estranged wife and business partner Manika Pahwa had put up a cryptic post on social media stating that she had been subjected to \"toxicity and narcissistic abuse\" and was now free. The couple, co-owners of the popular Woodbox Cafe in Delhi, were going through a divorce. Khurana (40) was found hanging in his room in Model Town's Kalyan Vihar area on New Year's Eve. He had spoken to Manika on Monday night and recorded the conversation, in which the couple can be heard fighting over issues related to the business. Khurana's family has blamed Ms Pahwa for his death and said she \"instigated him\" to die by suicide. In her post on Instagram from six days ago, Ms Pahwa said she is healing well \"after all the toxicity and narcissistic abuse\" and was trying to \"be better and to be indifferent\" every day. Without naming anyone, she said higher powers would decide what was best for her \"abusers\". \"Well feminism suits me, as idealistic values are my core & feminism means giving & getting mere respect. To one another. No slave treatment, and no stopping some girl to speak her mind (sic). Even a house help, guard, rikshawala, a tiny kid deserves respectful treatment. Once a coward fought with me that 'respect has to be earned'. Ufff! What disgrace na? I disagree, respect has to be given to each and everyone. If not then you lost the respect baby. Phew! Maybe that's why in India, we address people with ' aap' , 'bhaiya' , 'didi' to even strangers, isn't it?\" she wrote. Referring to her abusers as insecure cowards, Ms Pahwa said virtues like kindness and love are more important than money. \"I just wish these abusers get to see the mirror someday and understand..that kindness, love, understanding, trust,wisdom, affection & care all are true virtues & hold much more importance than money,property & gold. God bless the unkind ones. :) I know nobody can change, but let's just pray, nobody else should suffer because of some bunch of insecure cowards. My tribe, pray with me..okay? :) love you all... I am free, and the beautiful ruins are part of me,\" she wrote. 'Stressed Him Out' On Wednesday, Khurana's sister told news agency ANI that Ms Pahwa had instigated him . \"Manika Pahwa, her parents and her sister forced my brother, stressed him out, instigated him by saying, 'you can't do anything, die by suicide if you dare'. Puneet shot a video before his death, it is on his phone, he has said everything, about how Manika and his parents pressured him mentally. They threatened to throw our parents out and dared him to open his shop's shutter. They kept abusing him,\" she said. She claimed the division of the business had been laid out clearly, but Ms Pahwa kept asking for her share from the other part too. \"They earlier ran the bakery business in partnership. But when the first motion for divorce was signed, it was decided and put in writing that Puneet would manage For God's bakery and Manika would get Woodbox Cafe. It was signed. Even after that, she kept saying that she won't leave her share. When the matter has been decided in court, go and raise the issue there. She kept calling him and demanding her share,\" the sister said. Khurana's mother also claimed Ms Pahwa kept torturing her son and he suffered in silence. \"The two shared the business, they would have disputes over it. He would not say anything openly to us, thinking we would be upset. He kept swallowing his grief. My son was doing well, but she tortured him so much yesterday that he took this step,\" she said. The couple got married in 2016 and had been separated for two years. Khurana's family has filed a police complaint and sought action against Ms Pahwa and her family. Helplines Vandrevala Foundation for Mental Health 9999666555 or help@vandrevalafoundation.com TISS iCall 022-25521111 (Monday-Saturday: 8 am to 10 pm) (If you need support or know someone who does, please reach out to your nearest mental health specialist.) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Delhi Cafe Owner Suicide , Puneet Khurana , Woodbox Cafe",
    "link": "https://www.ndtv.com/india-news/puneet-khurana-manika-pahwa-woodbox-cafe-toxicity-abuse-post-by-delhi-cafe-owners-wife-days-before-his-suicide-7378866",
    "published_date": "2025-01-01T21:17:14+05:30",
    "image_link": null
  },
  {
    "title": "\"Rohit Sharma Thought About Himself\": Ex-India Star's Staunch Critique",
    "author": "",
    "description": "Rohit Sharma's decision forced KL Rahul to bat at No. 3 and saw Shubman Gill being dropped.",
    "text": "Story Progress Back to home \"Rohit Sharma Thought About Himself\": Ex-India Star's Staunch Critique After Melbourne Test Loss Rohit Sharma's decision forced KL Rahul to bat at No. 3 and saw Shubman Gill being dropped. facebook twitter WhatsApp reddit E-mail File image of Rohit Sharma during the India vs Australia 4th Test. © AFP Former India cricketer, and now reputed pundit, Aakash Chopra stated that India captain Rohit Sharma 's decision to open the batting in the fourth Test of the Border-Gavaskar Trophy 2024/25 was purely out of his own interest and not the team's. Rohit's decision - which forced KL Rahul to bat at No. 3 and saw Shubman Gill being dropped - backfired, as he failed to return to form and India lost. Aakash Chopra also delved on the topic of Rohit dropping himself for the final Test in Sydney. \"For the first time, captain Rohit took a call and it was totally in his interests. It was not in the team's interests. Let's be very honest. It can't be in the team's interests because Rahul was opening very well. Shubman Gill did well in 2023, he is the second-highest run-scorer,\" Chopra said on his YouTube channel . \"All this is because Rohit thought about himself, not in the best interests of the team. For the first time in his captaincy career. It didn't turn out fine. India were not able to draw,\" Chopra added. Chopra stated that while MS Dhoni and Virat Kohli had tinkered with Rohit's batting position before during their captaincy stints, this was the very first time he did so himself for his own interest. Opening the batting in the Melbourne Test, Rohit made only 3 and 9 in the two innings, as India were unable to save the Test on the final day. Listen to the latest songs , only on JioSaavn.com \"In the team's interest, will he sit out of the Sydney Test? I am not saying retirement, but dropping himself for the Sydney Test, saying 'I am not able to contribute. Okay, let Rahul open the batting, let Shubman Gill bat at No. 3,\" Chopra speculated. Reports have also emerged that Rohit Sharma may announce his retirement from the longest format of the game after the fifth Test. Advertisement Comments Topics mentioned in this article Rohit Sharma KL Rahul Shubman Gill Aakash Chopra Cricket India Cricket Team Australia vs India 2024/25 Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/cricket/rohit-sharma-thought-about-himself-ex-india-stars-staunch-critique-after-melbourne-test-loss-7370059",
    "published_date": "2025-01-01T21:08:13+05:30",
    "image_link": null
  },
  {
    "title": "\"Pant Should Be...\": Ex-India Star Follows Up On Gavaskar's Scathing Attack",
    "author": "",
    "description": "Sanjay Manjrekar took to social media to discuss Rishabh Pant's dismissal.",
    "text": "Story Progress Back to home \"Rishabh Pant Should Be Criticised...\": Ex-India Star Follows Up On Sunil Gavaskar's Scathing Attack Sanjay Manjrekar took to social media to discuss Rishabh Pant's dismissal. facebook twitter WhatsApp reddit E-mail File image of Rishabh Pant. © AFP Amid the poor run of form by wicketkeeper-batter Rishabh Pant in Australia, Former Indian cricketer Sanjay Manjrekar said that the youngster should be \"criticised for his failures, rather than the way he fails\". Pant, who has had a fine record against Australia, has failed to convert his fine starts into big scores Down Under this time around. Often, he has fallen prey to poor shot-making, which has drawn immense criticism from the cricketing fraternity and fans, most notably former Indian cricketer Sunil Gavaskar. So far in four matches, he has made 154 runs at an average of 22.00, with no half-centuries in seven innings. His best score is 37. Taking to X, Manjrekar wrote, \"Pant should be criticised only for his failures, rather than how he fails. He averages 42 in Tests with at least 3 great inngs, ever played by an Indian! In 42 tests he has 6 hundreds & 7 nineties. He is a great player not scoring enough runs & that's the crux of it.\" Pant should be criticised only for his failures, rather than how he fails. He averages 42 in Tests with at least 3 great inngs, ever played by an Indian! In 42 tests he has 6 hundreds & 7 nineties. He is a great player not scoring enough runs & that's the crux of it. #INDvsAUS — Sanjay Manjrekar (@sanjaymanjrekar) December 31, 2024 In 11 matches in Australia, Pant has scored 778 runs at an average of 45.76 and a strike rate of 66.72, with a century and two fifties in 19 innings. His best score is 159*. In his first trip to Australia in 2018-19, he made 350 runs in four matches and seven innings at an average of 58.33, with a century and best score of 159*, ending as India's top-run getter. Later in 2020-21, Pant scored 274 runs in three matches at an average of 68.50, with two half-centuries in five innings and best score of 97. His knocks of 97 at Sydney during a draw and 89* to chase down 328 runs at Brisbane are among his best innings that launched the swashbuckling keeper into stardom. This year in nine Tests since his return to cricket after a life-threatening road accident in 2022, he has made 576 runs at an average of 36.00, with a century and three fifties. His best score is 109. Listen to the latest songs , only on JioSaavn.com The final Test of the series will be the New Year's Test held at Sydney Cricket Ground (SCG) from January 3 onwards. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Comments Topics mentioned in this article Rishabh Pant India Cricket Team Sunil Gavaskar Sanjay Manjrekar Australia vs India 2024/25 Cricket Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/cricket/rishabh-pant-should-be-criticised-ex-india-star-follows-up-on-sunil-gavaskars-scathing-attack-7369528",
    "published_date": "2025-01-01T21:00:22+05:30",
    "image_link": null
  },
  {
    "title": "Bangladesh At Centre Of 'Timed Out' Controversy Again, But With A Twist",
    "author": "",
    "description": "An incident in the Bangladesh Premier League (BPL) saw Australian batter Tom O'Connell suffer a rare form of dismissal, but a gesture from Mehidy Hasan Miraz won hearts.",
    "text": "Story Progress Back to home Bangladesh At The Centre Of 'Timed Out' Controversy Again, But With A Twist An incident in the Bangladesh Premier League (BPL) saw Australian batter Tom O'Connell suffer a rare form of dismissal, but a gesture from Mehidy Hasan Miraz won hearts. facebook twitter WhatsApp reddit E-mail Mehidy Hasan Miraz calls back Tom O'Connell after the Timed Out dismissal. © X (Twitter) In a dramatic turn of events during the Bangladesh Premier League (BPL) on Tuesday in Shere Bangla National Stadium, Australian player Tom O'Connell, representing the Chittagong Kings, found himself at the centre of a rare and controversial dismissal, as per Wisden. O'Connell was sent in to bat at No. 7 after the fall of Haider Ali's wicket in the seventh over. However, there was a significant delay between Haider's dismissal and O'Connell's appearance at the crease. The prolonged wait led to growing impatience among the Khulna Tigers fielders and curious glances from the Kings' dugout. Commentators noted the unexpected flurry of wickets that had caused the delay. Eventually, O'Connell hurried out from the glass doors, attempting to reach the crease in time. By this point, the umpires were already discussing the situation with Khulna Tigers' captain, Mehidy Hasan Miraz. Mehidy, checking the umpire's wristwatch, signalled that they wished to continue with their appeal for a timed-out dismissal, the report said. The umpires then declared O'Connell out, lifting a finger to signal the scorers, based on clause 40.1 of the BPL playing conditions, which aligns with men's T20I regulations. This rule mandates that an incoming batter must be ready to face the next delivery within 30 seconds of the previous batter's dismissal or retirement, failing which they can be timed out. As O'Connell dejectedly walked off the field, Mehidy reconsidered and spoke to the umpires again, ultimately calling O'Connell back to bat. The commentators praised Mehidy for upholding the spirit of cricket. However, the drama didn't end there. On the very first ball O'Connell faced, he hit it straight to Mehidy. Listen to the latest songs , only on JioSaavn.com This incident was particularly notable as Mehidy had been part of the Bangladesh team that appealed for a time-out against Angelo Mathews during the previous year's ODI World Cup, a decision that sparked considerable debate within the cricket community. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Advertisement Comments Topics mentioned in this article Mehidy Hasan Bangladesh Cricket Team Australia Cricket Team Cricket Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/cricket/bangladesh-at-the-centre-of-timed-out-controversy-again-but-with-a-twist-7372736",
    "published_date": "2025-01-01T20:52:57+05:30",
    "image_link": null
  },
  {
    "title": "Australia Makes Confirmation Of Enrollment Mandatory For Student Visa Applications",
    "author": "",
    "description": "India is the second-largest contributor to international student enrollments in Australia, with 122,391 Indian students studying there.",
    "text": "Australia Makes Confirmation Of Enrollment Mandatory For Student Visa Applications India is the second-largest contributor to international student enrollments in Australia, with 122,391 Indian students studying there. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email The CoE requirement at time of application demonstrates a stronger commitment from student to study Australia's Department of Home Affairs will now require applicants to submit a Confirmation of Enrolment (CoE) for student visa applications starting today, as per the official notice. This change applies to applications made on or after January 1, 2025, and does not affect those submitted before that date with a Letter of Offer. The official notification states: \"Failure to provide a CoE at the time of application will render the application invalid. Visa decision makers cannot assess an invalid application. An associated Bridging visa cannot be granted where the substantive visa application is not valid.\" It further emphasises that this change will align the requirements for providing evidence of an intended course of study for both onshore and offshore student visa applications. The CoE requirement at the time of application demonstrates a stronger commitment from the student to study at the institution, which increases certainty for Australia's international education sector. India is the second-largest contributor to international student enrollments in Australia, with 122,391 Indian students studying there between January and September 2023, according to the High Commission of India in Canberra. Popular study areas for Indian students include Business, Information Technology, Engineering, Science, and Hospitality. The similar educational systems in India and Australia make it easier for Indian students to adjust to life and studies in Australia. Australia offers various student-related visas. The Student Visa (Subclass 500) allows students to stay in Australia for up to five years, depending on their course duration. The Student Guardian Visa (Subclass 590) is for parents or relatives of students under 18, allowing them to stay temporarily as long as the student's visa remains valid. The Training Visa (Subclass 407) permits individuals to gain practical experience or participate in professional development programs for up to two years. Show full article Comments Track Education News , Exam updates , Campus , Study Abroad related news live on NDTV.com Follow us: Australia - India , Study Australia , Study Abroad",
    "link": "https://www.ndtv.com/education/australia-makes-confirmation-of-enrollment-mandatory-for-student-visa-applications-7378746",
    "published_date": "2025-01-01T20:49:05+05:30",
    "image_link": null
  },
  {
    "title": "Team India In 2024: Who Were Top Wicket-Takers In Tests, ODIs And T20Is?",
    "author": "",
    "description": "Jasprit Bumrah bagged a whopping 71 wickets for India in Tests in 2024.",
    "text": "Story Progress Back to home Indian Cricket In 2024: Who Were The Top Wicket-Takers In Tests, ODIs And T20Is? Jasprit Bumrah bagged a whopping 71 wickets for India in Tests in 2024. facebook twitter WhatsApp reddit E-mail Jasprit Bumrah was the top wicket-taker for India in Tests in 2024 © AFP Indian cricketers had a mixed 2024, that saw the team end more than a decade-long wait for an ICC title, bagging the 2024 T20 World Cup title in the USA and West Indies. But, the year also saw the team struggle in other formats. While India failed to win a single match in ODIs, they also suffered humiliation in Tests at home against New Zealand before witnessing some heartbreaking results in Australia. Though team milestones were a few, Indians did manage to make headlines with some personal landmarks. In Test cricket, India's marquee pacer Jasprit Bumrah finished the year with 71 wickets to his name, putting him at the No. 1 spot, not just for the country but across the globe. The second player on the global list was Gus Atkinson of England, with 52 wickets to his name in the longest format. In India, Bumrah was joined by Ravindra Jadeja (48 wickets) at the No. 2 spot. Player Mat Inns Wkts Ave Econ SR Jasprit Bumrah 13 26 71 14.92 2.96 30.1 Ravindra Jadeja 12 21 48 24.29 3.32 43.7 Ravichandran Ashwin 11 21 47 27.25 3.8 42.9 Mohammed Siraj 13 25 35 30.82 3.76 49.1 Kuldeep Yadav 5 10 22 23.09 3.74 37 In ODIs, India just featured in three matches, losing all of them against Sri Lanka. Hence, ending the year without a single win to their name, a unique milestone not acheived in nearly 50 years. In that series, Washington Sundar bagged the most wickets for the national team, picking 5 while Kuldeep Yadav and Axar Patel stood 2nd and 3rd with 4 scalps each to their names. Player Mat Inns Wkts Ave Econ SR Washington Sundar 3 3 5 21 3.88 32.4 Kuldeep Yadav 3 3 4 25.5 3.4 45 Axar Patel 3 3 4 28 3.86 43.5 Mohammed Siraj 3 3 3 52.33 6.28 50 Riyan Parag 1 1 3 18 6 18 Arshdeep Singh 2 2 2 52.5 6.17 51 In T20Is, Arshdeep Singh was the brightest star for India with the ball, picking 18 wickets while Ravi Bishnoi came in second with 16 scalps. Axar Patel also shone in this format, picking 16 wickets too. Player Mat Inns Wkts Ave Econ SR Arshdeep Singh 18 18 36 13.5 7.49 10.8 Ravi Bishnoi 16 16 22 20.86 7.52 16.6 Axar Patel 16 16 20 16.3 7.08 13.8 CV Varun 7 7 17 12.41 7.53 9.8 Hardik Pandya 17 16 16 26.25 8.23 19.1 Which players would shine in 2025? Comments Topics mentioned in this article India Cricket Team Jasprit Bumrah Arshdeep Singh Washington Sundar Cricket Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/cricket/indian-cricket-in-2024-who-were-the-top-wicket-takers-in-tests-odis-and-t20is-7376156",
    "published_date": "2025-01-01T20:40:14+05:30",
    "image_link": null
  },
  {
    "title": "9-Month-Old White Tiger Dies at Delhi Zoo Due To \"Traumatic Shock\"",
    "author": "",
    "description": "A nine-month-old female white tiger, which was undergoing treatment, died at Delhi Zoo due to \"traumatic shock\" and \"acute pneumonia\", officials said on Wednesday.",
    "text": "9-Month-Old White Tiger Dies at Delhi Zoo Due To \"Traumatic Shock\" The cub, which was under observation at the hospital since September, died four days ago, zoo director Sanjeev Kumar said. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email The cub was under observation at the hospital since September (Representational) New Delhi: A nine-month-old female white tiger, which was undergoing treatment, died at Delhi Zoo due to \"traumatic shock\" and \"acute pneumonia\", officials said on Wednesday. The cub, which was under observation at the hospital since September, died four days ago, zoo director Sanjeev Kumar said. \"The female cub was under treatment. She passed away due to traumatic shock and acute pneumonia. Her samples have been sent to the lab for testing,\" SanjeevKumar told PTI. To ensure the safety of the remaining animals, SanjeevKumar said preventive treatment and close observation have been initiated for the other cubs. An official source in the zoo said three tiger cubs were admitted to the hospital for different reasons. The cub which died had suffered a fracture. \"The treatment of the other cubs has been completed, and they are doing fine,\" the source said. Established in 1952, the National Zoological Park, also known as Delhi Zoo, is located in a 176-acre area under the Central government's jurisdiction. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: White Tiger Dies At Delhi Zoo , White Tiger Delhi Zoo , Delhi Zoo",
    "link": "https://www.ndtv.com/india-news/9-month-old-white-tiger-dies-at-delhi-zoo-due-to-traumatic-shock-7378683",
    "published_date": "2025-01-01T20:37:27+05:30",
    "image_link": null
  },
  {
    "title": "ISRO's US Satellite Launch May Make Phone Calls Directly Via Space A Reality",
    "author": "",
    "description": "India is all set to launch a massive American communications satellite that would allow making phone calls using direct connectivity from space. This is a highly innovative and a more modern approach...",
    "text": "US Satellite Launch By ISRO May Make Phone Calls Directly Via Space A Reality This is also the first time an American company is launching a massive communications satellite from India in a dedicated launch on an Indian rocket. Till date, India has only launched small satellites made by American entities. Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email Massive AST SpaceMobile satellites deployed in low Earth orbit an artist's impression. New Delhi: India is all set to launch a massive American communications satellite that would allow making phone calls using direct connectivity from space. This is a highly innovative and a more modern approach to satellite telephony than the existing services. This is also the first time an American company is launching a massive communications satellite from India in a dedicated launch on an Indian rocket. Till date, India has only launched small satellites made by American entities. India's Science Minister Dr Jitendra Singh disclosed that \"In February or March we will be launching a US satellite for mobile communication, this satellite will enable voice communication on mobile phones. It will be an interesting mission\". While neither the minister nor Indian space agency ISRO confirmed who the American satellite operator is, experts confirm that it is AST SpaceMobile, a Texas-based company is hoping to launch its big communication satellite from Sriharikota. The US company has asserted that one can use any smartphone to make voice calls using their services. Most other current satellite-based Internet and voice providers ask subscribers to buy special handsets or have special terminals like Starlink does. American media had reported that Abel Avellan, the CEO of AST SpaceMobile, had confirmed in an investor call last year by announcing that they will use the Geo-synchronous Satellite Launch Vehicle (GSLV) to launch a single Block 2 of the Bluebird satellite. NDTV has reached out to AST SpaceMobile for a statement. No response came in till the time the story was filed. Each Bluebird satellite will have an antenna of the size of 64 square meters or about half the size of a football field. The satellite will weigh nearly 6000 kilograms and India's rocket will put it in a low Earth orbit. In an earlier statement, Abel Avellan said they \"invented a technology that connects satellites directly to ordinary cell phones and provides broadband internet through the largest ever commercial phase array in low Earth orbit\". AST SpaceMobile's mission, he added, is to close the global connectivity gap and digitally transform nations by bringing \"affordable 5G broadband service from space to billions of people worldwide, direct to everyday smartphones\". An ISRO expert said this satellite will enable \"direct to mobile communication\" and the company is hoping to place some massive satellites in the Earth's orbit to power this path-breaking technology. ISRO experts confirmed that AST SpaceMobile has hired the services of India's Bahuballi rocket or the Launch Vehicle Mark-3 for launching the Bluebird satellite. It is a huge boost for ISRO since now even American companies are having faith in India's LVM-3 which has a one hundred percent success record. Before this there have been two dedicated commercial launches of LVM-3 to hoist satellites for the OneWeb constellation, where Bharti Enterprises have a big stake, the same group also owns Indian telecom service Airtel. This new satellite-based direct to mobile connectivity will be in direct competition to the existing providers like Starlink and Oneweb, both of which use massive constellations (satellite network) to provide broadband Internet connectivity. In contrast, an ISRO expert said since AST SpaceMobile wants to deploy massive satellites they could make do with a slightly smaller constellation. AST SpaceMobile asserts its technology is \"designed to connect directly to mobile phones by becoming a pioneer as we create the first and only space-based cellular broadband network\". The American company further added: \"Our goal is to make cellular broadband available almost anywhere so you can connect with the rest of the world - regardless of where you live or work. We want to help people stay connected where traditional networks can't, including when existing telecom infrastructure fails. We hope to welcome new populations into the global digital economy, opening up opportunities for work, education, social networking, healthcare, and more. AST SpaceMobile's planned solution may not require switching cellular service providers. We're working with mobile network operators around the world to provide optional connectivity to our satellites when needed.\" ISRO experts confirm that it is a purely commercial launch being spearheaded by New Space India Limited (NSIL), the commercial arm of the Department of Space. India is just providing a ride to the American satellite and nothing more. Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: ISro",
    "link": "https://www.ndtv.com/india-news/us-satellite-launch-by-isro-may-make-phone-calls-directly-via-space-a-reality-7378668",
    "published_date": "2025-01-01T20:33:47+05:30",
    "image_link": null
  },
  {
    "title": "Atul Wassan Slams India Players For \"Casual Batting\"",
    "author": "",
    "description": "Atul Wassan feels India's current position in the ongoing Border-Gavaskar Trophy comes down to \"collective failure\" and star players' incapability to make runs has been a well-known issue for the...",
    "text": "Story Progress Back to home Atul Wassan Slams India Players For \"Casual Batting\", Feels Team Is Filled With \"Glamorous Batters\" Atul Wassan feels India's current position in the ongoing Border-Gavaskar Trophy comes down to \"collective failure\" and star players' incapability to make runs has been a well-known issue for the touring party. facebook twitter WhatsApp reddit E-mail File photo of Virat Kohli. © AFP Former cricketer Atul Wassan feels India's current position in the ongoing Border-Gavaskar Trophy comes down to \"collective failure\" and star players' incapability to make runs has been a well-known issue for the touring party. Wassan believes India is missing \"unglamorous\" batters in its lineup like Cheteshwar Pujara, who used to see out the entire session while solely relying on his defensive prowess. India fell to a 2-1 series trail after receiving a humbling by Australia in front of a sold-out crowd at the MCG in the Boxing Day Test. Throughout the match, India's pace attack looked out of ideas in patches, and the top batters looked out of their depths across both innings. While there were moments of individual brilliance from the likes of Nitish Kumar Reddy, Washington Sundar and Jasprit Bumrah, it wasn't enough to save the day for India. To chase down the 340-run target on the final day was a big ask as India pushed for a draw to keep the series and its WTC final chances alive till Sydney. However, Pat Cummins led from the front, forcing India's back against the wall in the final session. India lost seven wickets towards the end of the day and succumbed to an 184-run defeat. When India needed its big guns to come to its rescue, the established batting stalwarts misfired. The story has been the same since India left Perth, with just the venues changing. \"It was a collective failure. Everybody knows what is the issue. Star players are not making runs, and it has been casual batting. Youngsters who are batting well are being sent too deep in the order. Something should be done. The batting order should be changed, Virat should come down, and Reddy should be promoted,\" Wassan told ANI. In the ongoing series, Virat Kohli and captain Rohit Sharma, two of the most experienced stars, have failed to deliver. The seasoned opener, Rohit, has just 31 runs from five innings, with an average of 6.20. On the other hand, Virat has 167 runs to his name in the series at an average of 27.83. Advertisement When India needed someone to hold on to the wicket at one end, Pujara was the answer to the problem. The veteran made a reputation of being one of the most capable Test batters of modern-day cricket. He was one of the prominent faces during India's back-to-back BGT series win in Australia. Wassan feels the current Indian side is missing a player like Pujara, who can bat \"dirty.\" According to him, the touring party is filled with all the \"glamorous batters.\" \"It is all about application. The way Pujara batted, dirty batting, ugly batting. He used to play the whole session, unglamorous batting. It is missing we have all the glamorous batters,\" he added. Listen to the latest songs , only on JioSaavn.com Pujara's value is reflected in his terrific numbers in Australia. In 11 matches, Pujara has slammed a whopping 993 runs at an average of 47.28, including three centuries. Advertisement (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Comments Topics mentioned in this article Cricket India Cricket Team Atul Satish Wassan Australia vs India 2024/25 Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/cricket/atul-wassan-slams-india-players-for-casual-batting-feels-team-is-filled-with-glamorous-batters-7378620",
    "published_date": "2025-01-01T20:32:47+05:30",
    "image_link": null
  },
  {
    "title": "Rohit's 3 Options In Do-Or-Die 5th Test For India's Sake: Step Aside Or...",
    "author": "",
    "description": "With the series in line after his team's 184-run drubbing in the Boxing Day Test, Rohit Sharma might have to field his six best batters at the Sydney Cricket Ground",
    "text": "Story Progress Back to home Rohit Sharma's Three Options In Do-Or-Die Sydney Test For India's Sake: Step Aside Or... With the series in line after his team's 184-run drubbing in the Boxing Day Test, Rohit Sharma might have to field his six best batters at the Sydney Cricket Ground facebook twitter WhatsApp reddit E-mail India vs Australia: Rohit Sharma © AFP Standing at the crossroads of his Test career, skipper Rohit Sharma has certain choices to make in the best interests of the Indian team heading into the fifth and final Test against Australia. With the series in line after his team's 184-run drubbing in the Boxing Day Test, the Indian captain might have to field his six best batters at the Sydney Cricket Ground, which will pave the way for Shubman Gill 's inclusion in the playing XI after being dropped for the previous game in Melbourne. With 866 runs in Test cricket in 2024, Gill is second only to Yashasvi Jaiswal in the list of highest scorers among Indian batters in last one year, and one can't blame the elegant player if he is feeling hard done by at being asked to sit out at MCG. Rohit, though, informed that the team management explained Gill the reasons behind his omission in Melbourne. He was dropped to ensure better balance in the playing XI with Washington Sundar 's bowling being an additional advantage. What are Rohit's options The question that arises now is how does Rohit accommodate Gill in the playing XI for the Sydney game, which India need to win at all costs to keep alive their slim chances of qualifying for next year's World Test Championship (WTC) Final. Washington did himself no harm by scoring a 50 and was involved in a crucial hundred- plus stand with centurion Nitish Kumar Reddy. And if his bowling was penetrative enough, he would have certainly bowled more overs. SCG has traditionally been a track that assists spinners as the match progresses and hence either Washington or Tanush Kotian is certain to play alongside Ravindra Jadeja , unless the skipper develops sudden faith in Jaiswal's leg-breaks and decides to a play the specialist batter (Gill) and not the batting all-rounder (Washington). Advertisement The Adelaide Test, played under lights with the pink Kookaburra, presented the Indian team with the most challenging circumstances and Gill, with scores of 31 and 28, looked way more comfortable than both Rohit and Virat Kohli . The second option could be more convenient and it involves dropping one among Mohammed Siraj and Akash Deep to include Gill as three specialist pacers could be a luxury at SCG with Jadeja and Washington expected to bowl more overs than in Melbourne. Siraj redeemed himself with a fine spell at Sydney while Akash Deep was distinctly unlucky to get just one wicket across two innings. The third option is the most inconvenient one but perhaps the need of the hour too if Rohit wants to lead by example. Listen to the latest songs , only on JioSaavn.com With just 31 runs in five innings and 155 runs in past 14 knocks, the skipper could himself volunteer to step aside and let the young turk play, with KL Rahul regaining his opening slot, where he has looked the most assured. Taking a back seat to allow the team move forward is a call that can only be taken if the heart is in the right place. Comments Topics mentioned in this article India Cricket Team Australia Cricket Team Rohit Sharma Australia vs India 2024/25 Cricket Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/cricket/rohit-sharmas-three-options-in-do-or-die-sydney-test-for-indias-sake-step-aside-or-7372242",
    "published_date": "2025-01-01T20:26:37+05:30",
    "image_link": null
  },
  {
    "title": "Video: Delhi Witnesses Massive Traffic Jams On New Year's Day",
    "author": "",
    "description": "Several roads in Delhi were jam-packed and long queues formed at key metro stations as huge crowds thronged to India Gate, Connaught Place and religious places across the national capital on New...",
    "text": "Video: Delhi Witnesses Massive Traffic Jams On New Year's Day The C-Hexagon at India Gate saw a massive crowd gathering on Kartavya Path, leading to traffic congestion in the area. Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email Several areas of Delhi witnessed massive traffic jam today. New Delhi: Several roads in Delhi were jam-packed and long queues formed at key metro stations as huge crowds thronged to India Gate, Connaught Place and religious places across the city on New Year's Day. The C-Hexagon at India Gate saw a massive crowd gathering on Kartavya Path, leading to traffic congestion in the area. Other key spots attracting large crowds included Bangla Sahib Gurdwara, Prachin Hanuman Mandir in Connaught Place, Akshardham Mandir, Jhandewalan Mandir, Khatu Shyam Mandir on GT Road and the Jagannath Temple in south Delhi. A massive crowd gathered at multiple metro stations, including the Central Secretariat, Mandi House, and Rajiv Chowk. Long lines were seen at the entry gates and ticket counters, while the platforms were equally packed with commuters eager to board the trains. Massive traffic hit Parliament Street, India Gate, and Connaught Place in central Delhi. The situation was similar at Karawal Nagar in northeast Delhi, at Rithala towards Rohini Sector-24, from Samaypur Badli to Shahbad Dairy in northwest Delhi, at Gol Market, from Ajmeri Gate Chowk to Paharganj Chowk in central Delhi, at Burari bypass, etc. Taking to social media, Delhi Traffic Police said, \"Traffic is affected on Rohtak Road in both the carriageways from Mundka to Rajdhani Park and vice-versa due to deep potholes and water logging. Kindly plan your journey accordingly.\" Deepali Verma, who came to Hanuman Mandir from north Delhi to seek blessings, said, \"I wish everyone a very happy New Year filled with peace and prosperity. I have come here along with my husband and son to offer prayers at the temple and seek Lord Hanuman's blessings.\" According to a police officer, their main focus was on India Gate, Ashoka Road, Hanuman Mandir and Connaught Place. \"We have deployed personnel across 11 roads at India Gate's C-Hexagon. Auto-rickshaws are not being allowed to park on C-Hexagon, and visitors have been asked to stay within the India Gate premises to minimize traffic disruptions,\" the officer explained. The crowd is expected to increase in the evening, another officer said. Kajal, a resident of Machkar Village who visited Qutub Minar with her family on New Year's Day, expressed her frustration after waiting for over an hour to get entry tickets. \"After waiting for so long, all our excitement has faded. We're now questioning why we even came here. The crowd this time is much larger than before,\" she said. Sayed Ameer, who travelled from Hyderabad to visit Delhi on New Year's Day, shared his experience of visiting Qutub Minar. \"Qutub Minar is beautiful, but the crowd here is overwhelming. There's a massive queue at the ticket counter, but thankfully, my friend and I booked our tickets online, which made it much easier for us to gain entry,\" he said. The Delhi Traffic Police also reported congestion in several areas on Wednesday, including Jhandewalan, GT Road at Alipur and Paharganj Chowk. The Delhi Metro also experienced overcrowding, with long queues forming at key stations. Apart from this, the famous markets of the national capital also witnessed a large number of shoppers. According to the Chamber of Trade and Industry (CTI), Chairman Brijesh Goyal and President Subhash Khandelwal, markets like Kamla Nagar, Sarojini Nagar, Chandni Chowk, Sadar Bazar, Rajouri Garden, Lajpat Nagar, Connaught Place, South Extension and Karol Bagh were packed with crowds and shoppers. \"We have seen a very good response this New Year season,\" they said. Ashok Randhawa, president of the Sarojini Nagar Mini Market Traders' Association, said the number of people visiting the market had increased on Wednesday. \"The number of shoppers surged today, almost like a weekend crowd. The recent cold snap, following rain in Delhi, has driven demand for winter clothing, boosting sales,\" Randhawa added. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Delhi Traffic , Delhi New Year , Delhi New Year Traffic",
    "link": "https://www.ndtv.com/delhi-news/delhi-witnesses-massive-traffic-jams-on-new-years-day-7378576",
    "published_date": "2025-01-01T20:17:04+05:30",
    "image_link": null
  },
  {
    "title": "Manjrekar Baffled By Kohli's Constant Dismissals On Outside Off Stump Balls",
    "author": "",
    "description": "Sanjay Manjrekar feels it's high time for India stalwart Virat Kohli to get some runs and overcome his \"weakness\" of edging it away on outside off stump deliveries.",
    "text": "Story Progress Back to home Sanjay Manjrekar Baffled By Virat Kohli's Constant Dismissals On Outside Off Stump Deliveries Sanjay Manjrekar feels it's high time for India stalwart Virat Kohli to get some runs and overcome his \"weakness\" of edging it away on outside off stump deliveries. facebook twitter WhatsApp reddit E-mail File photo of Virat Kohli. © AFP Cricketer-turned-commentator Sanjay Manjrekar feels it's high time for India stalwart Virat Kohli to get some runs and overcome his \"weakness\" of edging it away on outside off stump deliveries. Australian pacers have exploited Virat by tempting him to drive the outside off-stump delivery throughout the four Tests of the ongoing Border-Gavaskar Trophy. Despite all his batting technique prowess, Virat's six dismissals in the series have followed the same pattern, going after the outside off-stump deliveries. Apart from his century in Perth, Virat's struggle to maintain his discipline has been the root cause behind his bleak outings with the bat. \"It's time that he not only got runs but got out in a different fashion to show that he's overcome that problem. I've never seen somebody with the kind of performance and impact that Virat Kohli had on Test cricket have this kind of weakness,\" Manjrekar said on ESPNcricinfo. \"I don't think any other top-class batter has had this. There may have been a patch where somebody has got out repeatedly in a fashion, but this has gone on for far too long,\" he added. Manjrekar isn't the only former star who has criticised Virat for the manner he has been dismissed in Australia. Former all-rounder Irfan Pathan has been vocal about Virat's long-standing struggle with the outside off-stump deliveries. \"The shot by Virat Kohli--this is neither the first nor the last time. He is not letting go of the temptation to drive outside the off-stump,\" Pathan said on Star Sports. \"He has been doing this for many years. Everyone is saying the same thing. Virat Kohli also knows this,\" he added. Listen to the latest songs , only on JioSaavn.com After the conclusion of the four Tests, Virat has managed to garner 167 runs in seven innings, averaging 27.83. With India trailing in the series with a 2-1 scoreline, his performance would be pivotal in deciding the fate of the BGT. Advertisement (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Comments Topics mentioned in this article Cricket India Cricket Team Australia Cricket Team Australia vs India 2024/25 Virat Kohli Sanjay Manjrekar Get the Latest Cricket Updates, Check India Tour of Australia 2024-25 , Results , News and IPL 2025 Mega Auction Updates at NDTV Sports . Like Us On Facebook Or Follow Us On Twitter For More Sports Updates. You Can Also Download The NDTV Cricket App For Android Or iOS .",
    "link": "https://sports.ndtv.com/cricket/sanjay-manjrekar-baffled-by-virat-kohlis-constant-dismissals-on-outside-off-stump-deliveries-7378305",
    "published_date": "2025-01-01T20:17:01+05:30",
    "image_link": null
  },
  {
    "title": "Student Kills Parents After Differences Over Education, Career: Police",
    "author": "",
    "description": "An engineering student in Maharashtra's Nagpur allegedly killed his parents apparently due to differences with them over his education and career, police said on Wednesday.",
    "text": "Engineering Student Kills Parents After Differences Over Education, Career: Police After the recovery of the decomposed bodies of his parents, Utkarsh was arrested and he confessed to killing them, DCP (Zone V) Niketan Kadam said. Read Time: 2 mins Share Twitter WhatsApp Facebook Reddit Email The motive appears to be a dispute over Utkarsh's struggling academic record and career, police said. Nagpur: An engineering student in Maharashtra's Nagpur allegedly killed his parents apparently due to differences with them over his education and career, police said on Wednesday. The 25-year-old accused, Utkarsh Dhakhole, killed his parents at their residence in Kapil Nagar area of the city on December 26 and the double murder came to light on Wednesday morning after neighbours complained of a foul smell, an official said. After the recovery of the decomposed bodies of his parents, Utkarsh was arrested and he confessed to killing them, DCP (Zone V) Niketan Kadam said. The deceased were identified as Liladhar Dhakhole (55) and his 50-year-old wife Aruna, he said. \"Utkarsh allegedly strangled his mother, a teacher, around noon on December 26 and later stabbed his father, a technician at a power plant and social worker, to death when he returned home around 5 pm. He then left the bodies there,\" the official said. The motive appears to be a dispute over Utkarsh's struggling academic record and career, he said. \"Utkarsh failed to clear several subjects during his engineering course. His parents, therefore, wanted him to quit engineering and choose something else. However, he was against their suggestion,\" Kadam added. After killing his parents, he took his college-going sister, who did not know about their murder, to their uncle's residence. He falsely told the relatives that his parents had gone to Bengaluru to take part in a meditation programme for a few days. Along with his sister, Utkarsh also stayed at his uncle's place, he said. However, the double murder finally came to light and he was arrested, the official said. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Nagpur , Maharashtra",
    "link": "https://www.ndtv.com/india-news/nagpur-student-kills-parents-after-differences-over-education-police-7378494",
    "published_date": "2025-01-01T20:01:06+05:30",
    "image_link": null
  },
  {
    "title": "Ayodhya, Varanasi Temples See Unprecedented Rush On New Year's Day",
    "author": "",
    "description": "The temple towns of Ayodhya and Varanasi in Uttar Pradesh on Wednesday witnessed an unprecedented rush of devotees on the first day of the New Year.",
    "text": "Ayodhya, Varanasi Temples See Unprecedented Rush On New Year's Day According to local administration estimates, over two lakh devotees had already set up camps in Ayodhya on New Year Eve. On Wednesday morning, approximately three lakh more people arrived to pay homage to the deity of Ram Lalla. Read Time: 4 mins Share Twitter WhatsApp Facebook Reddit Email The Ram temple at Ayodhya was consecrated on January 22 last year. Ayodhya: The temple towns of Ayodhya and Varanasi in Uttar Pradesh on Wednesday witnessed an unprecedented rush of devotees on the first day of the New Year. The Ram temple at Ayodhya was consecrated on January 22 last year. According to local administration estimates, over two lakh devotees had already set up camps in Ayodhya on New Year Eve. On Wednesday morning, approximately three lakh more people arrived to pay homage to the deity of Ram Lalla. The eagerness of devotees was palpable as they lined up for 'darshan' of the idol which was unveiled at sunrise on the first day of the year. In Varanasi, a massive crowd of devotees thronged the sacred premises of Baba Shri Kashi Vishwanath temple from 3 am on Wednesday. The rush continued till late evening as part of New Year celebrations. The temple administration reported that by 4 pm, a whopping 3.5 lakh devotees had visited the temple to offer prayers and seek the blessings of Baba Shri Kashi Vishwanath. In a statement, Ram Temple Trust general secretary Champat Rai said the entire world is celebrating the New Year according to the Gregorian calendar. The winter season coupled with a holiday break contributed to the high number of visitors, he explained. With schools, courts and agricultural work closed for the season, he said \"people often take vacations during this time\". \"Increasingly, Ayodhya has become a prime destination for pilgrims instead of more traditional tourist spots like Goa, Nainital, Shimla or Mussoorie,\" Rai said. The Ayodhya administration divided the city into multiple sectors and zones to regulate the large crowds. Heavy police presence was deployed to manage the surging crowds. Traffic restrictions were imposed and round-the-clock vehicle inspections were conducted, local officials said. The increase in the number of devotees had begun a day earlier. By Tuesday evening, more than two lakh pilgrims had already completed 'darshan'. Hotels, dharamshalas and homestays were fully booked as both local and outstation visitors poured into the town. Similar scenes unfolded at the Hanumangarhi temple, where the crowds remained steady from the early morning 'aarti' until the 'shayan aarti' in the evening. To accommodate the massive influx, the administration had prepared 10 additional visitor galleries along the Ram Janmabhoomi path, expanding the number of darshan lines from 10 to 20. Special security measures were also enforced to ensure the safety of the devotees. Ayodhya Deputy Superintendent of Police Ashutosh Tiwari added that the city has been divided into seven security sectors and 24 zones, with senior officers deployed in each area. Drone cameras are used to monitor crowded locations and traffic movement was strictly controlled to avoid congestion and ensure public safety. In Varanasi, the Chief Executive Officer of Kashi Vishwanath Temple, Vishwa Bhushan Mishra, said the number of visitors has been rising steadily since December 28. On the occasion of New Year, temple authorities had anticipated the high influx and took steps to manage the situation efficiently. \"The crowd started gathering early in the morning and by 4 pm, we had already witnessed 3.5 lakh devotees. The numbers continue to rise and devotees are still queuing to seek darshan,\" said Mishra. In response to the overwhelming crowd, temple officials had imposed certain restrictions. To manage the large number of visitors, Baba's \"touch darshan\" was prohibited on both December 31 and January 1. Additionally, entry into the sanctum sanctorum was restricted and vehicles were banned from entering Maidagin to Godaulia road to ensure smooth movement of pilgrims. To ensure public safety and prevent any untoward incidents, the district police have been on high alert. DCP Kashi Zone, Gaurav Bansal, stated that extensive security measures were in place with five sectors created and 45 duty points established within the Kashi Vishwanath temple complex. Security personnel have also been deployed at key temples and ghats across the city, including the Baba Kaal Bhairav temple and Sankat Mochan temple, where 11 and 8 duty points respectively were set up. Special forces, including the National Disaster Response Force (NDRF), Water Police and Provincial Armed Constabulary (PAC) have been stationed at various ghats, anticipating a large crowd for the New Year celebrations. In case of emergencies, 12 quick reaction teams (QRTs) are on standby. The security arrangements and crowd control measures reflect the temple's efforts to ensure a safe and peaceful experience for the devotees visiting the Kashi Vishwanath temple on this special occasion, Bansal said. (Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.) Show full article Comments Track Latest News Live on NDTV.com and get news updates from India and around the world Follow us: Ram Temple , Ram Temple Aarti , Ram Temple Rush",
    "link": "https://www.ndtv.com/india-news/unprecedented-rush-of-devotees-at-ayodhya-varanasi-on-new-year-day-7378440",
    "published_date": "2025-01-01T19:52:36+05:30",
    "image_link": null
  }
]