[
  {
    "title": "How Manmohan Singh Became \"Accidental PM\" After Shock UPA Victory In 2004",
    "link": "https://www.ndtv.com/india-news/manmohan-singh-how-manmohan-singh-became-accidental-pm-after-shock-upa-victory-in-2004-7341407",
    "published": "Fri, 27 Dec 2024 10:44:00 +0530",
    "author": "",
    "summary": "Clad in his signature white kurta-pyjama and blue turban, Dr Manmohan Singh, then 71, took the oath of office as India's 14th Prime Minister on May 22, 2004.",
    "categories": [],
    "content": "<p>In his signature white kurta-pyjama and blue turban, <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/manmohan-singh-2-time-pm-and-architect-of-indias-economic-reforms-dies-at-92-7338451\" target=\"_blank\">Manmohan Singh</a>, then 71, took the oath of office as India's 14th Prime Minister on May 22, 2004. Members of <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/how-manmohan-singh-defended-landmark-1991-union-budget-7340414\" target=\"_blank\">Dr Singh</a>'s family, political allies, and predecessors - including Atal Bihari Vajpayee - looked on as a quiet and reserved leader assumed the reins of power at a ceremony conducted by then-President Dr APJ Abdul Kalam at the Rashtrapati Bhavan.</p>\n\n<p>Until the 2004 election results were announced, it was widely assumed that the incumbent NDA government led by Atal Bihari Vajpayee would secure a second term. The BJP's high-profile \"India Shining\" campaign dominated the airwaves. Political analysts and exit polls had overwhelmingly predicted a BJP-led victory. However, the Congress party, under Sonia Gandhi's leadership, spearheaded a comeback.</p>\n\n<p><strong>READ </strong>| <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/manmohan-singh-manmohan-singh-dies-at-92-people-say-i-was-when-manmohan-singh-defended-silent-pm-charge-7341010\" target=\"_blank\">\"People Say I Was...\": When Manmohan Singh Defended \"Silent PM\" Charge</a></p>\n\n<p>The Congress-led UPA coalition emerged victorious, securing enough support from regional allies to form the government. Sonia Gandhi, expected by many to assume the prime ministership, instead made a decision that surprised many: she stepped aside in favour of <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/world-news/how-manmohan-singh-laid-the-foreign-policy-foundation-pm-narendra-modi-built-upon-7340207\" target=\"_blank\">Manmohan Singh</a>, citing her \"inner voice\".</p>\n\n<p>Sonia Gandhi's Italian roots have been a contentious political issue since she entered active politics in 1998. In 2004, despite Congress's electoral success, the issue resurfaced when BJP leaders like Sushma Swaraj and Uma Bharti reignited the controversy. Ms Swaraj even threatened dramatic protests, including shaving her head, should Mrs Gandhi become Prime Minister.</p>\n\n<p><strong>READ </strong>| <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/video-manmohan-singhs-shayari-jugalbandi-with-sushma-swaraj-in-parliament-7340474\" target=\"_blank\">Manmohan Singh's Poetic Banter With Sushma Swaraj In Parliament</a></p>\n\n<p>Sonia Gandhi also faced resistance internally. In his autobiography, One Life Is Not Enough, former External Affairs minister and Congress leader Natwar Singh recounted a tense moment at Mrs Gandhi's residence, where Rahul Gandhi strongly urged his mother not to accept the position, citing his worries in light of the assassinations of his father, Rajiv Gandhi, and grandmother, Indira Gandhi.</p>\n\n<p>Mrs Gandhi's refusal to accept the top post paved the way for Manmohan Singh's ascent. As a soft-spoken technocrat with no mass political base, Dr Singh was an unlikely choice. A career economist who had served as Finance Minister in PV Narasimha Rao's government during the 1991 economic liberalisation, Dr Singh had earned respect in policy circles but lacked the typical attributes of a political leader. His lone attempt to contest a Lok Sabha seat, from South Delhi in 1999, ended in defeat, and Dr Singh remained a Rajya Sabha member throughout his political career.</p>\n\n<p><strong>READ </strong>| <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/world-news/world-leaders-pay-tributes-to-ex-pm-manmohan-singh-greatest-champion-7340836\">\"Greatest Champion\": World Leaders Pay Tributes To Ex-PM Manmohan Singh</a></p>\n\n<p>Despite being termed the \"Accidental Prime Minister,\" Dr Singh's decade-long tenure was marked by some great achievements. His government launched transformative programs like the Right to Information (RTI), the Mahatma Gandhi National Rural Employment Guarantee Act (MNREGA), and the Right to Education (RTE).</p>\n\n<p>Dr Singh's tenure, however, was not without controversies. In 2008, his government faced a confidence vote after the Left parties withdrew support over the Indo-US nuclear deal. Dr Singh staked his political capital on the agreement, arguing it was crucial for India's energy security. His government survived the trust vote by a narrow margin.</p>\n\n<p>The UPA lost power in 2014, with Narendra Modi's BJP securing a landslide victory. Dr Singh exited public life with characteristic grace, stating, \"I honestly believe history will be kinder to me than the contemporary media or for that matter, the Opposition parties in Parliament.\"</p>"
  },
  {
    "title": "Top Leaders Pay Tribute To Manmohan Singh, State Funeral Tomorrow: Updates",
    "link": "https://www.ndtv.com/india-news/live-updates-manmohan-singh-hospitalised-at-aiims-family-reaches-hospital-7338179",
    "published": "Fri, 27 Dec 2024 15:29:00 +0530",
    "author": "",
    "summary": "Manmohan Singh dies: Former Prime Minister Manmohan Singh died at Delhi's AIIMS hospital on Thursday. He was 92.",
    "categories": [],
    "content": "<p>Prime Minister Narendra Modi and Congress leaders Sonia Gandhi and Mallikarjun Kharge were among the top leaders who paid homage to former Prime Minister <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/manmohan-singh-former-pm-technocrat-and-reviver-of-indiaseconomy-7338543\" target=\"_blank\">Manmohan Singh</a> at his residence in the Capital on Friday.</p>\n\n<p>The Union Cabinet also condoled Singh's death and hailed him as an eminent statesman and a distinguished leader who left an imprint on national life. At a meeting chaired by Mr Modi, the Cabinet observed a two-minute silence in honour of the departed soul and adopted a Condolence Resolution in memory of Singh.</p>\n\n<p>Singh <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/manmohan-singh-2-time-pm-and-architect-of-indias-economic-reforms-dies-at-92-7338451\" target=\"_blank\">died at Delhi's AIIMS hospital</a> on Thursday. He was 92. His final journey will commence from the All India Congress Committee headquarters at 9:30am on Saturday.</p>\n\n<p>Leaders cutting across party lines also paid their last respects to the former prime minister in the presence of his wife Gursharan Kaur and other family members. Congress MP Rahul Gandhi said he \"<a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/i-lost-a-mentor-and-guide-rahul-gandhi-on-manmohan-singhs-death-7338741\" target=\"_blank\">lost a mentor and guide</a>\".&nbsp;</p>\n\n<p>Condolences also poured in from across the globe, including from the US, Canada, France and Sri Lanka.</p>"
  },
  {
    "title": "A Late Night Call That Catapulted Manmohan Singh Into Politics",
    "link": "https://www.ndtv.com/india-news/a-late-night-call-that-catapulted-manmohan-singh-into-politics-7341633",
    "published": "Fri, 27 Dec 2024 11:40:00 +0530",
    "author": "",
    "summary": "Manmohan Singh was woken up by an \"out of the blue\" call from PV Narasimha Rao's then principal secretary PC Alexander, who informed him that he was the pick to be the finance minister.",
    "categories": [],
    "content": "<p>Back from a conference in Netherlands, then University Grants Commission chairman <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/live-updates-manmohan-singh-hospitalised-at-aiims-family-reaches-hospital-7338179\">Dr Manmohan Singh</a> had called it a day when he received a call that would change India's economic landscape and his career trajectory.</p>\n\n<p>In 1991, when PV Narasimha Rao assumed the prime ministerial post, India battled a balance of payments crisis and political lows, while the world was rattled by the fall of the Soviet. At this time, Dr Singh was woken up by an \"out of the blue\" call from Mr Rao's then principal secretary PC Alexander, who informed him that he was the pick to be the finance minister.</p>\n\n<p>\"He also jokingly told me that if things worked well we would all claim credit, and if things didn't work out well I would be sacked,\" he said in the book 'Strictly Personal: Manmohan and Gursharan' written by his daughter Daman Singh. On June 21, 1991, Dr Singh was at the Rashtrapati Bhavan to take oath.</p>\n\n<p>The oath was the beginning of a sea change in India's economic landscape as liberalisation opened up India's economy to the world, albeit after as skeptical Mr Rao was persuaded by Dr Singh. \"I had to persuade him. I think he was a skeptic to begin with, but later on he was convinced that what we were doing was the right thing to do, that there was no other way out. But he wanted to sanctify the middle path - that we should undertake liberalisation but also take care of the marginalised sections, the poor,\" recounted Dr Singh, as per his daughter's book.</p>\n\n<p><strong>Also Read</strong> |&nbsp;<a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/when-manmohan-singh-reunited-with-his-childhood-friend-raja-mohammad-ali-from-pakistan-7341449\">When Manmohan Singh Reunited With His Childhood Friend From Pakistan</a></p>\n\n<p>Dr Singh went on to also free most industries from licensing controls, amended the Monopolies and Restrictive Trade Practices Act, put in place a new taxation regime and ended the public sector's monopoly in many sectors.</p>\n\n<p>Daman Singh's book traces the journey of the former prime minister and his wife Gursharan Kaur's life from the 1930s to 2004 and is based on Daman's conversations with her parents and hours spent in libraries and archives.&nbsp;</p>\n\n<p>The book's anecdotes come into focus after <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/manmohan-singh-2-time-pm-and-architect-of-indias-economic-reforms-dies-at-92-7338451#pfrom=home-ndtv_topscroll\">Dr Singh died on Thursday</a> night at AIIMS Delhi at the age of 92.</p>"
  },
  {
    "title": "\"Knew My Limits...\": What Sonia Gandhi Said About Making Manmohan Singh PM",
    "link": "https://www.ndtv.com/india-news/manmohan-singh-death-sonia-gandhi-knew-my-limits-what-sonia-gandhi-said-about-making-manmohan-singh-pm-7343045",
    "published": "Fri, 27 Dec 2024 15:33:00 +0530",
    "author": "",
    "summary": "In 2014 Sonia Gandhi had said she chose Manmohan Singh to be Prime Minister of the Congress-led UPA that had won the 2009 election because she thought he would be the better choice.",
    "categories": [],
    "content": "<p>In May 2004 Congress leader <a class=\"sp_lnk2\" href=\"http://www.ndtv.com/topic/manmohan-singh\" target=\"_blank\">Manmohan Singh</a> was sworn in as Prime Minister - a position he would hold for the next decade - but the soft-spoken and erudite economist, who made headlines steering the nation through the 1991 economic reforms as Finance Minister, was a pick straight out of left field, a surprise nomination for a post many believed had <a class=\"sp_lnk2\" href=\"http://www.ndtv.com/topic/sonia-gandhi\" target=\"_blank\">Sonia Gandhi</a>'s name all over it.</p>\n\n<p>Mrs Gandhi, though, had other ideas, though she kept quiet about them for the next 14 years. In March 2014, at an event in Mumbai, the veteran Congress leader finally opened up.</p>\n\n<p>\"I knew my limitations... I knew Manmohan Singh would be a better Prime Minister...\"</p>\n\n<p>Sure, there were many questions.</p>\n\n<p>Did condemnation of Mrs Gandhi's Italian heritage give her pause from taking the job? Would Dr Singh have become Prime Minister if Rajiv Gandhi was not assassinated in 1991? Did appeals by her children, understandably worried by the prospect of a mother ascending to a post that had claimed their father and grandmother, sway her? Was there dissent within the Congress' ranks?</p>\n\n<p><strong>READ |&nbsp;</strong><a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/manmohan-singh-how-manmohan-singh-became-accidental-pm-after-shock-upa-victory-in-2004-7341407\" target=\"_blank\">How Manmohan Singh Was 'Accidental PM' After UPA's Shock 2004 Win</a></p>\n\n<p>But Mrs Gandhi waved these aside, trusting her \"inner voice\" and Manmohan Singh.</p>\n\n<p>Dr Singh's time as Prime Minister was marked by successes and scandals, and an avalanche of criticism from detractors, led by the Bharatiya Janata Party. And among the most oft-used bullet in those attacks was the charge that Manmohan Singh, then 71 years old, was a 'puppet' Prime Minister.</p>\n\n<p>The Congress stalwart would always refuse to be drawn on those jabs, gently brushing aside criticism and questions to focus on what mattered most to him - the country and its people.</p>\n\n<p><strong>READ |&nbsp;</strong><a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/not-health-manmohan-singh-asked-this-after-10-hour-heart-surgery-7341694#pfrom=home-ndtv_topscroll\" target=\"_blank\">Not Health, Manmohan Singh Asked About This After Heart Surgery</a></p>\n\n<p>But the legacy Dr Singh left behind - from laying a strong foundation for the economy to securing the India-United States nuclear deal, and from enacting rural jobs schemes to the Right to Education Act for children - gave his successor, Prime Minister Narendra Modi, an enviable platform from which to build.</p>\n\n<p><strong>READ |&nbsp;</strong><a class=\"sp_lnk2\" href=\"https://www.ndtv.com/world-news/how-manmohan-singh-laid-the-foreign-policy-foundation-pm-narendra-modi-built-upon-7340207\" target=\"_blank\">How Manmohan Singh Laid Foreign Policy Base PM Modi Built Upon</a></p>\n\n<p>And yet, his legacy will also include the many jabs and barbs, including 'silent PM', 'reluctant PM', and 'accidental PM', tossed at him from rival politicians, none of which seemed - at least publicly, for what confidences he may have shared with his wife, we may never know - to faze Dr Singh.</p>\n\n<p><strong>READ |&nbsp;</strong><a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/manmohan-singh-manmohan-singh-dies-at-92-people-say-i-was-when-manmohan-singh-defended-silent-pm-charge-7341010\" target=\"_blank\">\"People Say I Was...\": Manmohan Singh Defends 'Silent PM' Charge</a></p>\n\n<p>For he himself preferred to leave judgement of his career to the annals of history. In 2014 he said, in his typical dry but sharp humour, \"I honestly believe that history will be kinder to me than the contemporary media, or for that matter, the opposition parties in Parliament.\"</p>\n\n<p>And today, 92 years later, history will have the chance to do just that.</p>\n\n<p>For <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/live-updates-manmohan-singh-hospitalised-at-aiims-family-reaches-hospital-7338179\" target=\"_blank\">Dr Manmohan Singh died late Thursday</a> at Delhi's All India Institute of Medical Sciences.</p>\n\n<p>News of Dr Singh's death was met with an outpouring of grief, not just from within the Congress - party boss Mallikarjun Kharge and senior leaders Rahul Gandhi and Priyanka Gandhi Vadra posted heartfelt tributes - but also across parties, including from the BJP.</p>\n\n<p>Prime Minister Narendra Modi - who, in February this year, hailed Dr Singh as an \"inspiration to lawmakers\" as he retired from the Rajya Sabha - mourned his loss, and paid his final respects to his predecessor at his Delhi residence this morning.</p>\n\n<p><strong>READ |&nbsp;</strong><a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/manmohan-singhs-contribution-to-india-will-always-be-remembered-pm-modi-7341599\" target=\"_blank\">\"Epitome Of Simplicity\": PM's Video Tribute To Manmohan Singh</a></p>\n\n<p>Dr Singh's death has also been felt across the world, with former heads of state, particularly his contemporaries, such as former United States President Barack Obama and ex-Germany Chancellor Angela Merkel, remembering him as a scholar and a gentleman.</p>\n\n<p><em>NDTV is now available on WhatsApp channels. <a href=\"https://www.whatsapp.com/channel/0029Va4lixw7z4kcvZI9JM12\">Click on the link</a> to get all the latest updates from NDTV on your chat. </em></p>"
  },
  {
    "title": "Manmohan Singh's \"Best Moment\" And \"Biggest Regret\" As Prime Minister",
    "link": "https://www.ndtv.com/india-news/manmohan-singhs-best-moment-and-biggest-regret-as-prime-minister-7342609",
    "published": "Fri, 27 Dec 2024 14:09:00 +0530",
    "author": "",
    "summary": "Manmohan Singh, who held office from 2004 to 2014, died at the age of 92 on Thursday.",
    "categories": [],
    "content": "<p>Striking a civil nuclear deal with the United States and not being able to do more in the area of healthcare were the \"best moment\" and \"biggest regret\", respectively, during his tenure, <a class=\"sp_lnk2\" href=\"http://www.ndtv.com/india-news/manmohan-singh-former-pm-technocrat-and-reviver-of-indiaseconomy-7338543#pfrom=home-ndtv_topscroll\" target=\"_blank\">Manmohan Singh</a>, who died Thursday at 92, said in his last press conference as the prime minister in 2014.</p>\n\n<p>Dr Singh held office from 2004 to 2014 and was known as one of the architects of economic reforms in 1991 that pulled India from the brink of bankruptcy.</p>\n\n<p>In his last press conference as Prime Minister on January 3, 2014, Dr Singh was asked about his \"best moment\" and \"biggest regret\" as prime minister.</p>\n\n<p>\"I will need time to reflect on this. But certainly, the best moment for me was when we were able to strike a nuclear deal with the United States to end the nuclear apartheid which had sought to stifle the processes of social and economic change, and technical progress of our country in many ways,\" he responded to the former question.&nbsp;</p>\n\n<p>Under the leadership of Dr Singh and the then US President George W Bush, India and the US in 2005 announced that they would cooperate in <a class=\"sp_lnk2\" href=\"http://www.ndtv.com/india-news/crowning-glory-of-manmohan-singhs-prime-ministership-india-us-civil-nuclear-deal-7338960\" target=\"_blank\">civil nuclear energy</a>.&nbsp;</p>\n\n<p>Following a series of negotiations, the International Atomic Energy Agency (IAEA), which is a United Nations agency that promotes the peaceful use of nuclear energy and technology, approved the safeguards agreement with India in August 2008, following which the US approached the Nuclear Suppliers Group (NSG) to grant a waiver to New Delhi to commence civilian nuclear trade.</p>\n\n<p><strong>ALSO READ |&nbsp;<a href=\"https://www.ndtv.com/world-news/how-manmohan-singh-laid-the-foreign-policy-foundation-pm-narendra-modi-built-upon-7340207\" target=\"_blank\">How Manmohan Singh Laid The Foreign Policy Foundation PM Modi Built Upon</a></strong></p>\n\n<p>The NSG then granted the waiver to India on September 6, 2008, allowing it to access civilian nuclear technology and fuel from other countries.</p>\n\n<h3><strong>Manmohan Singh On His \"Biggest Regret\" As PM</strong></h3>\n\n<p>Asked about the \"biggest regret\" in his tenure of 10 years, <a class=\"sp_lnk2\" href=\"http://www.ndtv.com/india-news/not-health-manmohan-singh-asked-this-after-10-hour-heart-surgery-7341694#pfrom=home-ndtv_topscroll\" target=\"_blank\">Manmohan Singh</a> said he would have liked to do \"a lot more\" in the area of healthcare.&nbsp;</p>\n\n<p>\"I am sorry. I haven't thought through this matter. But certainly, I would like to do a lot more in the area of healthcare, healthcare for children, and healthcare for women. The National Rural Health Mission that we started has achieved impressive results but a lot more needs to be done,\" he said.</p>\n\n<p>Dr Singh-led government launched the National Rural Health Mission (NRHM) in April 2005 to improve access to affordable and quality healthcare for people in rural areas, especially the poor, women, and children.</p>\n\n<h3><strong>\"History Will Be Kinder To Me\"</strong></h3>\n\n<p>In that press conference, <a class=\"sp_lnk2\" href=\"http://www.ndtv.com/india-news/history-will-be-kinder-to-me-dr-manmohan-singhs-last-press-meet-as-pm-7338824\" target=\"_blank\">Manmohan Singh</a> was asked by NDTV's Sunil Prabhu about allegations that he failed to check corruption on his watch.</p>\n\n<p>Responding to this, Dr Singh had said with a smile, \"I honestly believe history will be kinder to me than the contemporary media or for that matter, the Opposition parties in Parliament.\"</p>\n\n<p>\"I cannot divulge all the things that take place in the cabinet system of government. I think taking into account the circumstances and the compulsions of a coalition polity, I have done as best as I could do under the circumstances,\" he added.</p>\n\n<p><strong>ALSO READ |&nbsp;<a href=\"https://www.ndtv.com/india-news/manmohan-singh-how-manmohan-singh-became-accidental-pm-after-shock-upa-victory-in-2004-7341407#pfrom=home-ndtv_topscroll\" target=\"_blank\">How Manmohan Singh Became \"Accidental PM\" After Shock UPA Victory In 2004</a></strong></p>\n\n<p>At the time, the United Progressive Alliance-II government was reeling under allegations of corruption in several of its ministries, a key reason behind the Congress's rout in the 2014 general election and the Narendra Modi-led BJP's ascent to power.</p>\n\n<h3><strong>\"Never Felt Like Resigning\"</strong></h3>\n\n<p>At the press conference, <a class=\"sp_lnk2\" href=\"http://www.ndtv.com/india-news/a-late-night-call-that-catapulted-manmohan-singh-into-politics-7341633#pfrom=home-ndtv_topscroll\" target=\"_blank\">Manmohan Singh</a> was asked if he ever felt like \"resigning\" at any point during his tenure of 10 years.</p>\n\n<p>\"I have never felt like resigning at any time. I have enjoyed doing my work. I have tried to do my work with all honesty, with all sense of integrity, without regard, or fear or favour,\" he had said.</p>\n\n<p>The Congress leader was also asked if the scandals such as Commonwealth and 2G have cost his government a \"great deal\".</p>\n\n<p>\"When you look back, do you feel there is something you should have done differently, and what would it be,\" Dr Singh was questioned.</p>\n\n<p>He said he felt \"somewhat sad\" because he was the one who insisted that spectrum allocation should be \"transparent, fair and equitable\".</p>\n\n<p>\"I was the one who insisted that coal blocks should be allocated on the basis of auctions. These facts are forgotten. The Opposition has a vested interest. Sometimes the media play into their hands as well, and therefore, I have every reason to believe, that when history is written of this period, we will come out unscathed. This is not to say that there was no irregularity. There were irregularities. But the dimensions of the problems have been overstated by the media, by the CAG sometimes, and by other entities,\" he said.</p>"
  },
  {
    "title": "Not Health, Manmohan Singh Asked About This After 10-Hour Heart Surgery",
    "link": "https://www.ndtv.com/india-news/not-health-manmohan-singh-asked-this-after-10-hour-heart-surgery-7341694",
    "published": "Fri, 27 Dec 2024 14:07:00 +0530",
    "author": "",
    "summary": "Former Prime Minister Manmohan Singh's first words after undergoing heart surgery in 2009 were not about his health, but the country, Dr Ramakant Panda, the senior cardiac surgeon who treated Dr Singh told NDTV.",
    "categories": [],
    "content": "<p>Former Prime Minister Manmohan Singh's first words after undergoing heart surgery in 2009 were not about his health, but the country, Dr Ramakant Panda, the senior cardiac surgeon who treated Dr Singh told NDTV. Dr Singh, who was the PM at that time, had undergone a 10 to 11 hours long critical coronary bypass surgery at All India Institute Of Medical Sciences (AIIMS), Delhi.</p>\n\n<p>\"After we finished his heart surgery...at night when we took out the first breathing pipe when the person can speak...The first thing he asked me was \"how is my country? how is Kashmir\". I said but you did not ask me anything about your surgery. To which <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/live-updates-manmohan-singh-hospitalised-at-aiims-family-reaches-hospital-7338179\" target=\"_blank\">Dr Singh</a> said that he knew I would do a good job,\" Dr Panda said.</p>\n\n<p>\"I'm not worried about the surgery. I'm more worried about my country,\" the former PM told Dr Panda.</p>\n\n<p>The senior cardiac surgeon further emphasised, \"He was a great human being, a humble person, and a patriot. As a doctor, he is the ideal patient I can think of.\"</p>\n\n<p><strong>Also Read |&nbsp;<a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/manmohan-singh-how-manmohan-singh-became-accidental-pm-after-shock-upa-victory-in-2004-7341407\" target=\"_blank\">How Manmohan Singh Became \"Accidental PM\" After Shock UPA Victory In 2004</a></strong></p>\n\n<p>According to Dr Panda, patients often complain of chest pain after such surgeries. \"...But he never even once asked or complained about anything. That was the sign of a strong human being. Every time he used to come for post-surgery check-ups, we went to the hospital's gate to receive him. But he always told us not to,\" Dr Panda said.</p>\n\n<p>\"At a personal level, I know he was a man of very strong integrity. He had a very steady reserve. If he said something he will do, he will do it. You cannot change his mind,\" he added.</p>\n\n<p><a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/national-mourning-for-7-days-to-honour-manmohan-singh-sources-7338892\" target=\"_blank\">Dr Manmohan Singh died</a> on Thursday night at the age of 92 due to age-related medical complications. He had been in poor health for the last few months. Known as the 'architect of India's economic reforms', Dr Singh was the PM for two terms in the Congress-led United Progressive Alliance government from 2004 to 2014.</p>\n\n<p>The former Prime Minister's last rites will be conducted with full state honours. A seven-day state mourning will be observed throughout the country as a mark of respect to Dr Singh. During this period, the national flag will be flown at half-mast across India. Additionally, all government programs scheduled for Friday will be cancelled.</p>"
  },
  {
    "title": "\"Slightly Awkward Politician But...\": Malaysian PM On Manmohan Singh",
    "link": "https://www.ndtv.com/world-news/goodbye-my-mitra-my-bhai-malaysia-prime-minister-anwar-ibrahims-tribute-to-manmohan-singh-7343004",
    "published": "Fri, 27 Dec 2024 15:05:00 +0530",
    "author": "",
    "summary": "Malaysia Prime Minister Anwar Ibrahim paid tributes to his \"true friend\" Dr Manmohan Singh, former two-time Prime Minister who died at the age of 92.",
    "categories": [],
    "content": "<p>Malaysia Prime Minister Anwar Ibrahim paid tributes to his \"true friend\" Dr Manmohan Singh, former two-time Prime Minister who died at the age of 92. Calling Dr Singh the \"midwife of India's emergence\", Mr Ibrahim said the praise that is poured upon the former PM is \"truly well-deserved\".</p>\n\n<p>\"The weight of grief bears down on me at the news of the passing of my honoured and cherished friend: <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/live-updates-manmohan-singh-hospitalised-at-aiims-family-reaches-hospital-7338179\" target=\"_blank\">Dr Manmohan Singh</a>. Obituaries, essays and books a plenty there will surely be about this great man, celebrating him as the architect of India's economic reforms. As Prime Minister, Dr Manmohan Singh was the midwife of India's emergence as one of the world's economic giants,\" Mr Ibrahim wrote in a post on X.</p>\n\n<p>According to Mr Ibrahim, Dr Singh was \"slightly awkward\" as a politician but \"undeniably upright, steadfast and resolute\" as a statesman.</p>\n\n<p><strong>Also Read |&nbsp;<a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/not-health-manmohan-singh-asked-this-after-10-hour-heart-surgery-7341694\" target=\"_blank\">Not Health, Manmohan Singh Asked About This After 10-Hour Heart Surgery</a></strong></p>\n\n<p>He also shared <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/manmohan-singh-how-manmohan-singh-became-accidental-pm-after-shock-upa-victory-in-2004-7341407\" target=\"_blank\">Dr Singh</a>'s 'act of kindness' towards him during his incarceration years.</p>\n\n<p>\"Not many people know this, and it is time that I share it with Malaysians: during the years of my incarceration, he extended a kindness that he didn't have to - one that was neither politically expedient nor, as one can imagine, appreciated by the Malaysian government at that time. Yet, true to his character, he did it anyway. He offered scholarships for my children, particularly my son, Ihsan. Although I had declined the gracious offer, such a gesture undoubtedly showed his extraordinary humanity and generosity, demonstrative, as the Bard would have it, of a man so full of \"the milk of human kindness\",\" he said.</p>\n\n<p>\"In those dark days, as I navigated the labyrinth of imprisonment, he stood by me as a true friend. Such acts of quiet magnanimity defined him, and they will remain etched in my heart forever. Goodbye, my mitra, my bhai, Manmohan,\" the Malaysian PM added.</p>\n\n<p><strong>Also Read |&nbsp;<a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/the-story-behind-manmohan-singh-s-signature-blue-turban-7341889\" target=\"_blank\">Why Manmohan Singh Always Wore A Blue Turban</a></strong></p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">The weight of grief bears down on me at the news of the passing of my honoured and cherished friend: Dr Manmohan Singh.<br />\n<br />\nObituaries, essays and books a plenty there will surely be about this great man, celebrating him as the architect of India's economic reforms. As Prime… <a href=\"https://t.co/44bA3s7vst\">pic.twitter.com/44bA3s7vst</a></p>\n— Anwar Ibrahim (@anwaribrahim) <a href=\"https://twitter.com/anwaribrahim/status/1872490947105431845?ref_src=twsrc%5Etfw\">December 27, 2024</a></blockquote>\n\n\n<p>Manmohan Singh died due to age-related medical complications. He had been in poor health for the last few months. His remains will be brought to his residence in Delhi for the public to offer their condolences. The funeral will be held at 9:30 am on Saturday. The former Prime Minister's last rites will be conducted with full state honours. A seven-day state mourning will be observed throughout the country as a mark of respect to Dr Singh. During this period, the national flag will be flown at half-mast across India.</p>"
  },
  {
    "title": "Injured North Korean Soldier, Captured By Ukraine During War, Dies",
    "link": "https://www.ndtv.com/world-news/injured-north-korean-soldier-captured-by-ukraine-during-war-dies-7343137",
    "published": "Fri, 27 Dec 2024 14:49:00 +0530",
    "author": "",
    "summary": "A North Korean soldier who was captured while fighting in Russia's war against Ukraine has died of his wounds, South Korea's spy agency said on Friday.",
    "categories": [],
    "content": "<p>A North Korean soldier who was captured while fighting in Russia's war against Ukraine has died of his wounds, South Korea's spy agency said on Friday.&nbsp;</p>\n\n<p>Pyongyang has deployed thousands of troops to reinforce Russia's military, including in the Kursk border region where Ukraine mounted a shock border incursion in August.</p>\n\n<p>One of those North Korean soldiers was captured alive by the Ukrainian army on Thursday, a South Korean intelligence source told AFP, adding that the location where he was seized was not known.</p>\n\n<p>Hours later, Seoul's National Intelligence Service (NIS) said that the soldier had succumbed to his wounds.&nbsp;</p>\n\n<p>\"It has been confirmed through an allied intelligence agency that the North Korean soldier captured alive on December 26th has just passed away due to worsening wounds,\" the South's spy agency said in a statement.&nbsp;</p>\n\n<p>Friday's confirmation came days after Ukrainian President Volodymyr Zelensky said that nearly 3,000 North Korean soldiers had been \"killed or wounded\" so far as they joined Russian troops in combat.</p>\n\n<p>South Korea's intelligence service had previously put the number of killed or wounded North Koreans at 1,000, saying the high casualty rate could be down to an unfamiliar battlefield environment and their lack of capability to counter drone attacks.</p>\n\n<p>Pyongyang's soldiers were also being \"utilised as expendable frontline assault units\", lawmaker Lee Seong-kweun said, speaking last week after a briefing by South Korea's spy agency.</p>\n\n<h3><strong>'Dangerous expansion'</strong></h3>\n\n<p>North Korea and Russia have strengthened their military ties since Moscow's invasion of Ukraine in February 2022.&nbsp;</p>\n\n<p>A landmark defence pact between Pyongyang and Moscow signed in June came into force this month, with Russian President Vladimir Putin hailing it as a \"breakthrough document\".</p>\n\n<p>North Korean state media said Friday that Putin sent a New Year's message to North Korean leader Kim Jong Un, saying \"the bilateral ties between our two countries have been elevated after our talks in June in Pyongyang\".</p>\n\n<p>Ukraine's allies have called Pyongyang's growing involvement in Russia's war in Ukraine a \"dangerous expansion\" of the conflict.</p>\n\n<p>Seoul's military believes that North Korea was seeking to modernise its conventional warfare capabilities through combat experience gained in the Russia-Ukraine war.</p>\n\n<p>NATO chief Mark Rutte had also said that Moscow was providing support to Pyongyang's missile and nuclear programmes in exchange for the troops.</p>\n\n<p>South Korea's Joint Chiefs of Staff (JCS) said Monday that Pyongyang is reportedly \"preparing for the rotation or additional deployment of soldiers\" and supplying \"240mm rocket launchers and 170mm self-propelled artillery\" to the Russian army.</p>\n\n<p>Pyongyang's involvement in Russia's war against Ukraine had prompted warnings from Seoul.&nbsp;</p>\n\n<p>South Korea's President Yoon Suk Yeol, currently suspended, said in November that Seoul was \"not ruling out the possibility of providing weapons\" to Ukraine, which would mark a major shift to a long-standing policy barring the sale of weapons to countries in active conflict.</p><p><i>(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)</i></p>"
  },
  {
    "title": "\"If You Don't Let Me Talk...\": Manjrekar, Irfan In Heated Debate On Live TV",
    "link": "https://sports.ndtv.com/australia-vs-india-2024-25/virat-kohli-yashasvi-jaiswal-mix-up-sanjay-manjrekar-irfan-pathan-engage-in-heated-argument-on-live-tv-7342404",
    "published": "Fri, 27 Dec 2024 13:18:00 +0530",
    "author": "",
    "summary": "Irfan Pathan and Sanjay Manjrekar had a heated argument on live TV while discussing Virat Kohli's role in Yashasvi Jaiswal's run-out on Day 2 of the 4th Test between India and Australia.",
    "categories": [],
    "content": "<p>India seemed to have clawed their way back on Day 4 of the 4th Test against Australia as <a href=\"https://sports.ndtv.com/cricket/players/112646-yashasvi-jaiswal-playerprofile\" title=\"Yashasvi Jaiswal\">Yashasvi Jaiswal</a> and <a href=\"https://sports.ndtv.com/cricket/players/967-virat-kohli-playerprofile\" title=\"Virat Kohli\">Virat Kohli</a> scripted a beautiful partnership of 102 runs for the third wicket. However, a horrible mix-up between Jaiswal and Kohli cost the former his wicket. While there remain different theories over who should be blamed for Jaiswal's dismissal, former India cricketers <a href=\"https://sports.ndtv.com/cricket/players/41124-sanjay-vijay-manjrekar-playerprofile\" title=\"Sanjay Manjrekar\">Sanjay Manjrekar</a> and <a href=\"https://sports.ndtv.com/cricket/players/607-irfan-pathan-playerprofile\" title=\"Irfan Pathan\">Irfan Pathan</a> got engaged in a heated argument in the post-day show for the broadcaster Star Sports.</p>\n\n<p>Manjrekar felt that Kohli should've responded to Jaiswal's call and taken the single as it was the latter who was running at the danger end. Pathan, however, disagreed, saying Kohli was also at the risk of getting run-out at the striker's end as the shot hit from Jaiswal was quite hard.</p>\n\n<p>\"Ball was going slow, I don't think Kohli would've been runout. It was Jaiswal's call. Maybe a risky run but he was at the danger end, not Kohli. It was a schoolboy error from Virat that he looked back and decided it wasn't a run. If it was a bad call from Jaiswal, he would've gotten out at the non-striker's end,\" Manjrekar said.</p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"in\">Lafda between Irfan and Sanjay Manjrekar <a href=\"https://t.co/F2huaodmBn\">pic.twitter.com/F2huaodmBn</a></p>\n— Pushkar (@Musafirr_hu_yar) <a href=\"https://twitter.com/Musafirr_hu_yar/status/1872543107272806770?ref_src=twsrc%5Etfw\">December 27, 2024</a></blockquote>\n\n\n<p>Irfan, on the other hand, countered Manjrekar's version, saying Kohli probably wans't confident taking the run as he saw how fast the ball went to the fielder, <a href=\"https://sports.ndtv.com/cricket/players/1656-pat-cummins-playerprofile\" title=\"Pat Cummins\">Pat Cummins</a>. The former India all-rounder also maintained that as a non-striker, Virat also has the right to turn down a run if he feels it is risky.</p>\n\n<p>The two former cricketers even overlapped each other at times, prompting Manjrekar to even say: \"If you don't want to let me talk, it's alright\".</p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"in\">Heated Argument Between Sanjay Manjrekar And Irfan Pathan, Sanjay Manjrekar Was Defaming Virat Kohli While Irfan Pathan Was Defending Virat Kohli ( On Yashasvi Jaiswal Run Out)<a href=\"https://twitter.com/hashtag/INDvsAUS?src=hash&amp;ref_src=twsrc%5Etfw\">#INDvsAUS</a> <a href=\"https://twitter.com/hashtag/ViratKohli?src=hash&amp;ref_src=twsrc%5Etfw\">#ViratKohli</a> <a href=\"https://twitter.com/hashtag/YashasviJaiswal?src=hash&amp;ref_src=twsrc%5Etfw\">#YashasviJaiswal</a><a href=\"https://twitter.com/hashtag/AUSvINDIA?src=hash&amp;ref_src=twsrc%5Etfw\">#AUSvINDIA</a> <a href=\"https://t.co/8YmOcA8JyL\">pic.twitter.com/8YmOcA8JyL</a></p>\n— Harsh 17 (@harsh03443) <a href=\"https://twitter.com/harsh03443/status/1872543151350792605?ref_src=twsrc%5Etfw\">December 27, 2024</a></blockquote>\n\n\n<p>Manjrekar even lost his cool as Irfan continued to press his opinion. He said: \"Irfan Pathan's new interpretation of whether it is a run or not, should be added to the coaching manual.\"</p>\n\n<p>Later during the discussion, Manjrekar even attributed Kohli's dismissal to the 'guilt' he must have felt after playing a role in Jaiswal's dismissal.</p>\n\n<p>\"Kohli's dismissal probably also down to the guilt he had inside his heart over Jaiswal's run-out. He was leaving outside-off deliveries until then but lost his concentration after the run-out incident,\" he said.</p>"
  },
  {
    "title": "Video: BJP's Tamil Nadu Chief, K Annamalai, Whips Himself 6 Times",
    "link": "https://www.ndtv.com/south/bjp-tamil-nadu-chief-k-annamalai-whips-himself-video-7342059",
    "published": "Fri, 27 Dec 2024 12:22:00 +0530",
    "author": "",
    "summary": "Tamil Nadu BJP chief K Annamalai flogged himself six times Friday morning to begin a protest against the ruling DMK, over the Anna University incident and to ensure the party is defeated in the 2026 election.",
    "categories": [],
    "content": "<p>Tamil Nadu BJP chief <a class=\"sp_lnk2\" href=\"http://www.ndtv.com/topic/k-annamalai\" target=\"_blank\">K Annamalai</a> flogged himself six times Friday morning.</p>\n\n<p>In a shocking video shared by news agency ANI, Mr Annamalai stands, shirtless in a green lungi, with a large whip in his hand. To adoring shouts and slogans, he then whips himself six times, a seventh stopped by a supporter who runs in, dodges the whip, and hugs Mr Annamalai.</p>\n\n<p>Why the self-flagellation? Because the senior BJP leader vowed last evening to whip himself six times to kickstart a mega protest, which includes a 48-day fast and a promise to go barefeet, against the ruling DMK with the target of ensuring its defeat in the 2026 Assembly election.</p>\n\n<p>\"Anybody understanding Tamil culture will understand this (the self-flagellation). Flogging ourselves... punishing ourselves... it is part of this culture,\" he told reporters after the whipping.</p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\"><a href=\"https://twitter.com/hashtag/WATCH?src=hash&amp;ref_src=twsrc%5Etfw\">#WATCH</a> | Coimbatore | Tamil Nadu BJP president K Annamalai self-whips himself as a mark of protest to demand justice in the Anna University alleged sexual assault case. <a href=\"https://t.co/ZoEhSsoo1r\">pic.twitter.com/ZoEhSsoo1r</a></p>\n— ANI (@ANI) <a href=\"https://twitter.com/ANI/status/1872514843158462545?ref_src=twsrc%5Etfw\">December 27, 2024</a></blockquote>\n\n\n<p>\"This (his protest) is not against any person or thing... but against a continuous injustice that is happening in the state,\" Mr Annamalai told reporters, \"What happened at Anna University is only the tipping point. If you look at what has been happening over the last 3 years... the continuous injustice against the common people, against women and children, and the corruption...\"</p>\n\n<p>\"So, yesterday I announced that we have chosen to go (down this) path... which a lot of my forefathers walked on, flogging and whipping ourselves...\"</p>\n\n<p><strong>READ |&nbsp;</strong><a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/k-annamalai-tamil-nadu-bjp-no-footwear-anna-university-student-sexual-assault-wont-wear-footwear-till-tamil-nadu-bjp-chiefs-big-promise-for-2026-polls-7337332\" target=\"_blank\">\"Will Whip Myself...\": Tamil Nadu BJP Chief's Big Pre-Poll Promise</a></p>\n\n<p>Mr Annamalai's protests have been triggered by the horrific sexual assault this week of a student at Chennai's Anna University, and the thrashing of her male friend. A 37-year-old man, who ran a roadside food stall has been arrested. Police said Wednesday that he had confessed.</p>\n\n<p>The assault, however, has led to a predictable political spat between the DMK of Chief Minister MK Stalin and the BJP and the AIADMK, the main opposition parties, who were allies till September last year, when they fell apart after Mr Annamalai criticised the state party's icons.</p>\n\n<p>On Wednesday he ripped into the DMK government, declaring the state had become a \"breeding ground of unlawful activities\" and a \"haven for criminals\" under its administration.</p>\n\n<p><em><strong>With input from agencies</strong></em></p>\n\n<p><em>NDTV is now available on WhatsApp channels. <a href=\"https://www.whatsapp.com/channel/0029Va4lixw7z4kcvZI9JM12\">Click on the link</a> to get all the latest updates from NDTV on your chat. </em></p>"
  },
  {
    "title": "Opinion: Manmohan Singh: The Thinking Person's Politician",
    "link": "https://www.ndtv.com/opinion/manmohan-singh-the-thinking-persons-politician-by-manoj-k-jha-7343468",
    "published": "Fri, 27 Dec 2024 15:43:00 +0530",
    "author": "",
    "summary": "Dr Singhs contributions to the country are such that he and his legacy stand vindicated in the short period of a decade. When he said, amidst widespread bad-faith media criticism, that history would judge him kindly, he was right.",
    "categories": [],
    "content": "<div class=\"ins_instory_dv\">\n<div class=\"ins_instory_dv_cont\"><img alt=\"Latest and Breaking News on NDTV\" id=\"story_image_main\" src=\"https://c.ndtvimg.com/2024-12/2jsg7hio_manmohan-singh_625x300_27_December_24.jpeg\" title=\"Latest and Breaking News on NDTV\" /></div>\n</div>\n\n<p>I remember making an intervention in the Parliament in late 2018 on the issue of attack on federalism by the ruling party. &nbsp;After my speech, Dr Manmohan Singh walked up to me, held my hand and said: “You are a good addition to the house.\" That moment and the words of encouragement from a person of his stature meant the world to me. I never imagined someone of his calibre would extend such courtesy and grace to a new member from another party. It is this transparent and humble aspect of his personality that endeared him to his colleagues as well as fellow Indians. I am fortunate to have shared a professional tenure with Dr. Singh at two remarkable institutions: The University of Delhi and the Parliament of India.</p>\n\n<p>Dr Singh, who served as India's Prime Minister from 2004 to 2014, is widely respected as the architect of the country's economic reforms. Many low- and middle-income families remember how the reforms opened new avenues of upward mobility for them. Though the trajectory and gains of liberalisation, globalisation, and privatisation for the country are contested, such policies saw the country making rapid and sustained economic growth. As is usually the case, this growth did not percolate down to the people at the end of the line. Instead of redistribution of the largesse that accrued to the emerging middle classes, it led to wealth accumulation for a few and widening inequality.</p>\n\n<p>But Dr Singh could hardly be faulted for this. Our societies have historically favoured powerful groups to corner resources, preserve privileges, and limit social mobility. Not to forget the price that the advanced capitalist global north continues to extract from the countries of the global south as and when they demand even the slightest of cooperation and assistance to make up for centuries of super-exploitation.&nbsp;</p>\n\n<p>However, Dr Singh did his best under the circumstances while at the helm of the country's affairs. He introduced many welfare schemes like guaranteed rural employment and the Right to Education. Millions of people were pulled out of poverty during his tenure. This must also be remembered while talking about his tenure.</p>\n\n<h2><strong>Resilience Against Hardship</strong></h2>\n\n<p>Dr Singh's life story is one of resilience in the face of extreme personal and political challenges. A soft-spoken economist educated at Oxford and Cambridge, his early life was marked by crises, including the partition of India, which displaced his family. Yet, he reached the pinnacle of educational, professional, and political success through sheer grit and perseverance. One would be hard-pressed to find him mentioning, much less making political capital from his ‘hardship stories' in his long public life. Dr Singh's policies and governance often reflected his deep humanitarian concern for the well-being of the common people, which must have emanated from his struggle in his early life.</p>\n\n<p>Though some critics called him a \"silent PM\", his economic expertise and clean image earned him respect across party lines. Even today, he is remembered as one of India's most qualified Prime Ministers. His simple lifestyle and humble nature, quite different from other mainstream Indian politicians, endeared him to Indians across the spectrum. The educated middle class saw him a thinking person's politician who worked quietly for the country's development.</p>\n\n<p>Dr Singh made significant contributions to national integration by promoting “unity in diversity” through research and policymaking to ensure equal opportunities for all communities. He often spoke about how India's strength lies in its multicultural fabric.</p>\n\n<p>Being a scholar himself, Dr Singh supported the expansion of higher education. His government established many new institutions of higher education across India. He strongly believed in scientific temper and increased funding for research and development. He encouraged rational thinking and academic freedom in universities, making them centres of excellence and free thought. Many students have related stories of how Dr Singh confidently endured their protests while he visited their campuses. Not only that, he also personally made sure that the protesting students were not disciplined by the authorities.&nbsp;</p>\n\n<h2><b>Attention To Bihar</b></h2>\n\n<p>Dr Singh showed special attention to Bihar's development during his tenure as Prime Minister. He understood that Bihar, being in a historically underdeveloped region, needed extra support to catch up with other states. Under his leadership, the central government provided the state developmental packages worth thousands of crores. He was very close to our national president, who was the railway minister in his cabinet and paid special attention to Bihar. His government increased funding for Bihar's agriculture sector and started many rural development schemes. The MGNREGA scheme especially benefited the state's rural poor. His government focused particularly on improving Bihar's infrastructure.</p>\n\n<p>He supported the modernisation of Bihar's railways and approved several new rail projects. His government also allocated special funds for flood control in Bihar, as the state regularly faces flooding issues.</p>\n\n<p>Education was another priority. Under his leadership, Bihar saw the establishment of numerous higher education institutions, including those in professional fields such as engineering and management. He also supported the revival of the ancient Nalanda University, transforming it into an international centre of learning. Many Biharis remember him for understanding the state's issues and his efforts to solve them.</p>\n\n<p>Dr Singh's contributions to the country are such that he and his legacy stand vindicated in the short period of a decade. When he said, amidst widespread bad-faith media criticism, that history would judge him kindly, he was right. Those who smeared a decent, hardworking, honest, and kind leader of the people must now introspect on their irresponsible conduct.</p>\n\n<p><em>[Prof. Manoj Kumar Jha (Rashtriya Janata Dal) is a Member of Parliament in the Rajya Sabha.]</em></p>\n\n<p><strong>Disclaimer: These are the personal opinions of the author</strong></p>"
  },
  {
    "title": "Explained: Why Japan's Official PM's Residence Is Believed To Be \"Haunted\"",
    "link": "https://www.ndtv.com/world-news/explained-why-japans-official-pms-residence-is-believed-to-be-haunted-7343385",
    "published": "Fri, 27 Dec 2024 15:27:00 +0530",
    "author": "",
    "summary": "Japan's Prime Minister Shigeru Ishiba, elected in October, has expressed his intent to move into his official residence despite persistent rumours of the house being \"haunted\".",
    "categories": [],
    "content": "<p>Japan's Prime Minister Shigeru Ishiba, elected in October, has expressed his intent to move into his official residence despite persistent rumours of the house being \"haunted\".</p>\n\n<p>Originally constructed in 1929, the two-story, 5,183-square-metre stone and brick mansion was initially built as the Prime Minister's office. Its Art Deco design symbolised Japan's transition to modernism in the early 20th century. It was inspired by the architectural style of the Imperial Hotel, designed by American architect Frank Lloyd Wright. The Imperial Hotel, completed in 1923, famously withstood the Great Kanto Earthquake that devastated much of Tokyo.</p>\n\n<p>The building has been the site of numerous tumultuous events in Japanese political history. In 1932, then-Prime Minister Tsuyoshi Inukai was assassinated in the building by young naval officers during a coup attempt. This incident marked a dark turn in Japan's political trajectory towards militarism. Four years later, another military uprising occurred at the site. Then-Prime Minister Keisuke Okada narrowly escaped assassination by hiding in a closet, though five people were shot dead during the rebellion. A bullet hole above one of the entrance doors remains as a reminder of these events.</p>\n\n<p>After decades of wear, the building underwent renovations, completed in 2005. The Japanese government spent approximately 8.6 billion yen to restore the mansion to its former grandeur while modernising it into a livable space for prime ministers. The renovations included the restoration of intricate wood carvings and ornate rooms, as well as preserving its idiosyncratic stone owl carvings that stand guard outside the building.</p>\n\n<p>Since 2005, the residence has officially served as the Prime Minister's home.</p>\n\n<p>The Prime Minister's residence has long been associated with ghost stories. These rumours stem primarily from its violent history. Former Prime Minister Tsutomu Hata's wife, Yasuko Hata, recounted eerie experiences during her time at the residence in a 1996 memoir. She described feeling an \"eerie and oppressive presence\" and claimed that military officers' apparitions had been sighted in the garden during the night.</p>\n\n<p>Yoshiro Mori, another former prime minister, reportedly told Shinzo Abe that he had encountered ghosts in the residence. Despite these accounts, government officials have repeatedly dismissed the rumours. In 2013, during Shinzo Abe's second tenure as Prime Minister, the government issued a formal denial of any knowledge of hauntings after questions arose over Abe's decision not to reside in the mansion.</p>\n\n<p>Before the renovations were completed, an exorcism by a Shinto priest was reportedly conducted to cleanse the building of any lingering spirits.&nbsp;</p>\n\n<p>Shinzo Abe, Japan's longest-serving prime minister, chose not to return to the mansion during his second term from 2012 to 2020. Instead, he resided in his private home in Tokyo's Shibuya district. His decision was partially influenced by the mansion's reputation and its association with political instability. From 2006 to 2007, during his first tenure as Prime Minister, the mansion housed six premiers who each served for relatively short periods, averaging just over a year.</p>\n\n<p>Yoshihide Suga, Abe's successor, also opted against living in the residence.</p>\n\n<p>Fumio Kishida, who became Prime Minister in December 2021, broke this trend by moving into the mansion. When asked about the ghosts, Kishida responded dismissively, stating that he had not encountered any and had slept well through the night.&nbsp;<br />\n&nbsp;</p>"
  },
  {
    "title": "Who Was Simran Singh, Popular RJ Found Dead In Gurugram",
    "link": "https://www.ndtv.com/india-news/who-was-simran-singh-popular-rj-found-dead-in-gurugram-7341209",
    "published": "Fri, 27 Dec 2024 14:48:00 +0530",
    "author": "",
    "summary": "The 25-year-old, known to her fans as \"RJ Simran\" or \"Jammu Ki Dhadkan\" (Heartbeat of Jammu), reportedly died by suicide.",
    "categories": [],
    "content": "<p>Simran Singh, a popular radio jockey and Instagram influencer from Jammu, was <a class=\"sp_lnk2\" href=\"https://www.ndtv.com/india-news/simran-singh-popular-instagram-influencer-and-rj-found-dead-in-gurugram-7336718\" target=\"_blank\">found dead in her rented apartment</a> in Gurugram. The 25-year-old, known to her fans as \"RJ Simran\" or \"<em>Jammu Ki Dhadkan</em>\" (Heartbeat of Jammu), reportedly died by suicide.</p>\n\n<p>Her body was discovered by a friend who immediately informed the police. She was taken to a nearby hospital, where doctors pronounced her dead. No suicide note was found at the scene, and her family has not filed a formal complaint.</p>\n\n<p>Speaking to the police, her family said Ms Singh was visibly upset for some time and believed that might have contributed to her decision. They clarified she did not hold anyone responsible for her actions.</p>\n\n<h3><strong>Who was RJ Simran?</strong></h3>\n\n<p>Simran Singh was a freelance radio jockey with a substantial online presence, with over 7 lakh followers on Instagram.</p>\n\n<p>Her <a href=\"https://www.instagram.com/p/DDhIYXAyJCx/?hl=en\" rel=\"nofollow,noindex\" target=\"_blank\">last post</a>, a reel shared on December 13, carried the caption, “Just a girl with endless giggles and her gown, taking over the beach.”</p>\n\n<p>Simran Singh had a deep love for travel -- evident from her Instagram profile. In September, she visited Thailand and shared snippets of her adventures.&nbsp;</p>\n\n<p>In <a href=\"https://www.instagram.com/p/C_sd0ECT8K_/?hl=en\" rel=\"nofollow,noindex\" target=\"_blank\">one viral video</a>, Ms Singh and her friend asked a parasailing instructor to let them parasail despite the late hour. When the instructor refused, Ms Singh playfully said, “It's okay, if I die, throw me in the water.” The instructor laughed and replied, “Two beautiful girls cannot die.”</p>\n\n<p>Simran Singh loved adventure sports and went <a href=\"https://www.instagram.com/p/C3P09jjxjtc/?hl=en\" rel=\"nofollow,noindex\" target=\"_blank\">skydiving in Dubai</a>, as seen in one of her videos. She also experienced the <a href=\"http:// https://www.instagram.com/p/C26mKmXxi0F/?hl=en\" rel=\"nofollow,noindex\" target=\"_blank\">thrill of supercars</a> in Dubai's Yas Island.</p>\n\n<p>Ms Singh loved animals and had a <a href=\"http:// https://www.instagram.com/p/C2xJBDJx-kx/?hl=en&amp;img_index=3\" rel=\"nofollow,noindex\" target=\"_blank\">golden retriever dog</a> named Scooter.</p><p><div class=\"table-div suicide\"><table class=\"table\"><thead><tr><th colspan=\"2\">Helplines</th></tr></thead><tbody><tr><td>Vandrevala Foundation for Mental Health</td><td><a href=\"\">9999666555</a> or <a href=\"mailto:help@vandrevalafoundation.com\">help@vandrevalafoundation.com</a> </td></tr><tr><td>TISS iCall</td><td><a href=\"\">022-25521111</a> (Monday-Saturday: 8 am to 10 pm)</td></tr> <tr><td colspan=\"2\">(If you need support or know someone who does, please reach out to your nearest mental health specialist.)</td></tr></tbody></table></div></p>"
  },
  {
    "title": "US CEO Asks If Foreigners Taking Jobs Away From Americans, Elon Musk Responds",
    "link": "https://www.ndtv.com/world-news/ceo-asks-if-foreign-born-workers-are-taking-jobs-away-from-americans-elon-musk-responds-7341174",
    "published": "Fri, 27 Dec 2024 12:53:00 +0530",
    "author": "",
    "summary": "Tesla CEO Elon Musk has weighed in on the ongoing debate about foreign-born tech workers currently employed in the United States and their impact on the job market for Americans.",
    "categories": [],
    "content": "<p>Tesla CEO Elon Musk has weighed in on the ongoing debate about foreign-born tech workers currently employed in the United States and their impact on the job market for Americans. His comments came in response to a query posed by Amjad Masad, the CEO of Replit, a platform for coding enthusiasts.</p>\n\n<p>Masad expressed scepticism about claims that foreign workers are edging out qualified Americans in the tech sector. He wrote on X, \"Genuinely curious: Are there actual instances where qualified native-born Americans couldn't get jobs in tech because foreigners took all of them? I'd be surprised if it's true because at any given point there are hundreds of thousands of unfilled jobs in tech.\"</p>\n\n<p>Musk, who is of South African origin, responded to Masad's query, emphasising the ongoing scarcity of top-tier engineering professionals in the United States. He replied, \"There is a permanent shortage of excellent engineering talent. It is the fundamental limiting factor in Silicon Valley.\"</p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">There is a permanent shortage of excellent engineering talent. It is the fundamental limiting factor in Silicon Valley.</p>\n— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1871956518213656728?ref_src=twsrc%5Etfw\">December 25, 2024</a></blockquote>\n\n\n<p>This conversation came amid heightened discussions about the role of foreign workers, particularly in light of President-elect Donald Trump's appointment of Indian-American Sriram Krishnan as a senior policy advisor on artificial intelligence.</p>\n\n<p>The move sparked mixed reactions on social media, with a few users saying that foreign workers, especially those on H-1B visas, are often hired at lower wages, potentially displacing American workers.</p>\n\n<p>A few days ago, when a user said, \"I'm against more low-end H1B immigrants, but let's win at the talent game,\" Elon Musk dismissed the idea of limited job opportunities, describing it as a \"fixed pie\" fallacy.</p>\n\n<p>He said, \"The \"fixed pie\" fallacy is at the heart of much wrong-headed economic thinking. There is essentially infinite potential for job and company creation. Think of all the things that didn't exist 20 or 30 years ago!\"</p>\n\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">The “fixed pie” fallacy is at the heart of much wrong-headed economic thinking.<br />\n<br />\nThere is essentially infinite potential for job and company creation.<br />\n<br />\nThink of all the things that didn't exist 20 or 30 years ago! <a href=\"https://t.co/w7naC0Sb5E\">https://t.co/w7naC0Sb5E</a></p>\n— Elon Musk (@elonmusk) <a href=\"https://twitter.com/elonmusk/status/1871451701976412293?ref_src=twsrc%5Etfw\">December 24, 2024</a></blockquote>\n\n\n<p>Immigration lawyers are advising foreign tech workers in the US on visas to return to the country before President-elect Donald Trump takes office next month. The warning comes ahead of Donald Trump's January 20th inauguration and the expectation that he may introduce executive orders restricting access to various work visas, including those frequently used in the tech sector. The 78-year-old has also reportedly pledged to reinstate a ban on entry for individuals from Muslim-majority countries.</p>"
  },
  {
    "title": "Shastri, Gavaskar Rip Into Rohit Sharma's Captaincy Over 4th Test Tactics",
    "link": "https://sports.ndtv.com/australia-vs-india-2024-25/ravi-shastri-sunil-gavaskar-rip-into-rohit-sharmas-captaincy-over-4th-test-tactics-7340894",
    "published": "Fri, 27 Dec 2024 08:49:00 +0530",
    "author": "",
    "summary": "India captain Rohit Sharma saw himself in the line of fire over his tactical decisions in the Melbourne Test against Australia.",
    "categories": [],
    "content": "<p>India captain <a href=\"https://sports.ndtv.com/cricket/players/857-rohit-sharma-playerprofile\" title=\"Rohit Sharma\">Rohit Sharma</a> continues to court criticism over his baffling strategy and selection calls in the Melbourne Test. Since announcing the return of <a href=\"https://sports.ndtv.com/cricket/players/108593-washington-sundar-playerprofile\" title=\"Washington Sundar\">Washington Sundar</a> to India's playing XI for the Boxing Day Test -- which came at the cost of <a href=\"https://sports.ndtv.com/cricket/players/108578-shubman-gill-playerprofile\" title=\"Shubman Gill\">Shubman Gill</a> -- Rohit has had his decision-making questioned time and again. Be it the use of his bowlers, or match-ups used against different Australian batters, Rohit struggled to get the best out of India's bowling attack for the first two days. Some of his decisions received public criticism from legends like Suni Gavaskar and <a href=\"https://sports.ndtv.com/cricket/players/41719-ravishankar-jayadritha-shastri-playerprofile\" title=\"Ravi Shastri\">Ravi Shastri</a>.</p>\n\n<p>During his commentary stint on Day 2 of the Melbourne Test, Shastri questioned both Rohit and head coach Gambhir over the decision to add 2 spinners to the playing XI as they didn't show the required trust in them.</p>\n\n<p>\"Why did you take 2 spinners if you had to bowl them after 40 overs? In Melbourne, spinners should always bowl in 1 or 1 and a half overs. I didn't understand why Jadeja and Sundar bowled after 40 overs,\" Shastri wondered.</p>\n\n<p>The former India head coach also felt that the team should've started with Bumrah on Day 2 but he came in to bowl the third over.</p>\n\n<p>\"India should've started with Bumrah but Siraj bowled the first over. With SIraj's confidence being low, it's important to handle him well,\" he asserted.</p>\n\n<p>Shastri questioned not just Rohit's bowling changes but also his field placements.</p>\n\n<p>He said: \"You see, <a href=\"https://sports.ndtv.com/cricket/players/1416-mitchell-starc-playerprofile\" title=\"Mitchell Starc\">Mitchell Starc</a> has come and you have long on and long off fielders. At least put one of them up.\"</p>\n\n<p><a href=\"https://sports.ndtv.com/cricket/players/40594-sunil-manohar-gavaskar-playerprofile\" title=\"Sunil Gavaskar\">Sunil Gavaskar</a> was also livid upon seeing India's bowling performance in the middle. Barring <a href=\"https://sports.ndtv.com/cricket/players/1724-jasprit-bumrah-playerprofile\" title=\"Jasprit Bumrah\">Jasprit Bumrah</a>, no India pacer managed to step up. Gavaskar said that the new ball was 'wasted' by India's pacers.</p>\n\n<p>\"Pretty ordinary blowing. If you have to bowl a bouncer, you get it around the helmet's badge and not around the waist. I'm very disappointed, I'm sorry. This new ball has been wasted. Aakash Deep has been all over the place. He has wasted the new ball by bowling way outside off stump. The Indians have also been sloppy in the field,\" the original Little Master said on commentary.</p>\n\n<p>Later, Rohit also decided to open the batting for India, pushing the in-form <a href=\"https://sports.ndtv.com/cricket/players/1688-lokesh-rahul-playerprofile\" title=\"KL Rahul\">KL Rahul</a> down the order. But, the skipper departed after making just 3 runs.</p>"
  },
  {
    "title": "This Winter, Help Keep Someone Warm. Click Here To Donate A Blanket",
    "link": "https://special.ndtv.com/save-a-life-donate-a-blanket-5/",
    "published": "Fri, 27 Dec 2024 16:05:00 +0530",
    "author": "",
    "summary": "This Winter, Help Keep Someone Warm. Click Here To Donate A Blanket",
    "categories": [],
    "content": "This Winter, Help Keep Someone Warm. Click Here To Donate A Blanket"
  },
  {
    "title": "Around The Globe: 2024",
    "link": "https://www.ndtv.com/world",
    "published": "Fri, 27 Dec 2024 16:05:00 +0530",
    "author": "",
    "summary": "Around The Globe: 2024",
    "categories": [],
    "content": "Around The Globe: 2024"
  },
  {
    "title": "Pride Of The Nation 2024",
    "link": "https://food.ndtv.com",
    "published": "Fri, 27 Dec 2024 16:05:00 +0530",
    "author": "",
    "summary": "Pride Of The Nation 2024",
    "categories": [],
    "content": "Pride Of The Nation 2024"
  },
  {
    "title": "'One Of The Finest Global Leaders\": Supriya Sule On Manmohan Singh",
    "link": "https://www.ndtv.com/india-news/one-of-the-finest-global-leaders-supriya-sule-on-manmohan-singh-7343198",
    "published": "Fri, 27 Dec 2024 14:58:43 +0530",
    "author": "",
    "summary": "Remembering former Prime Minister Dr Manmohan Singh, NCP-SCP MP Supriya Sule described him as one of the finest global leaders.",
    "categories": [
      {
        "term": "All India",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "'One Of The Finest Global Leaders\": Supriya Sule On Manmohan SinghSeveral politicians and personalities from all walks of life have been expressing their sorrow over the demise of former PM Manmohan Singh.Read Time:2 minsShareTwitterWhatsAppFacebookRedditEmailThe last rites of the former PM will be carried out with full state honours.New Delhi:Remembering former Prime Minister Dr Manmohan Singh, who passed away on Thursday at the age of 92, NCP-SCP MP Supriya Sule described him as one of the finest global leaders.\"He was an extraordinary man. I was blessed that I had the opportunity to meet him, to talk to him, and hear him many times in the Parliament... He was such a fine man and one of the finest global leaders,\" Supriya Sule said.In a post on X, Sule wrote, \"Deeply saddened by the passing of former Prime Minister Dr. Manmohan Singh Ji. His visionary leadership and unwavering integrity steered India through pivotal moments, shaping our nation's progress with wisdom and humility. His contributions will never be forgotten. May his soul rest in peace.\"Senior Congress leader AK Antony on Friday also expressed sorrow over the demise of former Prime Minister Manmohan Singh, saying that it was a loss to the entire nation. He said that then Prime Minister Narsimha Rao had invited Manmohan Singh to be part of his cabinet as the finance minister when the economy was in shambles.The national flag was draped over the bier carrying the body of former Prime Minister Manmohan Singh. According to sources, the last rites of the former PM will be carried out with full state honours.Several politicians and personalities from all walks of life have been expressing their sorrow over the demise of former PM Manmohan Singh. Prime Minister Narendra Modi on Thursday night said that he condoled the demise of former Prime Minister Manmohan Singh, saying that India mourns the loss of one of its most distinguished leaders.Manmohan Singh passed away at AIIMS, Delhi, on Thursday evening at the age of 92 due to age-related medical conditions. He had a sudden loss of consciousness at home, after which he was rushed to AIIMS Delhi.Manmohan Singh was born on September 26, 1932. Apart from being an economist, Manmohan Singh served as Reserve Bank of India governor from 1982-1985. He was the 13th PM of India, with his tenure from 2004-2014, and was the longest-serving PM after Jawaharlal Nehru and Indira Gandhi.He retired from the Rajya Sabha earlier this year after serving for 33 years.Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:Manmohan Singh,Manmohan Singh Death,Congress",
    "word_count": 423,
    "extracted_at": "2024-12-27T10:42:19.655011"
  },
  {
    "title": "Manmohan Singh Blended Growth With Green Goals",
    "link": "https://www.ndtv.com/india-news/manmohan-singh-blended-growth-with-green-goals-7343177",
    "published": "Fri, 27 Dec 2024 14:52:00 +0530",
    "author": "",
    "summary": "Manmohan Singh, often hailed as the architect of modern India's economic reforms, also championed environmental conservation and climate action during his decade-long tenure as prime minister.",
    "categories": [
      {
        "term": "All India",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Manmohan Singh Blended Growth With Green GoalsIn July 2008, Manmohan Singh urged all chief ministers to act swiftly to grant tribals their rights over forest land.Read Time:3 minsShareTwitterWhatsAppFacebookRedditEmailManmohan Singh's government passed the Forest Rights Act in 2006.New Delhi:Manmohan Singh, often hailed as the architect of modern India's economic reforms, also championed environmental conservation and climate action during his decade-long tenure as prime minister (2004-2014).Under his leadership, India launched the National Action Plan on Climate Change, passed the landmark Forest Rights Act (FRA) to protect the rights of tribal communities, and established the National Green Tribunal to safeguard the environment through swift legal action.For centuries, India's tribal communities were sidelined from decisions about their own land. The UPA-1 government under Singh flipped that script.His government passed the Forest Rights Act in 2006, handing back control of forests to the people who lived in and protected them.Around 25 lakh land titles, including over 23.7 lakh individual titles, have been granted so far to Scheduled Tribes and other traditional forest dwellers under the FRA.In July 2008, Singh urged all chief ministers to act swiftly to grant tribals their rights over forest land.\"It is primarily the responsibility of the state governments to ensure that a very vulnerable section of the population of our country finally gets its basic rights over the land which has historically been in its possession,\" he wrote in a letter.In 2008, the Manmohan Singh government delivered the NAPCC, an eightfold strategy to tackle global warming.The NAPCC's eight core missions include the National Solar Mission, which laid the groundwork for the country to emerge as a global clean energy leader, and the Green India Mission, which focuses on improving biodiversity, restoring degraded lands, and enhancing climate resilience.\"Greater use of clean energy obviously contributes to sustainability... this issue will become more important in the years ahead,\" Singh said at the 4th Clean Energy Ministerial in 2013 in New Delhi.Singh strongly advocated for climate justice. Speaking at the Washington office of the Council on Foreign Relations on November 23, he made it clear that India wouldn't accept unfair carbon shackles.\"India was a latecomer to industrialisation. And as such, we have contributed very little to the accumulation of greenhouse gas emissions that cause global warming. But we are determined to be part of the solution to the problem. We are willing to work towards any solution that does not compromise the right of developing countries to develop and lift their population out of poverty,\" he said.Under Singh's watch, India set up the National Green Tribunal (NGT) in 2010 to fast-track environmental justice.Over the years, the NGT became the watchdog India needed for delivering speedy judgments on critical issues like pollution, deforestation, and wildlife conservation.Unassuming, erudite, soft-spoken, and a consensus builder, Singh died on Thursday night at Delhi's All India Institute of Medical Sciences (AIIMS). He was 92.The Congress leader, who steered the country for 10 years from 2004-2014 and helped set up the country's economic framework as Finance Minister before that, was a renowned name in the global financial and economic sectors.(This story has not been edited by NDTV staff and is auto-generated from a syndicated feed.)Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:Manmohan Singh,Manmohan Singh  Death,Congress",
    "word_count": 537,
    "extracted_at": "2024-12-27T10:42:20.625247"
  },
  {
    "title": "Injured North Korean Soldier, Captured By Ukraine During War, Dies",
    "link": "https://www.ndtv.com/world-news/injured-north-korean-soldier-captured-by-ukraine-during-war-dies-7343137",
    "published": "Fri, 27 Dec 2024 14:49:00 +0530",
    "author": "",
    "summary": "A North Korean soldier who was captured while fighting in Russia's war against Ukraine has died of his wounds, South Korea's spy agency said on Friday.",
    "categories": [
      {
        "term": "World",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Injured North Korean Soldier, Captured By Ukraine During War, DiesNorth Korea and Russia have strengthened their military ties since Moscow's invasion of Ukraine in February 2022.Read Time:3 minsShareTwitterWhatsAppFacebookRedditEmailPyongyang has deployed thousands of troops to reinforce Russia's military.Seoul, South Korea:A North Korean soldier who was captured while fighting in Russia's war against Ukraine has died of his wounds, South Korea's spy agency said on Friday.Pyongyang has deployed thousands of troops to reinforce Russia's military, including in the Kursk border region where Ukraine mounted a shock border incursion in August.One of those North Korean soldiers was captured alive by the Ukrainian army on Thursday, a South Korean intelligence source told AFP, adding that the location where he was seized was not known.Hours later, Seoul's National Intelligence Service (NIS) said that the soldier had succumbed to his wounds.\"It has been confirmed through an allied intelligence agency that the North Korean soldier captured alive on December 26th has just passed away due to worsening wounds,\" the South's spy agency said in a statement.Friday's confirmation came days after Ukrainian President Volodymyr Zelensky said that nearly 3,000 North Korean soldiers had been \"killed or wounded\" so far as they joined Russian troops in combat.South Korea's intelligence service had previously put the number of killed or wounded North Koreans at 1,000, saying the high casualty rate could be down to an unfamiliar battlefield environment and their lack of capability to counter drone attacks.Pyongyang's soldiers were also being \"utilised as expendable frontline assault units\", lawmaker Lee Seong-kweun said, speaking last week after a briefing by South Korea's spy agency.'Dangerous expansion'North Korea and Russia have strengthened their military ties since Moscow's invasion of Ukraine in February 2022.A landmark defence pact between Pyongyang and Moscow signed in June came into force this month, with Russian President Vladimir Putin hailing it as a \"breakthrough document\".North Korean state media said Friday that Putin sent a New Year's message to North Korean leader Kim Jong Un, saying \"the bilateral ties between our two countries have been elevated after our talks in June in Pyongyang\".Ukraine's allies have called Pyongyang's growing involvement in Russia's war in Ukraine a \"dangerous expansion\" of the conflict.Seoul's military believes that North Korea was seeking to modernise its conventional warfare capabilities through combat experience gained in the Russia-Ukraine war.NATO chief Mark Rutte had also said that Moscow was providing support to Pyongyang's missile and nuclear programmes in exchange for the troops.South Korea's Joint Chiefs of Staff (JCS) said Monday that Pyongyang is reportedly \"preparing for the rotation or additional deployment of soldiers\" and supplying \"240mm rocket launchers and 170mm self-propelled artillery\" to the Russian army.Pyongyang's involvement in Russia's war against Ukraine had prompted warnings from Seoul.South Korea's President Yoon Suk Yeol, currently suspended, said in November that Seoul was \"not ruling out the possibility of providing weapons\" to Ukraine, which would mark a major shift to a long-standing policy barring the sale of weapons to countries in active conflict.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:North Korea,Russia,Russia - Ukraine War",
    "word_count": 523,
    "extracted_at": "2024-12-27T10:42:21.507140"
  },
  {
    "title": "UP Woman Reunites With Family 49 Years After She Went Missing At Fair",
    "link": "https://www.ndtv.com/cities/up-woman-reunites-with-family-49-years-after-she-went-missing-at-fair-7342878",
    "published": "Fri, 27 Dec 2024 14:47:12 +0530",
    "author": "",
    "summary": "Azamgarh police in Uttar Pradesh has reunited a woman with her family 49 years after she went missing from a fair as a child, officials said.",
    "categories": [
      {
        "term": "Cities",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "UP Woman Reunites With Family 49 Years After She Went Missing At FairAccording to the police, the woman, now 57 years-old and known as Fulmati alias Fula Devi was abducted as an eight-year-old during a visit to the fair in Moradabad with her mother.Read Time:2 minsShareTwitterWhatsAppFacebookRedditEmailUpon confirming her identity, the police arranged for Fulmati to meet her family.Azamgarh (UP):Azamgarh police in Uttar Pradesh has reunited a woman with her family 49 years after she went missing from a fair as a child, officials said.The reunion, facilitated under 'Operation Muskan,' brought an end to decades of separation, leaving the family emotional and overjoyed.According to the police, the woman, now 57 years-old and known as Fulmati alias Fula Devi was abducted as an eight-year-old during a visit to the fair in Moradabad with her mother.Superintendent of Police Hemraj Meena said, \"She was taken away by an elderly man who later sold her to a resident of Rampur. Despite building a life there, she kept looking for her family.\" The case came to light on December 19, when Dr. Pooja Rani, a school teacher from Rampur, informed Additional SP Shailendra Lal about Fulmati's story.The teacher revealed that Fulmati had spent years trying to locate her relatives in Azamgarh.A team was formed to investigate and based on Fulmati's description of her maternal uncle Ramchander and their home, the police tracked her family's village in Mau district.Her uncle, Ramhit, confirmed that Fulmati was indeed the girl who had gone missing in 1975. The team later located her brother, Laldhar, in Bedpur village of Azamgarh district, officials said.Upon confirming her identity, the police arranged for Fulmati to meet her family, they said.\"This reunion is a result of focused efforts under 'Operation Muskan' to find missing persons,\" said Meena.\"Seeing the family together after decades was heartwarming,\" he added.The case has drawn praise for the police's dedication from the locals with Fulmati and her family expressing their gratitude.Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:Azamgarh Police,Woman Reunites With Family",
    "word_count": 335,
    "extracted_at": "2024-12-27T10:42:22.637153"
  },
  {
    "title": "After Yet Another Failure, Rohit Sharma's Future Hangs In The Balance",
    "link": "https://sports.ndtv.com/cricket/after-yet-another-failure-rohit-sharmas-future-as-player-and-captain-hangs-in-the-balance-7342129",
    "published": "Fri, 27 Dec 2024 14:46:28 +0530",
    "author": "",
    "summary": "Rohit Sharma's return to the top of the order failed miserably in the India vs Australia 4th Test.",
    "categories": [
      {
        "term": "Cricket",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Story ProgressBack to homeAfter Yet Another Failure, Rohit Sharma's Future As Player And Captain Hangs In The BalanceRohit Sharma's return to the top of the order failed miserably in the India vs Australia 4th Test.facebooktwitterWhatsAppredditE-mailRohit Sharma during Day 2 of the India vs Australia 4th Test.© AFPRohit Sharma seems to have nothing left in the tank. \"Tough times for him,\" the legendary Sunil Gavaskar said while on air with broadcasters '7Cricket'. \"There will be a second innings and two more in Sydney. Questions will be asked if he doesn't score in those three innings,\" Gavaskar said on air as he saw it. After yet another cheap dismissal off a Pat Cummins' short ball, questions are mounting on when the 38-year-old Indian captain will finally call time on his Test career.But will Rohit allow all these questions to fester? The national selection committee chairman Ajit Agarkar is in Melbourne and it won't surprise anyone if it comes out that the two former teammates have had some discussions on the future as India copes with a tough transition.Only 155 runs in eight Tests at an average of 11.07 in 14 innings is very poor by all standards and not scoring runs after tinkering a set opening combination hasn't done him any good.The common belief is that if India do not qualify for the World Test Championship, then Sydney will be the final destination of his cricketing journey in whites.But will the skipper be more pragmatic and for the sake of the team, drop himself from the playing eleven for the Sydney Test allowing an in-form KL Rahul to continue with a rampaging Yashasvi Jaiswal? Current national head coach Gautam Gambhir, during his playing time in the IPL, once dropped himself from after a horrendous first phase, knowing that his days as a T20 opener were behind him.There is a growing feeling that Indian cricket consider using a similar tactic for senior players.If Ravichandran Ashwin could be nudged into retirement and clearly communicated that he is not even among the top two spinners in overseas conditions, then shouldn't the Indian skipper be told that he is perhaps no longer an automatic choice in the Test top six? But there is an ODI Champions Trophy to be played in another seven weeks and the skipper is still a force to reckon with in that format.AdvertisementAlthough current form is a huge factor and it does affect confidence, he might just come good in the ODIs if the Test responsibility is off his shoulders.Rohit was never comfortable with the idea of batting in the middle-order and he realised after three innings that it has not worked. As a result, Shubman Gill was dropped from the playing eleven to allow Rohit to go back to his familiar opening position.But just like his pull shots aren't coming off anymore, the strategic moves are failing too.The biggest difference between Rohit and Virat Kohli, despite both going through a lean patch, is how they are looking at the crease.AdvertisementKohli is still a picture of intent and gives the feeling that there could be a big knock around the corner and in fact, a hundred did come in the Perth Test's second innings.On second day at the MCG, he looked solid, trying to leave as many deliveries in the channel but not forgetting to punish the half-volleys.But Rohit has been a walking wicket, a trifle lost and looking completely out of place.No one could have put it as concisely as former Australian skipper Ricky Ponting, whose technical analysis has always been spot on.\"That's just a lazy, not switched on, not up for the moment type of shot,\" Ponting said while analysing his dismissal on air for 7Cricket.\"He's been known as one of the best hookers and pullers of the ball since he's made his debut but that's just not there. It's nothing.\"It's not committed, not really looking to be aggressive, he's just looking to tap it on the head,\" added possibly the best horizontal bat shot-maker of his generation.In captaincy and batting, it is about making good decisions and the Indian skipper is not being able to do that at this point.\"It (ball) might have held in the wicket yes. It might have seamed away from him a fraction. But if you're going to survive against this Australian attack, you've got to be switched on.\"You've got to be making good decisions. If you're not, they'll knock you over every time,\" Ponting said.Listen to thelatest songs, only onJioSaavn.comAs things stand, the skipper needs to make a quick decision. His team is possibly waiting for it.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)CommentsTopics mentioned in this articleRohit SharmaIndia Cricket TeamAustralia vs India 2024/25CricketGet the LatestCricketUpdates, CheckIndia Tour of Australia 2024-25,Results,NewsandIPL 2025 Mega AuctionUpdates atNDTV Sports. Like Us OnFacebookOr Follow Us OnTwitterFor More Sports Updates. You Can Also Download The NDTV Cricket App ForAndroidOriOS.",
    "word_count": 822,
    "extracted_at": "2024-12-27T10:42:23.677039"
  },
  {
    "title": "Climate Change Caused 41 Additional Days Of Extreme Heat This Year: Report",
    "link": "https://www.ndtv.com/world-news/climate-change-caused-41-additional-days-of-extreme-heat-this-year-report-7343095",
    "published": "Fri, 27 Dec 2024 14:40:42 +0530",
    "author": "",
    "summary": "The world experienced an average of 41 more days of extreme heat in 2024 due to climate change, a new report said on Friday.",
    "categories": [
      {
        "term": "World",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Climate Change Caused 41 Additional Days Of Extreme Heat This Year: Report2024 is expected to end with a global average temperature at least 1.55 degrees Celsius above pre-industrial levels.Read Time:4 minsShareTwitterWhatsAppFacebookRedditEmailSmall island developing states were hit the hardest.New Delhi:The world experienced an average of 41 more days of extreme heat in 2024 due to climate change, a new report said on Friday. According to the European climate agency Copernicus, 2024 is set to end as the warmest year on record and the first year with a global average temperature of 1.5 degrees Celsius above pre-industrial levels.A yearly review report by two groups of climate scientists -- World Weather Attribution (WWA) and Climate Central -- said the world saw an average of 41 more days of dangerous heat in 2024.Small island developing states were hit the hardest, with their people experiencing over 130 additional hot days.The scientists identified 219 extreme weather events in 2024 and studied 29 of them. They found that climate change contributed to at least 3,700 deaths and displaced millions in 26 extreme weather events.\"It is likely the total number of people killed in extreme weather events intensified by climate change this year is in the tens or hundreds of thousands,\" the report said.The floods in Sudan, Nigeria, Niger, Cameroon, and Chad were the deadliest event studied by the group, with at least 2,000 people killed.The study found that if global warming reached two degrees Celsius, which could happen as early as the 2040s or 2050s, these regions might face similar heavy rainfall events every year.Friederike Otto, lead of WWA and senior lecturer in climate science at the Imperial College, London, said, \"The impacts of fossil fuel warming have never been clearer or more devastating than in 2024. We are living in a dangerous new era.\" \"We know exactly what we need to do to stop things from getting worse -- stop burning fossil fuels. The top resolution for 2025 must be transitioning away from fossil fuels, which will make the world a safer and more stable place,\" he added.The year 2024 is expected to end with a global average temperature at least 1.55 degrees Celsius above pre-industrial levels, according to Copernicus.However, a permanent breach of the 1.5-degree Celsius limit specified in the Paris Agreement refers to long-term warming over a 20- or 30-year period.That said, experts feel that the world is now entering a phase where temperatures will be consistently above this threshold.The average global temperature has already risen by 1.3 degrees Celsius compared to the 1850-1900 average, driven by the rapid buildup of greenhouse gases such as carbon dioxide and methane in the atmosphere.The Intergovernmental Panel on Climate Change, the UN body for assessing the science related to climate change, says global emissions must peak by 2025 and reduce by 43 per cent by 2030 and 57 per cent by 2035 compared to 2019 levels to limit global warming to 1.5 degrees Celsius.However, according to the latest UN data, current policies will take global warming to around 3 degrees Celsius by 2100.Even the full implementation of all Nationally Determined Contributions (NDCs) or national climate plans will likely lead to just a 5.9 per cent emission reduction by 2030 compared to 2019 levels, according to the synthesis report of countries' NDCs.Fossil fuels -- coal, oil, and gas -- are the largest contributors to climate change, accounting for over 75 per cent of global greenhouse gas emissions and nearly 90 per cent of all carbon dioxide emissions.However, the world is struggling to transition away from fossil fuels rapidly enough to prevent breaching the 1.5-degree Celsius goal due to a combination of political, economic, technological, and social challenges.The transition to clean energy sources is particularly difficult for poor countries in the Global South due to dependence on fossil fuels for jobs and cheap energy, lack of funding and technology, weak power grids, and limited expertise.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:Climate Change,Extreme Heat,Hottest Year",
    "word_count": 679,
    "extracted_at": "2024-12-27T10:42:24.618379"
  },
  {
    "title": "One Bag, 7kg Limit: Stricter Hand Baggage Rules For Air Travel Announced",
    "link": "https://www.ndtv.com/feature/only-one-bag-not-more-than-7kg-stricter-hand-baggage-restrictions-for-air-travel-announced-7343075",
    "published": "Fri, 27 Dec 2024 14:40:05 +0530",
    "author": "",
    "summary": "The Bureau of Civil Aviation Security (BCAS) has introduced new regulations limiting passengers to one cabin bag or handbag weighing up to 7 kg, effective next month. The rule aims to reduce airport...",
    "categories": [
      {
        "term": "Feature",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Only One Bag, Not More Than 7kg: Stricter Hand Baggage Restrictions For Air Travel AnnouncedBCAS has introduced new regulations limiting passengers to one cabin bag or handbag weighing up to 7 kg, effective next month.Read Time:3 minsShareTwitterWhatsAppFacebookRedditEmailPassengers exceeding size or weight limits will incur excess baggage fees.In a bid to streamline air travel and tighten security measures, the Bureau of Civil Aviation Security (BCAS) has now brought into effect a new regulation that governs the carrying of hand luggage in flights. From next month onwards, in both domestic and international journeys, passengers will be restricted to carrying one cabin bag or handbag in the plane. This is part of the government's efforts in managing the ever-increasing number of passengers at the airports and increasing operational efficiency.The new regulation will significantly facilitate passenger travel and airport operations by reducing traffic at security checkpoints. The BCAS and Central Industrial Security Force (CISF) have decided to implement stricter luggage regulations in order to facilitate passenger flow through airport terminals, given the steadily rising number of air travellers.Key Details of the New Baggage Restrictions:1. One Handbag Limit:According to the new rule,each passenger is allowed to carry only one handbag or cabin bag weighing not more than 7 kg. All other luggage should be checked in.2. Cabin Bag Size Limitations:The cabin bag size cannot be more than 55 cm in height, 40 cm in length, and 20 cm in width. This is to ensure uniformity in all airlines and to make security screening easier.3. Surcharge for Excess Baggage:In case the passenger exceeds the weight or size limits of the cabin bag, then there will be an excess baggage charge.4. Exemption for Pre-purchased Tickets:For tickets issued prior to 2 May 2024, the maximum weight will be as per the prior cabin baggage policy (Economy: 8 kg, Premium Economy: 10 kg, First/Business: 12 kg). However, for any such tickets subsequently reissued/rescheduled, the revised maximum weights will apply.Impact on Airlines and Passengers:Airlines, including major carriers like IndiGo and Air India, have updated their baggage policies to align with these new guidelines. Passengers are advised to check the updated baggage requirements before their flights to avoid any last-minute hassles or extra charges.This change is expected to improve the overall efficiency of airport operations, reduce delays at security checkpoints, and contribute to a more organized travel experience for all passengers. However, travelers are encouraged to pack carefully and ensure that their cabin bag complies with the new restrictions to avoid inconvenience.Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:BCAS,Cabin Bag,Baggage Restrictions,Air Travel,Security,Excess Baggage,Airport Operations",
    "word_count": 427,
    "extracted_at": "2024-12-27T10:42:25.622368"
  },
  {
    "title": "Janhvi, Arjun And Khushi Kapoor Are In The \"Most Wonderful\" Time Of The Year",
    "link": "https://www.ndtv.com/entertainment/janhvi-kapoor-pose-with-khushi-and-arjun-kapoor-at-christmas-party-7342068",
    "published": "Fri, 27 Dec 2024 14:37:42 +0530",
    "author": "",
    "summary": "Janhvi Kapoor looked breathtaking in a red velvet gown at the Christmas bash",
    "categories": [
      {
        "term": "Bollywood",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Sibling Revelry: Janhvi, Arjun And Khushi Kapoor Are In The \"Most Wonderful\" Time Of The YearJanhvi Kapoor looked breathtaking in a red velvet gown at the Christmas bashRead Time:2 minsShareTwitterWhatsAppFacebookRedditEmailJanhvi Kapoor shared this imageNew Delhi:Pause everything and head over toJanhvi Kapoor'sInstagram page. Reason? The actress has posted a page from her “wonderful” Christmas party. Oh boy! It screamed Ho…Ho…Ho…Janhvi Kapoor had a blast with her friends and family at the Christmas bash. The major highlight — Janhvi withKhushi Kapoorand Arjun Kapoor. Here, Janhvi, looking gorgeous in a velvet dress, is sharing a side hug with Arjun and Khushi.Janhvi Kapoor's Christmas album also featured her BFF Orry. Sharing the album, Janhvi wrote, “It's the most wonderful time of the year.”  Replying to the post, Orry wrote, “Meow.”View this post on InstagramA post shared by Janhvi Kapoor (@janhvikapoor)Khushi Kapoor also shared a slew of pictures from the festive day on Instagram. “Merry merry,” she wrote.View this post on InstagramA post shared by ᴋʜᴜsʜɪ ᴋᴀᴘᴏᴏʀ (@khushikapoor)“A Siblings Kinda Christmas,” saidArjun Kapooras the actor dropped a couple of pictures on Instagram with Janhvi and Khushi Kapoor.View this post on InstagramA post shared by Arjun Kapoor (@arjunkapoor)Workwise, Janhvi Kapoor will next be seen inSunny Sanskari Ki Tulsi Kumari. Directed by Shashank Khaitan, the movie features Varun Dhawan, Sanya Malhotra and Rohit Saraf in key roles.Janhvi Kapoor is also part ofRC16opposite Ram Charan. That's not all. Janhvi will also share screen space with Sidharth Malhotra for the first time in the Dinesh Vijan-productionParam Sundari.Meanwhile, Khushi Kapoor made her film debut withThe Archies. She will be next seen in Advait Chandan's rom-comLoveyapa.Coming to Arjun Kapoor, the actor was last seen inSingham Again.Show full articleCommentsEntertainment I Read Latest News on NDTV Entertainment. ClickNDTV EntertainmentFor TheLatestIn,bollywood,regional,hollywood,tv,web series,photos,videosand More.Follow us:Janhvi Kapoor,Arjun Kapoor,Entertainment",
    "word_count": 292,
    "extracted_at": "2024-12-27T10:42:26.597453"
  },
  {
    "title": "\"Double Standards\": Pathan, Gavaskar Slam Aus Experts Over Kohli Bashing",
    "link": "https://sports.ndtv.com/cricket/double-standards-irfan-pathan-sunil-gavaskar-slam-australia-experts-over-virat-kohli-bashing-during-boxing-day-test-7343046",
    "published": "Fri, 27 Dec 2024 14:37:31 +0530",
    "author": "",
    "summary": "Irfan Pathan and Sunil Gavaskar were absolutely livid at the way India star Virat Kohli has been portrayed by the Australian media.",
    "categories": [
      {
        "term": "Cricket",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Story ProgressBack to home\"Double Standards\": Irfan Pathan, Sunil Gavaskar Slam Australia Experts Over Virat Kohli BashingIrfan Pathan and Sunil Gavaskar were absolutely livid at the way India star Virat Kohli has been portrayed by the Australian media.facebooktwitterWhatsAppredditE-mailFile image of newspaper portraying Virat Kohli as a 'clown'.© X (Twitter)Former India cricketersSunil GavaskarandIrfan Pathanhave not held back in expressing their fury over the portrayal ofVirat Kohliin an Australian newspaper. Following his shoulder barge incident with Australia debutantSam Konstas, Kohli was labelled a \"clown\" by 'The West Australian' newspaper, and was humiliated further with a caricature of his face drawn with a red nose. Speaking on Day 2 of the fourth Test, Pathan and Gavaskar stated that unless something is said now, such a trend of disrespecting Indian cricketers will continue in the Australian media.\"Australian newspapers, media and even some ex-cricketers are the definition of being two-faced. First, they go and call Virat Kohli the 'King', but the moment he shows some aggression, he is labelled in this way. Double standards,\" Pathan said on Star Sports.\"None of us supported the incident, but we left it to the officials. But here, first they'd call him the 'King' and then immediately call him a 'Joker' after that? You want to sell, you want to make cricket popular but at the expense of Virat Kohli's market value? We will not accept this,\" Pathan added.IRFAN PATHAN'S REACTION ON AUSTRALIAN MEDIA...!!!!pic.twitter.com/tj5D3k2b7E— Johns. (@CricCrazyJohns)December 27, 2024Pathan stated that such incidents towards Indian cricketers have been continuously happening for several years, and will keep happening if people from Indian cricket and media do not speak out.Pathan gave an example of how he had been punished despite an argument and verbal abuse being thrown at him by former Australian cricketerDamien Martyn.\"When I got fined for the first time, I had just made a clap while Damien Martyn hurled an insult. But I was the one who could be seen on camera clapping, and I got fined. Damien Martyn escaped scot-free,\" Pathan said.Listen to thelatest songs, only onJioSaavn.comSunil Gavaskar echoed Pathan's comments.\"This is old news. It's always 'if we do it, it's alright, if you do it, it's a crime',\" said Gavaskar.AdvertisementCommentsTopics mentioned in this articleVirat KohliSunil GavaskarIrfan PathanRicky PontingSam KonstasKerry James O'KeeffeDamien MartynCricketIndia Cricket TeamAustralia Cricket TeamAustralia vs India 2024/25Get the LatestCricketUpdates, CheckIndia Tour of Australia 2024-25,Results,NewsandIPL 2025 Mega AuctionUpdates atNDTV Sports. Like Us OnFacebookOr Follow Us OnTwitterFor More Sports Updates. You Can Also Download The NDTV Cricket App ForAndroidOriOS.",
    "word_count": 409,
    "extracted_at": "2024-12-27T10:42:27.605909"
  },
  {
    "title": "Samsung May Let Users Disable This Annoying Feature With One UI 7",
    "link": "https://www.gadgets360.com/mobiles/news/samsung-one-ui-7-update-super-hdr-setting-toggle-galaxy-report-7342454",
    "published": "Fri, 27 Dec 2024 14:35:38 +0530",
    "author": "",
    "summary": "Samsung announced its Android 15-based update dubbed One UI 7 at the Samsung Developer Conference (SDC) 2024 in October. According to a report, it brings a fix for an issue that has troubled Samsung...",
    "categories": [
      {
        "term": "Mobiles",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Samsung Galaxy S25 Slim May Use New ALoP Technology for Compact Camera Module, Better Image Quality27 December 2024Samsung's Galaxy Ring 2 May Show Up Alongside Galaxy S25 Series at the Upcoming Unpacked Event26 December 2024Samsung Files Patent for Smart Glasses With AI Hardware and Speaker Protected from Magnetic Interference26 December 2024Apple's First Bezel-Less Full Screen iPhone Reportedly Delayed Beyond 202626 December 2024Samsung Galaxy M16 5G Leaked Renders Show Expected Design, Colour Options24 December 2024",
    "word_count": 74,
    "extracted_at": "2024-12-27T10:42:28.617977"
  },
  {
    "title": "Weekend Binge: Top 10 Salman Khan Movies To Watch Online",
    "link": "https://www.ndtv.com/entertainment/happy-birthday-salman-khan-top-films-you-just-can-t-miss-7342309",
    "published": "Fri, 27 Dec 2024 14:33:25 +0530",
    "author": "",
    "summary": "On the special day,  let's take a look at some of Salman Khan's biggest hits",
    "categories": [
      {
        "term": "Bollywood",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Weekend Binge: Top 10 Salman Khan Movies To Watch OnlineOn the special day,  let’s take a look at some of Salman Khan’s biggest hitsRead Time:3 minsShareTwitterWhatsAppFacebookRedditEmailSalman Khan is celebrating his 59th birthday today. Like every year, fans made it a point to make the day special for their  ‘Bhaijaan.'The actor celebrated his birthday at his sister Arpita Khan's house. Arpita's daughter Ayat shares his birthday with his uncle.On this special day, let's take a look at some of Salman Khan's biggest hits:Maine Pyar Kiya - Prime VideoSalman Khan and Bhagyashree's effortless chemistry in this Sooraj Barjatya directorial has stayed in our hearts rent-free. Be it the storyline or the songs, the film ticked all the boxes.Hum Aapke Hain Koun..! - NetflixAn absolute entertainer — this film is perfect to binge-watch with your family this holiday season. His chemistry with Madhuri Dixit was top-notch, and the songs are a big hit at wedding celebrations even today.Partner - Zee5Salman Khan's comic timing in this David Dhawan film was unbeatable. His charm and suave demeanour kept us hooked. Govinda's killer dance moves as he grooved to –Soni De Nakhre,was the cherry on top.Andaz Apna Apna - Prime VideoSalman Khan and Aamir Khan's bromance took centre stage in this cult classic. With a quirky love story thrown in the mix, the movie is a must-watch if you are having a dull day.Tere Naam - JioCinemaKeep a box of tissues handy before you watchTere Naam.Salman's applaud-worthy performance as Radhe — a tormented lover tugs at your heart strings like no other.Dabangg - Prime VideoA diehard Salman Khan fan cannot miss this one! From his charm to Sonakshi Sinha's iconic dialogue — ‘Thapar se daar nahi lagta sahab',Dabangghad the perfect dose of entertainment.Bodyguard - Prime VideoThis film was a massive hit amongst Salman Khan fans. His comic timing was right on point. Kareena Kapoor Khan and Hazel Keech were also part of the film.Ek Tha Tiger  - Apple TVSalman Khan and Katrina Kaif's chemistry in this celebrated franchise is much-loved by fans and critics alike. The film is part of Yash Raj's spy universe.Bajrangi Bhaijaan - HotstarThe Kabir Khan blockbuster revolves around an Indian man who helps a little mute Pakistani girl reunite with her family. Apart from Salman, Nawazuddin Siddiqui's Chand Nawab, a journalist, left a lasting impression.Sultan - Apple TVThis sports drama is all about a wrestler's determination to achieve the Gold medal. Anushka Sharma and Kumud Mishra were also part of the film.Salman Khan has his next filmSikandarreleasing soon. He will be seen alongside Rashmika Mandanna in the film.Show full articleCommentsEntertainment I Read Latest News on NDTV Entertainment. ClickNDTV EntertainmentFor TheLatestIn,bollywood,regional,hollywood,tv,web series,photos,videosand More.Follow us:Salman Khan,Entertainment,Salman Khan Films",
    "word_count": 444,
    "extracted_at": "2024-12-27T10:42:29.644891"
  },
  {
    "title": "\"Knew My Limits...\": What Sonia Gandhi Said About Making Manmohan Singh PM",
    "link": "https://www.ndtv.com/india-news/manmohan-singh-death-sonia-gandhi-knew-my-limits-what-sonia-gandhi-said-about-making-manmohan-singh-pm-7343045",
    "published": "Fri, 27 Dec 2024 14:33:24 +0530",
    "author": "",
    "summary": "In 2014 Sonia Gandhi had said she chose Manmohan Singh to be Prime Minister of the Congress-led UPA that had won the 2009 election because she thought he would be the better choice.",
    "categories": [
      {
        "term": "All India",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "\"Knew My Limits...\": What Sonia Gandhi Said About Making Manmohan Singh PMPrime Minister Narendra Modi had, in February this year, praised Dr Singh as an \"inspiration to lawmakers\" as he retired from the Rajya Sabha.Read Time:4 minsShareTwitterWhatsAppFacebookRedditEmailNew Delhi:In May 2004 Congress leaderManmohan Singhwas sworn in as Prime Minister - a position he would hold for the next decade - but the soft-spoken and erudite economist, who made headlines steering the nation through the 1991 economic reforms as Finance Minister, was a pick straight out of left field, a surprise nomination for a post many believed hadSonia Gandhi's name all over it.Mrs Gandhi, though, had other ideas, though she kept quiet about them for the next 14 years. In March 2014, at an event in Mumbai, the veteran Congress leader finally opened up.\"I knew my limitations... I knew Manmohan Singh would be a better Prime Minister...\"Sure, there were many questions.Did condemnation of Mrs Gandhi's Italian heritage give her pause from taking the job? Would Dr Singh have become Prime Minister if Rajiv Gandhi was not assassinated in 1991? Did appeals by her children, understandably worried by the prospect of a mother ascending to a post that had claimed their father and grandmother, sway her? Was there dissent within the Congress' ranks?READ |How Manmohan Singh Was 'Accidental PM' After UPA's Shock 2004 WinBut Mrs Gandhi waved these aside, trusting her \"inner voice\" and Manmohan Singh.Dr Singh's time as Prime Minister was marked by successes and scandals, and an avalanche of criticism from detractors, led by the Bharatiya Janata Party. And among the most oft-used bullet in those attacks was the charge that Manmohan Singh, then 71 years old, was a 'puppet' Prime Minister.The Congress stalwart would always refuse to be drawn on those jabs, gently brushing aside criticism and questions to focus on what mattered most to him - the country and its people.READ |Not Health, Manmohan Singh Asked About This After Heart SurgeryBut the legacy Dr Singh left behind - from laying a strong foundation for the economy to securing the India-United States nuclear deal, and from enacting rural jobs schemes to the Right to Education Act for children - gave his successor, Prime Minister Narendra Modi, an enviable platform from which to build.READ |How Manmohan Singh Laid Foreign Policy Base PM Modi Built UponAnd yet, his legacy will also include the many jabs and barbs, including 'silent PM', 'reluctant PM', and 'accidental PM', tossed at him from rival politicians, none of which seemed - at least publicly, for what confidences he may have shared with his wife, we may never know - to faze Dr Singh.READ |\"People Say I Was...\": Manmohan Singh Defends 'Silent PM' ChargeFor he himself preferred to leave judgement of his career to the annals of history. In 2014 he said, in his typical dry but sharp humour, \"I honestly believe that history will be kinder to me than the contemporary media, or for that matter, the opposition parties in Parliament.\"And today, 92 years later, history will have the chance to do just that.ForDr Manmohan Singh died late Thursdayat Delhi's All India Institute of Medical Sciences.News of Dr Singh's death was met with an outpouring of grief, not just from within the Congress - party boss Mallikarjun Kharge and senior leaders Rahul Gandhi and Priyanka Gandhi Vadra posted heartfelt tributes - but also across parties, including from the BJP.Prime Minister Narendra Modi - who, in February this year, hailed Dr Singh as an \"inspiration to lawmakers\" as he retired from the Rajya Sabha - mourned his loss, and paid his final respects to his predecessor at his Delhi residence this morning.READ |\"Epitome Of Simplicity\": PM's Video Tribute To Manmohan SinghDr Singh's death has also been felt across the world, with former heads of state, particularly his contemporaries, such as former United States President Barack Obama and ex-Germany Chancellor Angela Merkel, remembering him as a scholar and a gentleman.NDTV is now available on WhatsApp channels.Click on the linkto get all the latest updates from NDTV on your chat.Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:Manmohan Singh,Sonia Gandhi",
    "word_count": 683,
    "extracted_at": "2024-12-27T10:42:30.536268"
  },
  {
    "title": "Microsoft 365 Prices Said to Rise as Copilot AI Gets Bundled In",
    "link": "https://www.gadgets360.com/ai/news/microsoft-365-subscription-price-hike-copilot-bundled-certain-regions-report-7342410",
    "published": "Fri, 27 Dec 2024 14:33:21 +0530",
    "author": "",
    "summary": "Microsoft is reportedly making changes to its Microsoft 365 subscription in some regions to bring Copilot to more users. As per the report, the Redmond-based tech giant has started bundling the...",
    "categories": [
      {
        "term": "AI",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Stalker 2, Spider-Man 2, Starfield: Best Holiday Season Deals on Steam, PlayStation and Xbox Games27 December 2024Microsoft Releases AIOpsLab, an Open-Source Standardised AI Framework for AIOps Agents26 December 2024Call of Duty: World at War, Singularity to Reportedly Join Game Pass in 202526 December 2024MediaTek Announces Optimisation of Microsoft’s Phi-3.5 AI Models on Dimensity Chipsets24 December 2024Microsoft Reportedly Trying to Bring Internal and Third-Party AI Models to 365 Copilot24 December 2024",
    "word_count": 70,
    "extracted_at": "2024-12-27T10:42:31.444282"
  },
  {
    "title": "\"Goodbye My Mitra, My Bhai\": Malaysia PM's Tribute To Manmohan Singh",
    "link": "https://www.ndtv.com/world-news/goodbye-my-mitra-my-bhai-malaysia-prime-minister-anwar-ibrahims-tribute-to-manmohan-singh-7343004",
    "published": "Fri, 27 Dec 2024 14:29:35 +0530",
    "author": "",
    "summary": "Malaysia Prime Minister Anwar Ibrahim paid tributes to his \"true friend\" Dr Manmohan Singh, former two-time Prime Minister who died at the age of 92.",
    "categories": [
      {
        "term": "World",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "\"Slightly Awkward Politician But...\": Malaysian PM On Manmohan SinghAccording to Anwar Ibrahim, Dr Manmohan Singh was \"slightly awkward\" as a politician but \"undeniably upright, steadfast and resolute\" as a statesman.Read Time:3 minsShareTwitterWhatsAppFacebookRedditEmailAnwar Ibrahim shared Manmohan Singh's 'act of kindness' towards him during his incarceration years.New Delhi:Malaysia Prime Minister Anwar Ibrahim paid tributes to his \"true friend\" Dr Manmohan Singh, former two-time Prime Minister who died at the age of 92. Calling Dr Singh the \"midwife of India's emergence\", Mr Ibrahim said the praise that is poured upon the former PM is \"truly well-deserved\".\"The weight of grief bears down on me at the news of the passing of my honoured and cherished friend:Dr Manmohan Singh. Obituaries, essays and books a plenty there will surely be about this great man, celebrating him as the architect of India's economic reforms. As Prime Minister, Dr Manmohan Singh was the midwife of India's emergence as one of the world's economic giants,\" Mr Ibrahim wrote in a post on X.According to Mr Ibrahim, Dr Singh was \"slightly awkward\" as a politician but \"undeniably upright, steadfast and resolute\" as a statesman.Also Read |Not Health, Manmohan Singh Asked About This After 10-Hour Heart SurgeryHe also sharedDr Singh's 'act of kindness' towards him during his incarceration years.\"Not many people know this, and it is time that I share it with Malaysians: during the years of my incarceration, he extended a kindness that he didn't have to - one that was neither politically expedient nor, as one can imagine, appreciated by the Malaysian government at that time. Yet, true to his character, he did it anyway. He offered scholarships for my children, particularly my son, Ihsan. Although I had declined the gracious offer, such a gesture undoubtedly showed his extraordinary humanity and generosity, demonstrative, as the Bard would have it, of a man so full of \"the milk of human kindness\",\" he said.\"In those dark days, as I navigated the labyrinth of imprisonment, he stood by me as a true friend. Such acts of quiet magnanimity defined him, and they will remain etched in my heart forever. Goodbye, my mitra, my bhai, Manmohan,\" the Malaysian PM added.Also Read |Why Manmohan Singh Always Wore A Blue TurbanThe weight of grief bears down on me at the news of the passing of my honoured and cherished friend: Dr Manmohan Singh.Obituaries, essays and books a plenty there will surely be about this great man, celebrating him as the architect of India's economic reforms. As Prime…pic.twitter.com/44bA3s7vst— Anwar Ibrahim (@anwaribrahim)December 27, 2024Manmohan Singh died due to age-related medical complications. He had been in poor health for the last few months. His remains will be brought to his residence in Delhi for the public to offer their condolences. The funeral will be held at 9:30 am on Saturday. The former Prime Minister's last rites will be conducted with full state honours. A seven-day state mourning will be observed throughout the country as a mark of respect to Dr Singh. During this period, the national flag will be flown at half-mast across India.Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:Anwar Ibrahim,Manmohan Singh,Manmohan Singh Dead",
    "word_count": 521,
    "extracted_at": "2024-12-27T10:42:32.497485"
  },
  {
    "title": "Surat Man Kills Wife And Son, Attacks Parents, Attempts Suicide",
    "link": "https://www.ndtv.com/surat-news/surat-man-kills-wife-and-son-attacks-parents-attempts-suicide-7342988",
    "published": "Fri, 27 Dec 2024 14:26:25 +0530",
    "author": "",
    "summary": "Sumit Jivani, 34, stabbed his wife Hiral (30), son Chahat (4), mother Vilasben and father Labhubhai at their residence in Surat on Friday morning.",
    "categories": [
      {
        "term": "Surat",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Surat Man Kills Wife And Son, Attacks Parents, Attempts SuicideSumit Jivani, 34, stabbed his wife Hiral (30), son Chahat (4), mother Vilasben and father Labhubhai at their residence in Surat on Friday morning.Read Time:2 minsShareTwitterWhatsAppFacebookRedditEmailAs per the preliminary probe, the man - Smit Jivani - was disturbed over family issue.Surat:A 34-year-old man stabbed his wife and son to death, attacked his parents and tried to end his own life using a knife over a domestic issue in Surat city of Gujarat on Friday, police said.As per the preliminary probe, the man - Smit Jivani - was disturbed after the family of his uncle, who passed away recently, cut off ties with his family and asked him never to visit their house, Deputy Superintendent of Police Vipul Patel said.Jivani stabbed his wife Hiral (30), son Chahat (4), mother Vilasben and father Labhubhai at their residence in Sarthana area of Surat city on Friday morning, said Mr Patel.\"After attacking his family members with a knife, Jivani tried to end his own life by slitting his neck. While Hiral and Chahat died in the attack, Jivani and his parents were injured and the three of them are undergoing treatment at a hospital here,\" he said.\"We have found that Jivani was mentally disturbed after the family of his deceased uncle snapped ties and asked him and his family not to visit their house,\" the Deputy Superintendent of Police said, adding that a thorough probe will be conducted to know the exact reason behind the incident.(Except for the headline, this story has not been edited by NDTV staff and is published from a syndicated feed.)HelplinesVandrevala Foundation for Mental Health9999666555orhelp@vandrevalafoundation.comTISS iCall022-25521111(Monday-Saturday: 8 am to 10 pm)(If you need support or know someone who does, please reach out to your nearest mental health specialist.)Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:Surat,Man Kills Wife,Man Kills Son",
    "word_count": 312,
    "extracted_at": "2024-12-27T10:42:33.632261"
  },
  {
    "title": "World Cinema 2024: The Ten Best Films Of The Year",
    "link": "https://www.ndtv.com/entertainment/world-cinema-2024-the-ten-best-films-of-the-year-7342987",
    "published": "Fri, 27 Dec 2024 14:26:23 +0530",
    "author": "",
    "summary": "From Challengers To Emilia Perez, NDTV's top ten picks for you",
    "categories": [
      {
        "term": "Hollywood",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "World Cinema 2024: The Ten Best Films Of The YearFromChallengersToEmilia Perez, NDTV's top ten picks for youRead Time:9 minsShareTwitterWhatsAppFacebookRedditEmailA still from Challengers. (Courtesy: X)New Delhi:In a world in the grip of conflict and turmoil, many filmmakers across the globe sought to put on record their sense of alarm. While some dived into the vortex of the growing unease to look for light in areas of darkness, others celebrated the joy that humanity engenders even when the space for positivity shrinks. On our list of ten best international films of 2024 are works by several established masters as well by as a few younger filmmakers who revel in ploughing a lonely furrow and try to make a sense of things spinning out of control.The Seed of the Sacred FigShot entirely in secret, Mohammad Rasoulof's Persian-languageThe Seed of the Sacred Fig,Germany's official entry for the Best International Feature Film Oscar, is a powerful political allegory that examines the workings of an autocracy through the lens of fissures that open within the family of a government functionary appointed as an investigating judge in Tehran. As protests erupt in the streets of the city and the man hands out hundreds of death penalties every single day and a gun given to him for protection goes missing, he is gripped by suspicion and distrust of his own family - his wife and two daughters, whose sympathies lie with the protesters. Rasoulof crafts a tale of a moral and psychological tussle between the man and three women who make up his family. It mirrors the divisions in Iranian society while reflecting the moral dilemmas that face individuals fighting, silently or actively, against, or for, a repressive regime.A still from The Seed of the Sacred FigEmilia PerezA magnificently luminous musical informed with deep complexities, Jacques Audiard'sEmilia Perezis a dazzlingly free-flowing drama centred on a crime cartel kingpin who goes in for gender affirmation surgery. The French production - the film's principal language is Spanish and the main setting is Mexico City - is propelled by a fantastic female ensemble (Karla Sofia Gascon, Zoe Saldana, Selena Gomez, Adriana Paz) and embellished with songs deftly dovetailed into the immersive narrative. The dreaded gangster enlists the help of a lawyer to disappear from the public eye and transition to a woman. The duo pulls off the daring ruse but the crime boss' wife and children and her past inevitably catch up with her.Emilia Perez, an unblemished tour de force, is about three women fighting to break free from cages of different kinds - the transwoman rids herself of the man's body she is trapped in, the lawyer shakes off the soul-crushing impact of a dissatisfying career, and the gangster's conflicted wife seeks to live down an unhappy marriage and a 'tragedy'. The differing fates and battles are woven into a remarkable tapestry of human experiences.A still from Emilia PerezThe SubstanceCoralie Fargeat's feminist fable, starring Demi Moore and Margaret Qualley, is pitch dark in spirit, but the substance around which it is built is replete with colour, including whites and greys that reflect the state of mind of the protagonist, an ageing celebrity who on being fired from a popular TV show procures a grey-market drug that promises to create a younger version of herself. The Substance is as harrowing as it is electrifying in its savage takedown of showbiz where women have to reckon with unrealistic notions of beauty and saleability thrust upon them by an industry driven by bottomlines. Defiantly pulpy yet uncompromisingly polemical, the parable pulls no punches. Subtlety is not what Fargeat is aiming for. The Substanceis after all a body-horror movie that makes no bones about reimagining the genre in the light of the indignity of objectification that a male-dominated world subjects its women to. It shocks and scalds.ChallengersLuca Guadagnino'sChallengersdoes with tennis that no movie has ever done. The dynamics of the sport serve as a force that determines the shifting equations among three young people played by Zendaya, Josh O'Connor and Mike Faist over a decade and a bit. The messy triangle witnesses the ball being smashed relentlessly from one court to the other. It yields a fascinatingly erotic drama that employs subtle and highly effective means to titillate and provoke.Challengers,to an extent, is an elaboration on Guadagnino's \"desire\" trilogy -I Am Love, A Bigger SplashandCall Me by Your Name.It is a sensuous and beguiling sports film that brilliantly plays up the emotional dimensions of a contest that goes beyond wins and losses. The highest point ofChallengersis its incredibly hypnotic finale, which unlocks the power of cinema in a magically twisty way. Not that the rest of the film has any dearth of similar flashes of inspiration.A poster of ChallengersMegalopolisUnapologetically self-indulgent and unceasingly inventive, 85-year-old Francis Ford Coppola's jaunty epic could easily be dismissed as an expensive folly. But hang on, leaps of faith of the kind thatMegalopolisis are rare in this era of AI-driven marketing of entertainment products and should, therefore, be talked up. \"When you leap into the unknown, you prove you are free,\" says one character in the film.Megalopolisis indeed free and fearless. It is the sort of big-swing filmmaking that only a master who has nothing left to prove can attempt. The film's hero, a visionary architect who hopes to change the course of history and the face of the world, is not unlike the film itself. He may falter, given the sheer scale of his ambition. But his derring-do is in itself a work of art. It is an act of defiance of megalomanic and eye-popping proportions.Spectateurs!French director Arnaud Desplechin's hybrid film branches out in different, exciting directions in its celebration of the love of cinema and the spaces in which movies are screened.Spectateurs!,as the title suggests, is not so much about makers of films as about its consumers. Stringing together clips from 50-plus films that shaped his cinematic vision, Desplechin focuses on the filmmaker's alias, Paul Dedalus, as a spectator. When we first see him, he is a child watching the 1964 French comedy Fantomas with his grandmother. In a tongue-in-cheek later scene, Dedalus lies about his age in order to watch Bergman's Cries and Whispers. The cashier at the ticket counter lets him in but not before warning him that the film will bore him. Informative and entertaining in equal parts,Spectateurs!provides a convincing substantiation of a line that defines the film: Cinema is a question, not an answer.No Other LandMore than a film,No Other Land,the only documentary on this list, is a statement of hope and intent made by a Palestinian-Israeli collective of activists working to find a way around the conflict raging in the region. Directed by Basel Adra, Hamdan Ballal, Yuval Abraham and Rachel Szor. The project, a Palestine-Norway co-production, is led by Basel Adra, a trained but jobless law graduate who has been recording and resisting the displacement of his people in Masafer Yatta region of the West Bank, since he was a boy, and Israeli journalist Yuval Abraham, who represents a voice of reason in a climate in which the army is mandated to demolish the homes of those that have lived on the land for nearly two centuries. Personal and political,No Other Landpaints a harrowing portrait of a people grappling with the stress, humiliation and depression of enduring decades of occupation and oppression.Grand TourPortuguese auteur Miguel Gomes's utterly mesmeric cinematic adventure is a brilliant mix of austerity of craft and flamboyance of ideas. In 1918, a British civil servant runs away from his fiance the day she arrives in Rangoon to get married. I will hunt him down whatever it takes, says the spirited Molly Singleton and goes on a tour across Asia for the purpose. The melancholic runaway Edward Abbott travels across Singapore, Bangkok, Saigon, Manila, Shanghai and parts of Japan. The film retraces the path using a mix of period and contemporary scenes, a blend of b&w and colour, and a voiceover in various languages, each representing a specific location. The impeccably craftedGrand Touris at once beguiling and befuddling but always masterly. The tonalities are orchestrated with marvellous dexterity when, midway, the film shifts its focus from the morose man to the cheerful woman. For Gomes and Molly, \"men are a tragedy, humanity is a tragedy\".A still from Grand TourThe Wild RobotAs wild and wacky as it is moving and magical,The Wild Robot, written and directed by Chris Sanders, is the solitary animation film here because it marks the medium's emphatic return to its vibrant and vivid hand-painted roots. Based on the 2016 children's book of the same name by Peter Brown, it tells the story of a marooned helper-robot and an orphaned gosling whose paths cross in tragic and tumultuous circumstances on an island uninhabited by humans. A deep connection develops between the two. From their bonding flows a moving mother-adopted daughter story that sublimely transcends the boundary separating Nature and Machine. The magnificently executed animated film blends technology, the vitality of wildlife, and human emotions (although the plot has no human character) to rustle up a vibrant exploration of motherhood and cross-species solidarity in a forest where predators roam free and the weak are perennially under the threat of annihilation.A still from AprilAprilGeorgian writer-director Dea Kulumbegashvili's sophomore venture is a visually evocative, tangential study of a community where the only constant is the will of the men who seek control over everything but are themselves never amenable to control. In its ambiguities and stylistic angularities,Aprilis as strong as Kulumbegashvili's debut film, Beginning. But the sole major commonality between the two films is lead actress Is Sukhitashvili, who plays an obstetrician in a Georgian village where she performs abortions despite the procedures being illegal. The dreary routine of her life is upset when she is accused of negligence and faces an inquiry. The defence of her values and the fight against facile assumptions that shape morality in the community takes its toll.Aprilis a tough watch. However, its intriguing premise and the director's adroit nuanced treatment of a woman at odds with the world around her lend the film an aura of solidity.Show full articleCommentsEntertainment I Read Latest News on NDTV Entertainment. ClickNDTV EntertainmentFor TheLatestIn,bollywood,regional,hollywood,tv,web series,photos,videosand More.Follow us:World Cinema 2024,Emilia Perez,Challengers",
    "word_count": 1700,
    "extracted_at": "2024-12-27T10:42:34.563535"
  },
  {
    "title": "Watch: Bumrah's Cold Celebration As He Dismisses Travis Head For Duck",
    "link": "https://sports.ndtv.com/cricket/jasprit-bumrahs-cold-celebration-as-he-dismisses-travis-head-for-duck-7334047",
    "published": "Fri, 27 Dec 2024 14:16:57 +0530",
    "author": "",
    "summary": "Travis Head was bowled for a duck by Jasprit Bumrah on Day 1 of the Boxing Day Test in Melbourne.",
    "categories": [
      {
        "term": "Cricket",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Story ProgressBack to homeWatch: Jasprit Bumrah's Cold Celebration As He Dismisses Travis Head For DuckTravis Head was bowled for a duck by Jasprit Bumrah on Day 1 of the Boxing Day Test in Melbourne.facebooktwitterWhatsAppredditE-mailJasprit Bumrah bowled Travis Head for a duck© X (Twitter)Since the start of the Border-Gavaskar Trophy, the biggest thorn in India's bushes has beenTravis Head. The middle-order batter, however, failed to continue his hot form in the 4th Test at the Melbourne Cricket Ground, departing for a duck. It was none other than India's premier fast bowlerJasprit Bumrahwho sent Head packing before the batter settled himself, giving India a prized wicket that shifted the momentum in the touring team's favour.Head has been the top-scoring batter in the series. Hence, his early dismissal gave the team a big boost. Head, hoping that Bumrah's delivery would miss the stumps by a safe distance, saw his bails being dislodged as he decided to leave the ball. The batter had no option but to leave the pitch.“Game-changer player is only one guy JASPRIT BUMRAH!\"#TravisHead\"leaves\" without troubling the scorers!#AUSvINDOnStar4th Test, Day 1 | LIVE NOW! |#ToughestRivalry#BorderGavaskarTrophypic.twitter.com/p6a0gzc3BB— Star Sports (@StarSportsIndia)December 26, 2024Bumrah did manage to pull India back into the game in the third and final session of the day but the first two sessions belonged to Australia.Earlier in the day, debutant Sam Konstas played fearless cricket at the MCG to give Australia an early advantage in the series. Konstas and Khawaja opened for the Aussies and cemented a partnership of 89 runs.The India bowling attack led by Jasprit Bumrah and Mohammed Siraj struggled to get a breakthrough in the first session as the Aussies openers continued to build on their partnership. In the 14th over, Konstas smashed his maiden international fifty and became the second youngest to score a half-century for Australia in Test cricket.Listen to thelatest songs, only onJioSaavn.comKonstas' blitz knock came to an end after Ravindra Jadeja came to the rescue of the visitors and removed the dangerous debutant from the crease in the 20th over.Later, Khawaja, Marnus Labuschagne and Steve Smith also managed to bag respective half-centuries.CommentsTopics mentioned in this articleIndia Cricket TeamAustralia Cricket TeamTravis HeadJasprit BumrahAustralia vs India 2024/25CricketGet the LatestCricketUpdates, CheckIndia Tour of Australia 2024-25,Results,NewsandIPL 2025 Mega AuctionUpdates atNDTV Sports. Like Us OnFacebookOr Follow Us OnTwitterFor More Sports Updates. You Can Also Download The NDTV Cricket App ForAndroidOriOS.",
    "word_count": 391,
    "extracted_at": "2024-12-27T10:42:35.643379"
  },
  {
    "title": "Woman Details \"Traumatising\" Experience With \"Disgusting\" Rapido Driver",
    "link": "https://www.ndtv.com/delhi-news/delhi-woman-details-traumatising-experience-with-disgusting-rapido-driver-7342866",
    "published": "Fri, 27 Dec 2024 14:15:37 +0530",
    "author": "",
    "summary": "A Delhi-based journalist has shared a \"traumatising\" account of her recent ride with Rapido, the popular bike taxi service.",
    "categories": [
      {
        "term": "Delhi",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Woman Details \"Traumatising\" Experience With \"Disgusting\" Rapido DriverIn a lengthy LinkedIn post, the woman highlighted several red flags during the ride.Read Time:3 minsShareTwitterWhatsAppFacebookRedditEmailThe cab arrived late and reeked of foul odour.A Delhi-based journalist has shared a \"traumatising\" account of her recent ride with Rapido, the popular bike taxi service. Tanima Banerjee recounted a late-night ride from Connaught Place (CP) to Kalkaji with a \"sick and disgusting\" driver that left her shaken and disappointed with Rapido's handling of the situation.In alengthy LinkedIn post, the journalist highlighted several red flags during the ride. The cab arrived late and reeked of foul odour. \"The cab was stinking,\" she wrote.The driver displayed unsettling behaviour, including constant \"fidgeting and making grunting noises.\" Despite her initial discomfort, she tried to overlook these issues by talking with her mother over the phone.At the Barakhamba crossing, the driver rudely interrupted her call, complaining about her \"loud\" conversation. He demanded she either stop talking or lower her voice so he could enjoy his music. \"He said he wants to listen to his songs but is unable to because of my loud voice,\" Ms Banerjee wrote.She refused to comply, saying her conversation wasn't affecting his driving. This led to a heated argument, during which the driver allegedly argued, threatened to drop her mid-ride, and began behaving erratically. \"He is making me feel unsafe like I am at his mercy while in his car, do what he pleases,\" she said.\"He kept driving and kept mumbling something. He seemed to be either on drugs, or drunk. He also made dirty expressions at me,\" Ms Banerjee wrote. Fearing for her safety, she demanded the ride be stopped near the Mandi House police station. \"He stopped in the middle of the road, but did not cancel the ride,\" she said. \"It was only after half an hour that the app showed the ride was over.\"Immediately after the incident, the journalist raised a complaint with Rapido's customer service team. While the company acknowledged the unacceptable behaviour and issued a verbal warning to the driver, no action was taken to ensure such incidents did not recur. \"In terms of taking action, all they did was give him a warning, a rap on the knuckles, at least that's what I was told by the agent,\" revealed Ms Banerjee.\"This man should ideally not be allowed to take any passengers, let alone women,\" she argued. \"Is women's safety a joke? Are they waiting for something worse to happen before taking any action at all?\"Her detailed post included the driver's name, photo, and chat transcripts with Rapido. \"Please do not accept a ride with this sick, disgusting man,\" she requested.She also said she was \"thoroughly disappointed as well as traumatised\" from the incident and Rapido's \"hollow response.\" \"Will think twice before booking my next ride,\" she said.Hours after the post, the ride-hailing platform responded, issuing a public apology. \"The captain's behaviour is entirely unacceptable, and the distress caused to you, Tanima, is inexcusable. Your safety and satisfaction are our highest priorities, and it is clear this situation failed to meet those standards. This incident has been fully investigated, and decisive action is being taken,\" they wrote.The company confirmed that the driver's account had been suspended, describing his behaviour as \"unprofessional\" and \"completely unacceptable.\"Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:Rapido,Woman,Delhi",
    "word_count": 554,
    "extracted_at": "2024-12-27T10:42:36.623377"
  },
  {
    "title": "Osamu Suzuki, Former Suzuki Chairman Dies Aged 94",
    "link": "https://www.ndtv.com/auto/osamu-suzuki-former-suzuki-chairman-dies-aged-94-7342923",
    "published": "Fri, 27 Dec 2024 14:14:07 +0530",
    "author": "",
    "summary": "The former chairman, Osamu Suzuki lead the corporation for over four decade.",
    "categories": [
      {
        "term": "News",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Osamu Suzuki, Former Suzuki Chairman Dies Aged 94The former chairman, Osamu Suzuki lead the corporation for over four decade.Read Time:2 minsShareTwitterWhatsAppFacebookRedditEmailOsamu Suzuki stepped down as the chairman of the organisation in 2021Osamu Suzuki, the former chairman of Suzuki Motor Corp. and an icon in the global auto industry has passed away at the age of 94, as per Nikkei Asia's report. The former chairman of the Japanese brand who led the organisation for over four decades has reportedly died of lymphoma on December 25. It is to be noted that Suzuki stepped down as the chairman of the brand in 2021 at the age of 91.Osamu Suzuki began his time at Suzuki Motor in 1958 and took the role of the president in 1978 while doubling as the chairman 2000 onwards. With his time of 28 years on the chair across two terms as the president of the brand he became the longest-serving head of the global automaker.Also Read:Bharat Mobility Expo 2025: Check Auto Expo's Dates, Location, And MoreThe post of the president was later transferred to his son in June 2015, while Osamu Suzuki handled the role of being the chairman and CEO for a year. After a year, he stepped down as the CEO after a fuel-economy misstatement.By the 1990s, the Maruti-Suzuki collaboration became a household name, rolling out over 200,000 units annually and establishing India as a manufacturing hub for Suzuki vehicles in the region. Suzuki's strategic vision didn't just stop at cars; he built partnerships, explored untapped markets, and turned Suzuki Motor into a global brand.During the 1990s, the partnership between Maruti and Suzuki became widely recognized, producing more than 200,000 vehicles each year and positioning India as a key manufacturing center for Suzuki cars in the area. Osamu Suzuki's strategic outlook extended beyond automobiles; he forged alliances, ventured into new markets, and transformed Suzuki Motor into an internationally recognized brand.All of Osamu's Suzuki contributions to the automotive world earned him the place in Motoring Hall Of Fame (MHOF).Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:Osamu Suzuki,Suzuki Motor Chairman,Suzuki Motor",
    "word_count": 348,
    "extracted_at": "2024-12-27T10:42:37.549632"
  },
  {
    "title": "Audi Q7 Facelift First Drive Review: Strong But Subtle",
    "link": "https://www.ndtv.com/auto/audi-q7-facelift-first-drive-review-strong-but-subtle-7342921",
    "published": "Fri, 27 Dec 2024 14:13:26 +0530",
    "author": "",
    "summary": "Once the favorite of the rich and famous, the Q7 has received its second facelift in nearly three years to bring it up to speed with more modern competition.",
    "categories": [
      {
        "term": "car-reviews",
        "scheme": null,
        "label": null
      }
    ],
    "full_text": "Audi Q7 Facelift First Drive Review: Strong But SubtleOnce the favorite of the rich and famous, the Q7 has received its second facelift in nearly three years to bring it up to speed with more modern competition.Read Time:4 minsShareTwitterWhatsAppFacebookRedditEmailA loyalty rate of 35 percent, where one in three buyers are repeat customers, while total sales add up to more than 10,000 units. These are the numbers the Audi Q7 has achieved in the Indian market, which are quite impressive for a luxury SUV that costs as much. Its rivals have moved ahead in terms of modernity but are also much costlier than the Q7, which seems like a good deal as far as the starting price of Rs 88 lakh is concerned. We drove the top-spec Technology trim (Rs 97 lakh) to find out whether it's worth it or not.Audi Q7 Facelift ExteriorBeing a facelift, the entire update is concentrated on the front, with the grille now equipped with vertical chrome studs flanked by the matrix LED headlamps. The bumper features vertical slats and wider openings for the radiator. The side profile is unchanged, but the alloy wheels are now bigger, with the size increased from 19 inches to 20 inches.The rear end of the car features new internals for the LED tail lamps along with a slightly redesigned bumper. The Q7 remains dimensionally unchanged and measures 5,072 mm in length, 1,970 mm in width, and 1,705 mm in height, while the wheelbase is 3,000 mm. The company is also offering a new Sakhir Gold exterior color option.Audi Q7 Facelift Interior and FeaturesYou'll have to pull out a magnifying glass to tell the interior apart from the pre-facelift model. The cabin features a new open-pore wood trim for the dashboard as well as the doors. There are no other changes, but the material quality, fit, and finish are top-notch. The seats are comfortable, with the right amount of cushioning and space to accommodate even the biggest frames. Audi is offering Cedar Brown and Saiga Beige interior color options to choose from.The dual display with a 10-inch touchscreen and touchpad for AC controls remains the same. It gets a panoramic sunroof, 4-zone climate control, a virtual cockpit for the driver, a 19-speaker Bang & Olufsen audio system, park assist with a 360-degree camera, 8 airbags, and the newly added lane-keep assist. However, it lacks many modern features like wireless connectivity, ventilated seats, and a Level 2 ADAS suite.The second row is spacious, and the seats allow for fore-and-aft movement along with manual sun blinds and dedicated AC vents. The third row is unusable for anyone except a lean teen or children. It's better to electrically fold the third row of seats for massive boot space. The Q7's spare wheel has been replaced by a puncture repair kit.Audi Q7 Facelift Driving ExperienceThe Audi Q7 facelift comes with a 3.0-litre V6 turbo petrol engine that delivers 340 hp and 500 Nm of torque. It's paired with an 8-speed automatic gearbox that sends power to all four wheels, as the Q7 comes with Quattro tech as standard. The 0-100 kmph sprint takes 5.6 seconds, while the top speed is rated at 250 kmph. The performance is linear, and the gear shifts are almost imperceptible, making it a long-legged cruiser. Cruising at 100 kmph feels calm, with low NVH levels and the tachometer hovering around 1,600 rpm.The Q7 comes with air suspension, which can alter ride quality depending on the drive mode. The Comfort mode absorbs bad roads easily but might seem a little too soft for those who prefer self-driving. The Dynamic mode is better suited for long-distance travel. The Q7 corners confidently for a 7-seater SUV, thanks to the Quattro system. However, don't get carried away, as it will understeer if pushed hard.Audi Q7 Facelift VerdictThe Audi Q7 competes with SUVs like the Mercedes-Benz GLE and the BMW X5, both of which offer a gamut of new features and cost Rs 10 to Rs 25 lakh more than the Q7. If you want the latest and flashiest package, the Q7 may not be for you. But if you're looking for a smartly packaged chauffeur-driven luxury SUV with decent features, performance, and a strong legacy, the Q7 is a strong contender.Show full articleCommentsTrackLatest NewsLive on NDTV.com and getnewsupdates fromIndiaand around theworldFollow us:Audi Q7,Audi Q7 Facelift,Q7 Facelift",
    "word_count": 722,
    "extracted_at": "2024-12-27T10:42:38.560480"
  }
]